{"error":null,"hits":10000,"facets":{},"content":{"sidebar":{},"search_results":{}},"jobs":[{"basic_qualifications":"• Minimum of 5+ years experience in the telecommunications sector, with demonstrated expertise in carrier contract negotiations and vendor management\u003cbr/\u003e* 2+ years experience in the A2P messaging space (carrier relations or business development)\u003cbr/\u003e• Comprehensive knowledge of global messaging infrastructure including carrier technology (e.g., SMS, MMS, RCS) and OTT platforms such as WhatsApp, Apple Messages for Business, Line, Kakao Business, Viber.\u003cbr/\u003e• Experience negotiating commercial terms and pricing within the telecommunications industry.\u003cbr/\u003e• Proven international experience in at least one telecom market outside of the US/Canada, with understanding of regional market dynamics and regulatory frameworks\u003cbr/\u003e* Strong understanding of software, APIs, cloud platforms, and emerging technologies with the ability to converse at a deep technical level","business_category":"aws","city":"Seattle","company_name":"Amazon Development Center U.S., Inc.","country_code":"USA","description":"As part of the AWS Applied AI Solutions organization, we have a vision to provide business applications, leveraging Amazon’s unique experience and expertise, that are used by millions of companies worldwide to manage day-to-day operations. We will accomplish this by accelerating our customers’ businesses through delivery of intuitive and differentiated technology solutions that solve enduring business challenges. We blend vision with curiosity and Amazon’s real-world experience to build opinionated, turnkey solutions. Where customers prefer to buy over build, we become their trusted partner with solutions that are no-brainers to buy and easy to use. \u003cbr/\u003e\u003cbr/\u003e The End User Messaging service powers the communication infrastructure for both AWS customers and Amazon digital properties, enabling SMS, MMS, WhatsApp, push notifications, and text-to-voice message delivery to end users.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eYou will lead our messaging and communications partnership initiatives, building relationships with key telecommunications technology partners. This role combines strategic business development with technical expertise to drive revenue growth through innovative partner solutions.\u003cbr/\u003eYou'll manage the full partnership lifecycle - from identification through implementation and ongoing relationship management. Your telecommunications expertise will guide partnership evaluation from both technical and commercial perspectives, ensuring alignment with our strategic objectives and customer needs.\u003cbr/\u003eAs the primary technical liaison, you'll connect partners with internal teams, translating complex telecommunications capabilities into clear business value. Success requires staying ahead of industry developments, including RCS Business Messaging, VoIP technologies, and regulatory compliance standards. You'll also leverage AI technologies to optimize partnership processes and enhance our communications platform.\u003cbr/\u003eThe ideal candidate brings proven experience in telecommunications technology, partnership management, and complex technical integrations. Your expertise will directly influence our product strategy and drive innovation in our communications solutions.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003e•\tReview overnight communications from APAC partners regarding a new carrier integration project. Prepare notes for the upcoming technical review meeting with solution architects.\u003cbr/\u003e•\tLead a video call with a partner’s VP of Strategic Partnerships and their technical team to discuss API integration timelines and review performance metrics for existing messaging services. Present our roadmap for expanding voice capabilities and discuss potential customer opportunities.\u003cbr/\u003e•\tMeet with our product team to share updates about new compliance requirements. Collaborate on prioritizing feature requests and discuss technical feasibility of new integration points requested by key partners.\u003cbr/\u003e•\tPrepare materials for next week’s executive business review. Analyze performance metrics, compile ROI data, and create presentations highlighting successful joint implementations.\u003cbr/\u003e•\tLead the monthly partnership status review with internal stakeholders. Update teams on partner pipeline, ongoing integrations, and emerging market opportunities. \u003cbr/\u003e•\tDraft a proposal for a new strategic partnership opportunity, incorporating AI-powered features for enhanced message routing and delivery optimization.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eABOUT AWS:\u003cbr/\u003e\u003cbr/\u003eDiverse Experiences \u003cbr/\u003eAmazon values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying. \u003cbr/\u003e\u003cbr/\u003eWhy AWS \u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003eWork/Life Balance \u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why flexible work hours and arrangements are part of our culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud. \u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture \u003cbr/\u003eHere at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. Ongoing events and learning experiences, including our Conversations on Race and Ethnicity and AmazeCon conferences, inspire us to never stop embracing our uniqueness.\u003cbr/\u003e\u003cbr/\u003eMentorship and Career Growth\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional. ","department_cost_center":null,"description_short":"As part of the AWS Applied AI Solutions organization, we have a vision to provide business applications, leveraging Amazon’s unique experience and expertise, that are used by millions of companies worldwide","display_distance":null,"id":"547dcce6-7326-49e9-81e0-df001eb1c6be","id_icims":"3124793","is_intern":null,"is_manager":null,"job_category":"Project/Program/Product Management--Technical","job_family":"Infra Business Dev - Tech","job_function_id":null,"job_path":"/en/jobs/3124793/technical-business-development-aws-end-user-messaging","job_schedule_type":"full-time","location":"US, WA, Seattle","locations":["{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Seattle\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Seattle\",\"coordinates\":\"47.60357,-122.32945\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Seattle, Washington, USA\",\"location\":\"US, WA, Seattle\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA68\"],\"normalizedCityName\":\"Seattle\"}"],"normalized_location":"Seattle, Washington, USA","optional_search_labels":[],"posted_date":"November 11, 2025","preferred_qualifications":"• Experience as a leader of cross-discipline teams for major feature and service launches\u003cbr/\u003e• Experience influencing at all levels of an organization\u003cbr/\u003e• Excellent communication and negotiation skills to prioritize projects and get commitments from internal stakeholders, including TPMs, SDEs, SDMs, program managers, and leaders at multiple levels across operations, legal, and business areas.\u003cbr/\u003e• Excellent writing and communication skills.\u003cbr/\u003e• Exceptional analytical and project reporting skills.\u003cbr/\u003e• Strong bias for action with an ability to operate in a fast-paced environment both for the short-term answer, and long-term/scalable solution.\u003cbr/\u003eFrom a business and technical perspective, this leader will:\u003cbr/\u003e• Have experience shaping business strategy for technical products or services. \u003cbr/\u003e• Possess deep industry expertise in enterprise software and services\u003cbr/\u003eMasters of Business Administration degree preferred.\u003cbr/\u003e\u003cbr/\u003eProfessional traits of Amazon leaders:\u003cbr/\u003e• Relentless focus on the customer\u003cbr/\u003e• Exhibit excellent judgment\u003cbr/\u003e• Have high standards\u003cbr/\u003e• Dive deep into the details of the business\u003cbr/\u003e• Deliver results\u003cbr/\u003e• Think big\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003eOur compensation reflects the cost of labor across several US geographic markets. The base pay for this position ranges from $133,100/year in our lowest geographic market up to $220,100/year in our highest geographic market. Pay is based on a number of factors including market location and may vary depending on job-related knowledge, skills, and experience. Amazon is a total compensation company. Dependent on the position offered, equity, sign-on payments, and other forms of compensation may be provided as part of a total compensation package, in addition to a full range of medical, financial, and/or other benefits. For more information,  please visit \u003ca href=\"https://www.aboutamazon.com/workplace/employee-benefits\"\u003ehttps://www.aboutamazon.com/workplace/employee-benefits\u003c/a\u003e. This position will remain posted until filled. Applicants should apply via our internal or external career site.","primary_search_label":"aws.team-business-development-primary","source_system":"JobCreator","state":"WA","title":"Technical Business Development , AWS End User Messaging","university_job":null,"updated_time":"13 minutes","url_next_step":"https://account.amazon.com/jobs/3124793/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-business-development-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 7+ years of working as a Technical Product Manager experience\u003cbr/\u003e- 5+ years of technical (software development, network development, IT, other related) experience\u003cbr/\u003e- Experience delivering large-scale SaaS, PaaS or LaaS products where you are responsible for the full product lifecycle, from concept through GTM (go to market)\u003cbr/\u003e- Bachelor's degree in Computer Science, Engineering, or a related technical field\u003cbr/\u003e- Experience defining product strategy for developer-facing tools with significant adoption\u003cbr/\u003e- Deep understanding of AI agents, large language models, and agentic workflows\u003cbr/\u003e- Demonstrated ability to influence without authority across large, distributed organizations\u003cbr/\u003e- Experience working with engineering teams, applied scientists, and cross-functional stakeholders\u003cbr/\u003e- Strong written and verbal communication skills with experience presenting to senior leadership and external customers\u003cbr/\u003e- Understanding of cloud computing platforms, APIs, and software development lifecycle","business_category":"aws","city":"New York","company_name":"Amazon Development Center U.S., Inc.","country_code":"USA","description":"We're building the future of cloud development by making AWS the most agent-friendly cloud provider. The AWS Developer Tools organization is transforming how developers and AI agents interact with AWS through innovative tools and services, including Model Context Protocol (MCP) servers and agent-native interfaces that enable seamless software development.\u003cbr/\u003e\u003cbr/\u003eAs Principal Product Manager - Technical for External Services, you'll own the product strategy and execution for how AI agents interface with AWS services. Your current focus includes Model Context Protocol (MCP) servers and other agent-native interface patterns, with responsibility for defining and driving the evolution of these interfaces as the technology landscape advances. You'll determine how millions of developers and AI agents discover, authenticate with, and utilize AWS services through standardized interfaces.\u003cbr/\u003e\u003cbr/\u003eIn this role, you'll drive the vision for making AWS services accessible to AI agents, define standards that govern how service teams build agent-friendly interfaces, and own the measurement and continuous improvement of the agent experience across AWS. You'll evaluate emerging protocols and interface patterns, determining when to adopt, extend, or replace existing approaches to maintain AWS's leadership in agent-native computing. You'll work at the intersection of AI, developer experience, and cloud infrastructure to pioneer the next generation of agent-native cloud computing.\u003cbr/\u003e\u003cbr/\u003eYou'll collaborate with engineering teams, applied scientists, and AWS service teams across the company to ensure agent interfaces follow best practices, deliver measurable value to customers, and create cohesive experiences for both traditional developers and AI agents. This role requires deep technical understanding of AI agents, developer tools, and AWS services, combined with the ability to influence without authority across a large, distributed organization.\u003cbr/\u003e\u003cbr/\u003eIf you're passionate about enabling the agentic future of software development and excited about defining how AI agents interact with cloud infrastructure, this role offers the opportunity to shape AWS's agent-first strategy.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Define product vision for agent-native AWS experiences, including service discovery, well-architected decision-making, and automated infrastructure management\u003cbr/\u003e- Define product strategy and roadmap for agent-native interfaces to AWS services, with current focus on MCP servers and other emerging interface patterns, including responsibility for identifying and driving next-generation approaches\u003cbr/\u003e- Establish standards for security, design, and implementation that enable service teams to build agent-friendly interfaces across current and future protocols\u003cbr/\u003e- Own measurement and continuous improvement of the agent experience, including instrumentation, metrics, and feedback loops that drive product iteration and inform interface evolution\u003cbr/\u003e- Build evaluation frameworks and benchmarking systems for measuring agent effectiveness, interface performance, and developer experience across multiple integration patterns\u003cbr/\u003e- Evaluate emerging agent interface technologies and protocols, making strategic recommendations on adoption, investment, and migration paths\u003cbr/\u003e- Drive cross-functional initiatives with AWS service teams to expand agent-friendly capabilities across AWS services and create seamless agent workflows\u003cbr/\u003e- Work with engineering teams to prioritize features, resolve technical tradeoffs, and ensure operational excellence for agent interfaces\u003cbr/\u003e- Engage with customers and gather feedback to validate use cases, identify pain points, and iterate on capabilities\u003cbr/\u003e- Communicate product vision, strategy, and progress to senior leadership, demonstrating how agent-native interfaces accelerate customer innovation \u003cbr/\u003e- Represent AWS in the broader community, engaging with open-source contributors and industry partners to shape protocol evolution","department_cost_center":null,"description_short":"We're building the future of cloud development by making AWS the most agent-friendly cloud provider. The AWS Developer Tools organization is transforming how developers and AI agents interact with AWS","display_distance":null,"id":"ad4848e8-ca6b-48d6-923b-f2d553f91bb2","id_icims":"3167827","is_intern":null,"is_manager":null,"job_category":"Project/Program/Product Management--Technical","job_family":"Product Management - Technical","job_function_id":null,"job_path":"/en/jobs/3167827/principal-product-manager-technical-external-services-aws-developer-tools","job_schedule_type":"full-time","location":"US, NY, New York","locations":["{\"normalizedStateName\":\"New York\",\"normalizedCountryCode\":\"USA\",\"city\":\"New York\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, NY, New York\",\"coordinates\":\"40.71453,-74.00712\",\"normalizedCountyName\":\"New York\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"New York, New York, USA\",\"location\":\"US, NY, New York\",\"region\":\"NY\",\"buildingCodeList\":[\"JFK25\"],\"normalizedCityName\":\"New York\"}"],"normalized_location":"New York, New York, USA","optional_search_labels":[],"posted_date":"January 27, 2026","preferred_qualifications":"- Advanced degree in Computer Science, Engineering, or related field\u003cbr/\u003e- Experience with Model Context Protocol (MCP), AI agent frameworks, or other agent-enabling interface technologies\u003cbr/\u003e- Understanding of emerging agent interface patterns and protocol evolution in the AI/ML space\u003cbr/\u003e- Background in developer experience optimization with focus on API design, SDK development, or developer tools\u003cbr/\u003e- Understanding of AWS services, infrastructure as code, and cloud deployment patterns\u003cbr/\u003e- Experience building evaluation frameworks or benchmarking systems for developer tools or AI systems\u003cbr/\u003e- Background in open-source software development, community engagement, and standards body participation\u003cbr/\u003e- Experience operating in complex, global organizations with multiple product lines and distributed teams\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, NY, New York - 199,200.00 - 269,500.00 USD annually","primary_search_label":"aws.team-product-management-primary","source_system":"JobCreator","state":"NY","title":"Principal Product Manager - Technical, External Services, AWS Developer Tools","university_job":null,"updated_time":"15 minutes","url_next_step":"https://account.amazon.com/jobs/3167827/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-product-management-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 3+ years of non-internship professional software development experience\u003cbr/\u003e- 2+ years of non-internship design or architecture (design patterns, reliability and scaling) of new and existing systems experience\u003cbr/\u003e- Experience programming with at least one software programming language","business_category":"alexa-and-amazon-devices","city":"Austin","company_name":"Amazon Kuiper Manufacturing Enterprises LLC","country_code":"USA","description":"Amazon Leo is an initiative to launch a constellation of Low Earth Orbit satellites that will provide low-latency, high-speed broadband connectivity to unserved and underserved communities around the world. As a Embedded Software Engineer you will be a part of the team participating in the definition and implementation of the communication software architecture of Amazon Leo’s broadband wireless modem. You will participate in all phases of physical layer software development, from architecture design, through requirements, implementation, test, and operational support. This is a unique opportunity to innovate and define novel wireless technology with few legacy constraints. The team develops the communication system of Leo and validates overall performance within key metrics such as throughput, latency, system availability, packet loss etc.\u003cbr/\u003e\u003cbr/\u003eExport Control Requirement\u003cbr/\u003eDue to applicable export control laws and regulations, candidates must be a U.S. citizen or national, U.S. permanent resident (i.e., current Green Card holder), or lawfully admitted into the U.S. as a refugee or granted asylum.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Develop embedded software in assembly, C, and C++ in a real-time operating system environment for broadband satellite communication modem systems.\u003cbr/\u003e- Work closely with ASIC, communication systems and software teams to support system bring-ups, end-to-end integration, and testing. \u003cbr/\u003e- Ability to adapt design and test activities based on current HW/SW capabilities delivered by the development teams.\u003cbr/\u003e- Support end-to-end testing using lab equipment such as Vector Signal Generators and Analyzers, Packet Generators, Channel Emulators. Contribute to development-test bring up procedures with Linux, Python, bash scripting etc.\u003cbr/\u003e- Support operations and maintenance using telemetry to validate link performance over key indicators such as throughput, latency, etc.\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eAs part of our software engineering team, you will design and implement software to deploy on Leo satellites in R\u0026D and commercial operation. You will also develop tests and debug capabilities to validate implementations on ground and on orbit. You will work in a collaborative environment with teams in hardware development, software development and network operations. You need to be flexible and responsive to fast changing priorities and issues.","department_cost_center":null,"description_short":"Amazon Leo is an initiative to launch a constellation of Low Earth Orbit satellites that will provide low-latency, high-speed broadband connectivity to unserved and underserved communities around the world.","display_distance":null,"id":"8d7056e6-3a3a-45f9-886f-1a40a33e417f","id_icims":"3163715","is_intern":null,"is_manager":null,"job_category":"Software Development","job_family":"Software Development","job_function_id":null,"job_path":"/en/jobs/3163715/embedded-sw-engineer-wireless-systems","job_schedule_type":"full-time","location":"US, TX, Austin","locations":["{\"normalizedStateName\":\"Texas\",\"normalizedCountryCode\":\"USA\",\"city\":\"Austin\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, TX, Austin\",\"coordinates\":\"30.26759,-97.74299\",\"normalizedCountyName\":\"Travis\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Austin, Texas, USA\",\"location\":\"US, TX, Austin\",\"region\":\"TX\",\"buildingCodeList\":[\"AUS13\"],\"normalizedCityName\":\"Austin\"}"],"normalized_location":"Austin, Texas, USA","optional_search_labels":[],"posted_date":"January 21, 2026","preferred_qualifications":"- 3+ years of full software development life cycle, including coding standards, code reviews, source control management, build processes, testing, and operations experience\u003cbr/\u003e- Bachelor's degree in computer science or equivalent\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, TX, Austin - 143,700.00 - 194,400.00 USD annually","primary_search_label":"alexa-and-amazon-devices.team-project-kuiper","source_system":"JobCreator","state":"TX","title":"Embedded SW Engineer, Wireless Systems ","university_job":null,"updated_time":"16 minutes","url_next_step":"https://account.amazon.com/jobs/3163715/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-project-kuiper","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 5+ years of non-internship professional software development experience\u003cbr/\u003e- 5+ years of programming with at least one software programming language experience\u003cbr/\u003e- 5+ years of leading design or architecture (design patterns, reliability and scaling) of new and existing systems experience\u003cbr/\u003e- Experience as a mentor, tech lead or leading an engineering team\u003cbr/\u003e- Experience programming in Python","business_category":"alexa-and-amazon-devices","city":"Redmond","company_name":"Amazon Kuiper Manufacturing Enterprises LLC","country_code":"USA","description":"Amazon Leo is Amazon's low Earth orbit satellite network. Our mission is to deliver fast, reliable internet connectivity to customers beyond the reach of existing networks. From individual households to schools, hospitals, businesses, and government agencies, Amazon Leo will serve people and organizations operating in locations without reliable connectivity.\u003cbr/\u003e\t\u003cbr/\u003eExport Control Requirement: Due to applicable export control laws and regulations, candidates must be a U.S. citizen or national, U.S. permanent resident (i.e., current Green Card holder), or lawfully admitted into the U.S. as a refugee or granted asylum.\u003cbr/\u003e\u003cbr/\u003eInnovation is part of our DNA! Our goal is to be Earth's most customer centric company, and we are just getting started. We need people who want to join an ambitious program that continues to push the state of the art in space based systems design.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eYou should be comfortable with a high degree of ambiguity and relish the idea of solving problems that haven't been solved at scale before. Along the way, we guarantee that you will learn a lot, have fun and make a positive impact on tens of millions of people.\u003cbr/\u003e\u003cbr/\u003eIn this role, you will:\u003cbr/\u003e\t• Architect and build software to automate hardware test systems\u003cbr/\u003e\t• Develop software infrastructure to support test case execution\u003cbr/\u003e\t• Architect and build automation to support development (CI/CD)\u003cbr/\u003e\t• Align with various stakeholders on software requirements\u003cbr/\u003e\t• Document software requirements from users\u003cbr/\u003e\t• Support manufacturing as well as new product development\u003cbr/\u003e\t• Enable automated data collection, data analysis\u003cbr/\u003e\t• Deliver end-user documents\u003cbr/\u003e\t• Own and execute software quality and release process\u003cbr/\u003e\t• Work with electrical test equipment\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eYou will have the opportunity to write software to test exciting products and help us bring our idea to reality.  Your software will enable the team to validate our designs and ensure all our hardware is space-worthy.  You will make daily decision on how to best create and deliver these tools.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eThis Software Development Engineer will have the opportunity to be a member of the Hardware Validation Team working within the wider Electrical Engineering Team.   This highly collaborative group of engineers has a diverse range of backgrounds and knowledge and looking for help to build a scalable and reliable test automation solution.  The team support both internal test needs as well as the needs of the manufacturing team.  They like to leverage and share work across the entire organization as well as utilize AWS resources and tools to accelerate their work.","department_cost_center":null,"description_short":"Amazon Leo is Amazon's low Earth orbit satellite network. Our mission is to deliver fast, reliable internet connectivity to customers beyond the reach of existing networks. From individual households to","display_distance":null,"id":"eb52c32c-1467-45c5-aab3-6da28537d850","id_icims":"3153885","is_intern":null,"is_manager":null,"job_category":"Software Development","job_family":"Software Development","job_function_id":null,"job_path":"/en/jobs/3153885/senior-software-dev-engineer-amazon-leo","job_schedule_type":"full-time","location":"US, WA, Redmond","locations":["{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Redmond\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Redmond\",\"coordinates\":\"47.67858,-122.13158\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Redmond, Washington, USA\",\"location\":\"US, WA, Redmond\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA111\"],\"normalizedCityName\":\"Redmond\"}"],"normalized_location":"Redmond, Washington, USA","optional_search_labels":["kuiper-sde"],"posted_date":"January  6, 2026","preferred_qualifications":"- 5+ years of full software development life cycle, including coding standards, code reviews, source control management, build processes, testing, and operations experience\u003cbr/\u003e- Bachelor's degree in computer science or equivalent\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003eOur compensation reflects the cost of labor across several US geographic markets. The base pay for this position ranges from $151,300/year in our lowest geographic market up to $261,500/year in our highest geographic market. Pay is based on a number of factors including market location and may vary depending on job-related knowledge, skills, and experience. Amazon is a total compensation company. Dependent on the position offered, equity, sign-on payments, and other forms of compensation may be provided as part of a total compensation package, in addition to a full range of medical, financial, and/or other benefits. For more information,  please visit \u003ca href=\"https://www.aboutamazon.com/workplace/employee-benefits\"\u003ehttps://www.aboutamazon.com/workplace/employee-benefits\u003c/a\u003e. This position will remain posted until filled. Applicants should apply via our internal or external career site.","primary_search_label":"alexa-and-amazon-devices.team-project-kuiper","source_system":"JobCreator","state":"WA","title":"Senior Software Dev Engineer, Amazon Leo","university_job":null,"updated_time":"16 minutes","url_next_step":"https://account.amazon.com/jobs/3153885/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-project-kuiper","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 5+ years of direct sales or business development in software, cloud or SaaS markets selling to C-level executives experience\u003cbr/\u003e- Experience engaging and influencing C-level executives, both business and technical\u003cbr/\u003e- Knowledge of cloud services such as AWS or equivalent\u003cbr/\u003e- Experience collaborating with cross-functional teams\u003cbr/\u003e- Experience in written and spoken English and an ability to compose grammatically correct, concise and accurate written responses","business_category":"aws","city":"Buenos Aires","company_name":"Amazon Web Services Argentina S.R.L.","country_code":"ARG","description":"Would you like to be part of a team focused on driving the adoption of Amazon Web Services in Enterprise accounts within the dynamic Energy sector in Argentina? Do you have the business knowledge, ability to build executive relationships, and technical expertise to help solve industry challenges with cloud and artificial intelligence services that AWS offers?\u003cbr/\u003e\u003cbr/\u003eAs an Enterprise Account Executive, you will have the opportunity to drive growth and support the business transformation of companies in the energy sector through cloud and artificial intelligence. Your responsibilities will include driving revenue, adoption, and market penetration in Energy sector accounts.\u003cbr/\u003e\u003cbr/\u003eWe are looking for a candidate with both commercial and technical background that enables them to drive conversations at the CXO level about digital transformation, cloud, and AI, as well as with software developers and IT architects. You must be self-driven and prepared to develop and execute an account coverage plan and meet revenue targets.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e\u003cbr/\u003e- Drive revenue, meeting or exceeding targets, and maintain a robust sales pipeline in a defined account list of the energy industry\u003cbr/\u003e- Develop and execute comprehensive account plans focused on business transformation with cloud and artificial intelligence\u003cbr/\u003e- Create and articulate compelling value propositions around AWS services by engaging with C-level executives, partners, and various stakeholders to accelerate customer adoption\u003cbr/\u003e-  Develop long-term strategic relationships with key accounts and ensure customer satisfaction\u003cbr/\u003e- Moderate travel required\u003cbr/\u003e","department_cost_center":null,"description_short":"Would you like to be part of a team focused on driving the adoption of Amazon Web Services in Enterprise accounts within the dynamic Energy sector in Argentina? Do you have the business knowledge, ability","display_distance":null,"id":"1db7ec9b-06f4-4f22-800f-d91eb73d3936","id_icims":"3149958","is_intern":null,"is_manager":null,"job_category":"Sales, Advertising, \u0026 Account Management","job_family":"Tech Sales","job_function_id":null,"job_path":"/en/jobs/3149958/enterprise-account-executive-amazon-web-services","job_schedule_type":"full-time","location":"AR, Buenos Aires","locations":["{\"normalizedStateName\":\"Buenos Aires Autonomous City\",\"normalizedCountryCode\":\"ARG\",\"city\":\"Buenos Aires\",\"countryIso3a\":\"ARG\",\"countryIso2a\":\"AR\",\"locationNonStemming\":\"Argentina, Buenos Aires\",\"coordinates\":\"-34.60849,-58.37344\",\"normalizedCountyName\":\"Buenos Aires City\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Argentina\",\"normalizedLocation\":\"Buenos Aires City, Buenos Aires Autonomous City, ARG\",\"location\":\"AR, Buenos Aires\",\"region\":\"\",\"buildingCodeList\":[\"EZE16\"],\"normalizedCityName\":\"Buenos Aires City\"}"],"normalized_location":"Buenos Aires City, Buenos Aires Autonomous City, ARG","optional_search_labels":[],"posted_date":"December 29, 2025","preferred_qualifications":"- Experience developing detailed go to market plans\u003cbr/\u003e- 3+ years of solving problems with technology in the Energy \u0026 Utilities industries experience\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"aws.team-sales-primary","source_system":"JobCreator","state":null,"title":"Enterprise Account Executive, Amazon Web Services","university_job":null,"updated_time":"17 minutes","url_next_step":"https://account.amazon.com/jobs/3149958/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-sales-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 人事もしくは勤怠・人事制度サポートの経験：2年を目安。\u003cbr/\u003e- 勤怠や人事諸制度の基礎的な知識\u003cbr/\u003e- Word、Excel、Power Pointのパソコン基本操作\u003cbr/\u003e- Wordによるビジネス文書作成ができる\u003cbr/\u003e- Excelによる表作成、関数が使用できる（Vlookup/ピボットなど）\u003cbr/\u003e- PPTによる資料の作成および修正作業ができる - ビジネスレベルの日本語","business_category":"global-corporate","city":"Osaka","company_name":"Amazon Japan G.K.","country_code":"JPN","description":"Japan Operations PXT Excellence Teamでは、私達と一緒にお客様起点に考え、人事領域で更なるイノベーションを起こしていただけるHRアソシエートパートナーを募集しています。勤務地は大阪住之江（Delivery Station）になります。PXT Excellence Teamは、各拠点や部署の人事責任者（HRBP）と共に全国に多数の事業部や物流拠点を持つOperations部門に所属する従業員をカスタマーとして人事業務およびプロセス改善を遂行します。\u003cbr/\u003e\u003cbr/\u003eHRアソシエートパートナーはサポート業務ではなくHRBPや担当部署や拠点のパートナーとして、Amazonの文化を維持しながら組織を強化し、社員が互いに学び、成長できる就業環境を構築する重要な役割です。 是非、私達と共にAmazonの新たな歴史をつくりましょう！\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e\u0026lt業務内容\u0026gt HRBPのサポートのもと、人事部の顔として以下の人事業務を責任をもって遂行いただきます。\u003cbr/\u003e・人事部門のフロントライン業務（主に社員からの問合せの一次対応）\u003cbr/\u003e・社員からの問い合わせを受ける事を通じて、社員エクスペリエンスの向上\u003cbr/\u003e・セルフサービスの推進によりストレスフリーな社員エクスペリエンスの提供\u003cbr/\u003e・入社オリエンテーションの実施や手続き業務\u003cbr/\u003e・人事データ管理業務・人事手続き業務（人事異動、出張に伴う手続き、勤怠管理など）\u003cbr/\u003e・社員の健康診断、予防接種、ストレスチェックの準備や管理業務\u003cbr/\u003e・安全衛生委員会の資料作成や産業医との折衝\u003cbr/\u003e・社内のエンゲージメントイベントやミーティングのコーディネーション業務\u003cbr/\u003e・人事関連や人事業務改善プロジェクトへの参画/推進\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003e\u0026lt就業環境\u0026gt\u003cbr/\u003e・PXT Excellence Teamは全国に約50名のHRアソシエートパートナーが所属しており、同じ拠点には複数名のHRアソシエートパートナーが在籍しています。チームで互いに連携、サポートしあいながら業務を進め、学び合える環境です。\u003cbr/\u003e・担当業務だけではなく、手を上げればご自身の担当領域を広げられるチャンスが多くあります。\u003cbr/\u003e＜勤務時間＞\u003cbr/\u003e・フレックス勤務（標準時間9時00分～18時00分、内1時間休憩）\u003cbr/\u003e・イベント対応など繁忙期は土・日・祝日勤務を下命することがあります（振替出勤・振替休日前提）\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003e私たちPXT Excellenceは拡大するBusinessニーズに対応するため、Operations人事の複数部門に所属していたHR Assistant集約化した組織として2024年6月に立ち上がりました。私たちのビジョンは標準化された業務と革新的な解決方法により、ビジネスに最高クラスのパートナーシップを提供することを掲げており、これらを少数精鋭で達成していきます。\u003cbr/\u003e\u003cbr/\u003e\u0026ltキャリアパス\u0026gt\u003cbr/\u003e・HRアソシエートパートナーからキャリアをスタートし、Sr HRアソシエートパートナーやHRBPへキャリアアップしているメンバーも多数在籍しています。Amazonには社内公募制度があり、国内外問わず他部署や異なる職種への異動にチャレンジし、社内で多様なキャリアを築くチャンスもあります。Amazonではご自身で学び成長することを推奨し、キャリア開発できるようサポートを行っています。\u003cbr/\u003e\u003cbr/\u003e\u0026lt会社のカルチャー\u0026gt\u003cbr/\u003eAmazonでは全員がリーダーです。個人の裁量に任される部分が多く、社員の個々の可能性を最大限に伸ばす事を重視しています。様々なバックグラウンドを持った社員が前職で培った多様な経験やスキルを活かして職位や役割に関わらず誰もがチャレンジできる環境です。 \u003cbr/\u003e\u003cbr/\u003eAmazon は多様かつインクルーシブな職場づくりを目指しています。Amazonは男女雇用機会均等法を順守しています。人種、 出身国、性別、性的指向、障がい、年齢、その他の属性によって差別することなく、平等に採用選考の機会を提供しています。\u003cbr/\u003e障がいをお持ちの方は、以下をご覧ください。https://www.amazon.jobs/disability/jp\u003cbr/\u003e\u003cbr/\u003eオペレーション部門のDEIの取り組み（Japanese Only）\u003cbr/\u003e\u003cbr/\u003e　\u003cbr/\u003e関連情報\u003cbr/\u003e・担当部門の紹介：\u003ca href=\"https://www.amazon.co.jp/b?node=5637343051\"\u003eラストマイル(AMZL) \u003c/a\u003e\u003cbr/\u003e・職種の紹介：\u003ca href=\"https://www.amazon.co.jp/b?node=5609908051\"\u003e人事\u003c/a\u003e\u003cbr/\u003e・部門の紹介：\u003ca href=\"https://www.amazon.co.jp/b?node=5637340051\"\u003e人事\u003c/a\u003e\u003cbr/\u003e・勤務地:大阪（異動有）","department_cost_center":null,"description_short":"Japan Operations PXT Excellence Teamでは、私達と一緒にお客様起点に考え、人事領域で更なるイノベーションを起こしていただけるHRアソシエートパートナーを募集しています。勤務地は大阪住之江（Delivery Station）になります。PXT Excellence Teamは、各拠点や部署の人事責任者（HRBP）と共に全国に多数の事業部や物流拠点を持つOperations部門に所属する従業員をカスタマーとして人事業務およびプロセス改善を遂行します。HRアソシエートパートナーはサポート業務ではなくHRBPや担当部署や拠点のパートナーとして、Amazonの文化を維持","display_distance":null,"id":"430e20cd-ffd6-4f17-b155-0d03650be692","id_icims":"3159255","is_intern":null,"is_manager":null,"job_category":"Human Resources","job_family":"Human Resources","job_function_id":null,"job_path":"/en/jobs/3159255/hr-associate-partner-pxt-excellence-row-pxt-japan","job_schedule_type":"full-time","location":"JP, 27, Osaka","locations":["{\"normalizedStateName\":\"Hyogo\",\"normalizedCountryCode\":\"JPN\",\"city\":\"Amagasaki\",\"countryIso3a\":\"JPN\",\"countryIso2a\":\"JP\",\"locationNonStemming\":\"Japan, 28, Amagasaki\",\"coordinates\":\"34.73377,135.40636\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Japan\",\"normalizedLocation\":\"Amagasaki-shi, Hyogo, JPN\",\"location\":\"JP, 28, Amagasaki\",\"region\":\"28\",\"buildingCodeList\":[\"KIX6\"],\"normalizedCityName\":\"Amagasaki-shi\"}","{\"normalizedStateName\":\"Hyogo\",\"normalizedCountryCode\":\"JPN\",\"city\":\"Kobe\",\"countryIso3a\":\"JPN\",\"countryIso2a\":\"JP\",\"locationNonStemming\":\"Japan, Kobe\",\"coordinates\":\"34.68943,135.19576\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Japan\",\"normalizedLocation\":\"Kobe-shi, Hyogo, JPN\",\"location\":\"JP, Kobe\",\"region\":\"\",\"buildingCodeList\":[\"DWJ1\"],\"normalizedCityName\":\"Kobe-shi\"}","{\"normalizedStateName\":\"Osaka\",\"normalizedCountryCode\":\"JPN\",\"city\":\"Osaka\",\"countryIso3a\":\"JPN\",\"countryIso2a\":\"JP\",\"locationNonStemming\":\"Japan, 27, Osaka\",\"coordinates\":\"34.68634,135.52002\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Japan\",\"normalizedLocation\":\"Osaka, JPN\",\"location\":\"JP, 27, Osaka\",\"region\":\"27\",\"buildingCodeList\":[\"KIX10\"]}","{\"normalizedStateName\":\"Osaka\",\"normalizedCountryCode\":\"JPN\",\"city\":\"Sakai\",\"countryIso3a\":\"JPN\",\"countryIso2a\":\"JP\",\"locationNonStemming\":\"Japan, 27, Sakai\",\"coordinates\":\"34.57329,135.48297\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Japan\",\"normalizedLocation\":\"Sakai-shi, Osaka, JPN\",\"location\":\"JP, 27, Sakai\",\"region\":\"27\",\"buildingCodeList\":[\"DOO1\"],\"normalizedCityName\":\"Sakai-shi\"}","{\"normalizedStateName\":\"Ibaraki\",\"normalizedCountryCode\":\"JPN\",\"city\":\"Ibaraki\",\"countryIso3a\":\"JPN\",\"countryIso2a\":\"JP\",\"locationNonStemming\":\"Japan, 27, Ibaraki\",\"coordinates\":\"36.34173,140.44679\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Japan\",\"normalizedLocation\":\"Ibaraki, JPN\",\"location\":\"JP, 27, Ibaraki\",\"region\":\"27\",\"buildingCodeList\":[\"KIX3\"]}"],"normalized_location":"Osaka, JPN","optional_search_labels":[],"posted_date":"January 14, 2026","preferred_qualifications":"- 円滑なコミュニケーション力と調整力\u003cbr/\u003e- データ処理に対する業務の確実性\u003cbr/\u003e- 外資系企業での就業経験や、スピードの速い職場環境での就労経験がある方は尚可。\u003cbr/\u003e- PeoplesoftまたはOracleの使用経験者歓迎\u003cbr/\u003e- ビジネスで英語使用経験（読み書き）を持っている方、または英語の読み書きに抵抗のない方は尚可。\u003cbr/\u003e- インクルーシブなカルチャーへの貢献や多様性に富んだグループで働くことに対して前向きであること。\u003cbr/\u003e- 【給与情報】 月額基本給　314,200　円以上（年俸を12分割支給） 時間外労働手当、深夜勤務手当、法定休日勤務手当分は労働時間に応じて支給される。能力、資格、経歴、経験等を考慮し、面接後に最終決定。\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"global-corporate.team-hr-for-hr","source_system":"JobCreator","state":"27","title":"HR Associate Partner, PXT Excellence, ROW PXT Japan","university_job":null,"updated_time":"17 minutes","url_next_step":"https://account.amazon.com/jobs/3159255/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-hr-for-hr","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Experience managing complex, multi-stakeholder sales cycles with C-level executives and technical decision-makers.\u003cbr/\u003e- +5 Years of experience working cross-functionally with solutions architects, professional services, product teams, and SAP partner organizations.\u003cbr/\u003e- Demonstrated understanding of SAP system architecture and application components.\u003cbr/\u003e- Familiarity with cloud architecture principles, including high availability, disaster recovery, and security best practices.\u003cbr/\u003e- Able to communicate effectively in English.","business_category":"aws","city":"Mexico City","company_name":"Amazon Web Services Mexico S. de R.L. de C.V.","country_code":"MEX","description":"Are you passionate about Enterprise Applications migrating to the cloud? AWS, a world leader in cloud computing solutions, is seeking a Sales Specialist in SAP to join our local team of experts focused on helping SAP customers migrating to cloud environments.\u003cbr/\u003eIn this role, you'll work alongside our sales and technical teams to help clients transform their businesses through cloud services. You'll collaborate with account executives to serve priority large enterprise accounts across various industries throughout Mexico, with approximately 30% travel required within the country. You'll maintain regular contact with SAP sales teams, ensuring you can effectively establish executive-level conversations about the business value of cloud migrations.\u003cbr/\u003eYour success will be measured through revenue generation, customer engagement, event participation, proposal development, and partner involvement. If you're ready to make an impact transforming SAP customers, we want to hear from you.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eLead technical and business discussions with customers to assess their current SAP landscape and develop comprehensive cloud migration strategies.\u003cbr/\u003eBuild and manage a robust pipeline of SAP migration opportunities from initial engagement through successful launch.\u003cbr/\u003eCollaborate with account teams to identify target accounts running SAP workloads and create tailored engagement plans.\u003cbr/\u003ePartner with Professional Services, Solutions Architects, and partner ecosystem to design and deliver comprehensive SAP migration solutions\u003cbr/\u003eCollaborate on joint customer engagements, ensuring successful outcomes and customer satisfaction\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eAWS Global Sales (AGS) is the worldwide sales organization responsible for selling AWS cloud services and solutions to customers globally. Sales Specialist team is a high-impact, customer-obsessed organization dedicated to accelerating enterprise adoption of AWS solutions. Our specialists serve as trusted advisors who bridge the gap between technical challenges and real-world business outcomes.\u003cbr/\u003eOur team operates in a matrixed environment, working closely with field account teams, solution architects, professional services, partner organizations, and SAP sales teams. \u003cbr/\u003e\u003cbr/\u003eWhy AWS\u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003eWork/Life Balance\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve.\u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture\u003cbr/\u003eHere at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. Ongoing events and learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon (gender diversity) conferences, inspire us to never stop embracing our uniqueness.\u003cbr/\u003e\u003cbr/\u003eMentorship and Career Growth\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional.","department_cost_center":null,"description_short":"Are you passionate about Enterprise Applications migrating to the cloud? AWS, a world leader in cloud computing solutions, is seeking a Sales Specialist in SAP to join our local team of experts focused","display_distance":null,"id":"a2260650-ff88-48a1-88ff-849717b35f7f","id_icims":"3148779","is_intern":null,"is_manager":null,"job_category":"Sales, Advertising, \u0026 Account Management","job_family":"Tech Sales","job_function_id":null,"job_path":"/en/jobs/3148779/sales-specialist-sap-mexico-sales-specialists","job_schedule_type":"full-time","location":"MX, DIF, Mexico City","locations":["{\"normalizedStateName\":\"Mexico City\",\"normalizedCountryCode\":\"MEX\",\"city\":\"Mexico City\",\"countryIso3a\":\"MEX\",\"countryIso2a\":\"MX\",\"locationNonStemming\":\"Mexico, DIF, Mexico City\",\"coordinates\":\"19.43195,-99.13315\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Mexico\",\"normalizedLocation\":\"Mexico City, Mexico City, MEX\",\"location\":\"MX, DIF, Mexico City\",\"region\":\"DIF\",\"buildingCodeList\":[\"MEX16\"],\"normalizedCityName\":\"Mexico City\"}"],"normalized_location":"Mexico City, Mexico City, MEX","optional_search_labels":[],"posted_date":"December 23, 2025","preferred_qualifications":"- Experience with complex, multi-system SAP landscapes including distributed architectures across multiple regions.\u003cbr/\u003e- Understanding of large-scale SAP cloud migration strategies.\u003cbr/\u003e- Experience driving co-sell opportunities and managing partner-led implementations.\u003cbr/\u003e- Established relationships with SAP system integrators (e.g., Accenture, Deloitte, IBM, Capgemini)\u003cbr/\u003e- Experience building detailed business cases including TCO analysis, ROI modeling, and financial justification for cloud migrations.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"aws.team-sales-primary","source_system":"JobCreator","state":"DIF","title":"Sales Specialist SAP, Mexico Sales Specialists","university_job":null,"updated_time":"22 minutes","url_next_step":"https://account.amazon.com/jobs/3148779/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-sales-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 5+ years of program or project management experience\u003cbr/\u003e- Experience using data and metrics to determine and drive improvements\u003cbr/\u003e- Experience owning program strategy, end to end delivery, and communicating results to senior leadership\u003cbr/\u003e- Bachelor's degree","business_category":"fulfillment-and-operations","city":"Sydney","company_name":"Amazon Commercial Services Pty Ltd","country_code":"AUS","description":"At Amazon, we're working to be the most customer-centric company, to be best employer, and be safest place to work on earth. To get there, we need exceptionally talented, bright, and driven people. If you'd like to help us build that place, this is your chance to make history.\u003cbr/\u003e\u003cbr/\u003eOne focus area of the Amazon Workplace Health \u0026 Safety Australia (AU WHS) is to provide tools, resources, and environments that support safe, efficient, and healthy behaviors and encourage employees to proactively manage their health and wellbeing. To support this focus area, Amazon is seeking an experienced and innovative person to serve as our Program Manager for AU WHS to build and execute programs that create a safe workplace and build a world-class safety culture in the midst of Amazon’s growth. In this role, you will dive deep into Operations processes; identify risks through data and first-hand experience; build and execute programs, and improve processes to eliminate risks; and influence Operations to sustain a culture of safety. This role will focus on coordinating and leading large, strategic projects / programs within Amazon Business Units (BUs) and will be strongly focused on injury and accident prevention as well as improvements across health, safety and wellness. \u003cbr/\u003e\u003cbr/\u003eThe WHS Program Manager role will challenge you to push boundaries and lead transformative innovation while having the autonomy to make rapid data-driven decisions and invent on behalf of Operators (operation leaders) and Associates. In this role, you will work cross-functionally with members from various teams, including Operations; Human Resources, WHS, Reliability, Engineering and Maintenance, Finance and OpEx to deploy solutions at scale. This role calls for an individual who is technically smart to gain credibility with customers and stakeholders at various levels of the organization.\u003cbr/\u003e\u003cbr/\u003eThe role will report into the Senior WHS Manager, AU Customer Fulfillment, and work collaboratively with other partners across all Amazon BUs and regional geographies to provide innovative solutions across our business. This role is based in the Sydney corporate office or field location. \u003cbr/\u003e   \u003cbr/\u003eThe ideal candidate has an obsession for customers and a strong interest in building innovative solutions; must have proven analytical capabilities (including ability to deep dive, identify root causes and permanently eliminate hazards and risks); and can thrive in a fast-paced environment with exceptional communication and project management skills. The ideal candidate must have excellent judgment, compassion, and interpersonal skills with the ability to work collaboratively with colleagues in many areas across the company.  \u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Develop, review, approve, coordinate, and lead large, strategic projects / programs within Amazon Business Units (BUs) and across different geographies.\u003cbr/\u003e- Build relationships and partner across many organizations to build and execute on new initiatives and roadmaps each year.\u003cbr/\u003e- Work and collaborate with stakeholders and partners to align on project /program goals and resources.\u003cbr/\u003e- Coordinate a portfolio of programs / projects from inception to delivery. These may also be global in nature.\u003cbr/\u003e- Define and implement metrics to measure and communicate Australian program achievements.\u003cbr/\u003e- Compile, manage and report on weekly project metrics and be responsible for leading many high profile meetings to align on project requirements. \u003cbr/\u003e- Communicate the overall program roadmap and provide periodic status updates to the stakeholders, and presenting programs / projects to senior leadership on a regular basis.\u003cbr/\u003e- Provide programs decision support, insights and recommendations through data gathering and information analyzing.","department_cost_center":null,"description_short":"At Amazon, we're working to be the most customer-centric company, to be best employer, and be safest place to work on earth. To get there, we need exceptionally talented, bright, and driven people. If","display_distance":null,"id":"98b1425e-6da2-476f-8cfb-37056a7216c6","id_icims":"3183411","is_intern":null,"is_manager":null,"job_category":"Project/Program/Product Management--Non-Tech","job_family":"Program Management","job_function_id":null,"job_path":"/en/jobs/3183411/whs-program-manager-whs-program-manager","job_schedule_type":"full-time","location":"AU, NSW, Sydney","locations":["{\"normalizedStateName\":\"New South Wales\",\"normalizedCountryCode\":\"AUS\",\"city\":\"Sydney\",\"countryIso3a\":\"AUS\",\"countryIso2a\":\"AU\",\"locationNonStemming\":\"Australia, NSW, Sydney\",\"coordinates\":\"-33.87073,151.20788\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Australia\",\"normalizedLocation\":\"Sydney, New South Wales, AUS\",\"location\":\"AU, NSW, Sydney\",\"region\":\"NSW\",\"buildingCodeList\":[\"SYD15\"],\"normalizedCityName\":\"Sydney\"}","{\"normalizedStateName\":\"Victoria\",\"normalizedCountryCode\":\"AUS\",\"city\":\"Melbourne\",\"countryIso3a\":\"AUS\",\"countryIso2a\":\"AU\",\"locationNonStemming\":\"Australia, VIC, Melbourne\",\"coordinates\":\"-37.81736,144.96755\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Australia\",\"normalizedLocation\":\"Melbourne, Victoria, AUS\",\"location\":\"AU, VIC, Melbourne\",\"region\":\"VIC\",\"buildingCodeList\":[\"MEL12\"],\"normalizedCityName\":\"Melbourne\"}"],"normalized_location":"Sydney, New South Wales, AUS","optional_search_labels":["stores.lander-australia","international-stores.australia-whs"],"posted_date":"February 18, 2026","preferred_qualifications":"- 2+ years of driving process improvements experience\u003cbr/\u003e- Master's degree, or MBA in business, operations, human resources, adult education, organizational development, instructional design or related field\u003cbr/\u003e\u003cbr/\u003eAcknowledgement of country:\u003cbr/\u003eIn the spirit of reconciliation Amazon acknowledges the Traditional Custodians of country throughout Australia and their connections to land, sea and community. We pay our respect to their elders past and present and extend that respect to all Aboriginal and Torres Strait Islander peoples today.\u003cbr/\u003e\u003cbr/\u003eIDE statement:\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"fulfillment-and-operations.team-global-ehs","source_system":"JobCreator","state":"NSW","title":"WHS Program Manager, WHS Program Manager ","university_job":null,"updated_time":"23 minutes","url_next_step":"https://account.amazon.com/jobs/3183411/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-global-ehs","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 3+ years of enterprise software/solutions sales experience.\u003cbr/\u003e- Bachelor's degree in Business, Computer Science, or related field.\u003cbr/\u003e- Solid understanding of AI, ML, and generative AI technologies.\u003cbr/\u003e- Experience with AI agent platforms and autonomous systems.\u003cbr/\u003e- Able to communicate effectively in English, within technical and business settings.","business_category":"aws","city":"Mexico City","company_name":"Amazon Web Services Mexico S. de R.L. de C.V.","country_code":"MEX","description":"Are you passionate about AI and Data Solutions with expertise in Generative AI? \u003cbr/\u003eAt AWS we are seeking a Sales Specialist in AI-Data to join our local team of experts focused on GenAI and Agentic systems.\u003cbr/\u003e\u003cbr/\u003eIn this role, you'll work alongside our sales and technical teams to help clients transform their businesses through innovative agentic solutions. You'll collaborate with account executives to serve priority large enterprise accounts across various industries throughout Mexico, with approximately 30% travel required within the country. You'll maintain regular contact with product managers to stay current on GenAI technology and agentic systems, ensuring you can effectively establish executive-level conversations about the business value these solutions provide.\u003cbr/\u003e\u003cbr/\u003eYour success will be measured through revenue generation, customer engagement, event participation, proposal development, partner involvement, and GenAI ISV solution identification. If you're ready to make an impact at the forefront of AI technology while helping organizations leverage the power of cloud computing, we want to hear from you.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Engage with customers to understand their business challenges and identify opportunities where GenAI solutions can drive value.\u003cbr/\u003e- Build and maintain trusted advisor relationships with key stakeholders, including technical leaders and business decision-maker.\u003cbr/\u003e- Articulate the value proposition of GenAI solutions and demonstrate how they address specific customer use cases.\u003cbr/\u003e- Thought leadership through content creation, speaking engagements, and customer enablement.\u003cbr/\u003e- Achieve quarterly and annual goals for engagement activities and revenue attainment.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eAWS Global Sales (AGS) is the worldwide sales organization responsible for selling AWS cloud services and solutions to customers globally. Sales Specialist team is a high-impact, customer-obsessed organization dedicated to accelerating enterprise adoption of AWS solutions. Our specialists serve as trusted advisors who bridge the gap between cutting-edge AI technology and real-world business outcomes.\u003cbr/\u003eOur team operates in a matrixed environment, working closely with field account teams, solution architects, professional services, and partner organizations. \u003cbr/\u003e\u003cbr/\u003eDiverse Experiences:\u003cbr/\u003eAWS values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job below, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.\u003cbr/\u003e\u003cbr/\u003eWhy AWS?\u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture:\u003cbr/\u003eHere at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. Ongoing events and learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon (gender diversity) conferences, inspire us to never stop embracing our uniqueness.\u003cbr/\u003e\u003cbr/\u003eMentorship \u0026 Career Growth:\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional.\u003cbr/\u003e\u003cbr/\u003eWork/Life Balance:\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud. ","department_cost_center":null,"description_short":"Are you passionate about AI and Data Solutions with expertise in Generative AI? At AWS we are seeking a Sales Specialist in AI-Data to join our local team of experts focused on GenAI and Agentic systems.In","display_distance":null,"id":"d220a694-b124-4a21-81bb-7c379f539f9d","id_icims":"3148782","is_intern":null,"is_manager":null,"job_category":"Sales, Advertising, \u0026 Account Management","job_family":"Tech Sales","job_function_id":null,"job_path":"/en/jobs/3148782/sales-specialist-genai-data-mexico-sales-specialists","job_schedule_type":"full-time","location":"MX, DIF, Mexico City","locations":["{\"normalizedStateName\":\"Mexico City\",\"normalizedCountryCode\":\"MEX\",\"city\":\"Mexico City\",\"countryIso3a\":\"MEX\",\"countryIso2a\":\"MX\",\"locationNonStemming\":\"Mexico, DIF, Mexico City\",\"coordinates\":\"19.43195,-99.13315\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Mexico\",\"normalizedLocation\":\"Mexico City, Mexico City, MEX\",\"location\":\"MX, DIF, Mexico City\",\"region\":\"DIF\",\"buildingCodeList\":[\"MEX16\"],\"normalizedCityName\":\"Mexico City\"}"],"normalized_location":"Mexico City, Mexico City, MEX","optional_search_labels":[],"posted_date":"December 23, 2025","preferred_qualifications":"- Experience with major AI/ML platforms (OpenAI, Google AI, Azure AI, etc.).\u003cbr/\u003e- Understanding of data architectures, LLMs, autonomous agents, and AI orchestration.\u003cbr/\u003e- Previous experience selling AI/ML solutions\u003cbr/\u003e- MBA or technical advanced degree.\u003cbr/\u003e- Experience in consultative solution selling.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"aws.team-sales-primary","source_system":"JobCreator","state":"DIF","title":"Sales Specialist GenAI-Data, Mexico Sales Specialists","university_job":null,"updated_time":"23 minutes","url_next_step":"https://account.amazon.com/jobs/3148782/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-sales-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 10+ years of professional experience, with a minimum of 5 years as technical contributor in the security field (internal corporate security, security operations, security consulting, incident response, etc.)\u003cbr/\u003e- Hands-on security experience in two or more of the following: Cloud Security, Application Security (security SDLC, threat modeling, code review), Identity \u0026 Access Management, Network Security, Data Protection, Incident Response. Hands-on experience with enterprise security solutions (Data Loss Prevention, WAF, SIEM, etc.)\u003cbr/\u003e- Track record of leading complex security projects\u003cbr/\u003e- Experience contributing to the professional development of technical contributors (direct management, mentoring, coaching, etc)\u003cbr/\u003e- Able to communicate effectively in English within technical and business settings.","business_category":"aws","city":"Sao Paulo","company_name":"Amazon AWS Services Brazil Ltd - E07","country_code":"BRA","description":"The Amazon Web Services Professional Services (ProServe) team is looking for an experienced ProServe Area Delivery Leader (PADL) to join our Shared Delivery Team (SDT). This senior leadership role is responsible for all delivery activities within the Area (single/multi-country or Practice/Industry), ensuring optimal support while maximizing team utilization and revenue performance. You'll report to the Geo Delivery Leader serving as a strategic advisor to customers, partners, and internal AWS teams. \u003cbr/\u003e\u003cbr/\u003eAs PADLs you will coach, manage, and guide Delivery Practice Managers (DPMs) and their teams, to ensure they are providing best in class solutions for customers and partners. Routinely engaging with C-level executives within our customers, you will be responsible for ensuring Area SDTs work closely with partner teams; drive business development initiatives through thought leadership; provide portfolio guidance and oversight; and meet and exceed customer satisfaction targets. PADLs primarily drive their teams to partner with ProServe Account Executives to identify, understand, and define business outcomes for customers by building trust, identifying applicable AWS Professional Services offerings, and successfully executing SOWs.\u003cbr/\u003e\u003cbr/\u003eYour experience gained leading teams within the technology sector, will equip you with the ability to optimize team growth and performance through implementing tailored people development plans, ensuring Area SDTs are aligned to customer needs, and have the skills and capacity to address customer outcomes. Possessing the ability to translate technical concepts into business value for customers and then talk in technical depth with teams, you will cultivate strong customer, Amazon Global Sales (AGS), and ProServe team relationships which enables exceptional business performance.  PADLs success is primarily measured through the Area P\u0026L by delivering customer engagements on time, within budget, and exceeding customer expectations (CSAT). \u003cbr/\u003e\u003cbr/\u003eThe AWS Professional Services organization is a global team of experts that help customers realize their desired business outcomes when using the AWS Cloud. We work together with customer teams and the AWS Partner Network (APN) to execute enterprise cloud computing initiatives. Our team provides assistance through a collection of offerings which help customers achieve specific outcomes related to enterprise cloud adoption. We also deliver focused guidance through our global specialty practices, which cover a variety of solutions, technologies, and industries. 10042\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eAs an experienced Professional Services Delivery Leader, you will be responsible for: \u003cbr/\u003e• Leading and managing the Area Shared Delivery Team, overseeing Delivery Practice Managers (DPMs) and their teams\u003cbr/\u003e• Ensuring delivery of best-in-class solutions for customers and partners, meeting and exceeding satisfaction targets\u003cbr/\u003e• Driving business development initiatives and provide portfolio guidance and oversight\u003cbr/\u003e• Collaborating with ProServe Account Executives to identify and define customer business outcomes\u003cbr/\u003e• Managing the Area P\u0026L, optimizing team growth, performance, and utilization\u003cbr/\u003e• Serving as an escalation point for Sales and Delivery teams, engaging in pre-sales, in-flight projects, and post-implementation reviews\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eDiverse Experiences \u003cbr/\u003eAmazon values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying. \u003cbr/\u003e \u003cbr/\u003eWhy AWS \u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003eWork/Life Balance \u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud. \u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture \u003cbr/\u003eAWS values curiosity and connection. Our employee-led and company-sponsored affinity groups promote inclusion and empower our people to take pride in what makes us unique. Our inclusion events foster stronger, more collaborative teams. Our continual innovation is fueled by the bold ideas, fresh perspectives, and passionate voices our teams bring to everything we do.\u003cbr/\u003e\u003cbr/\u003eMentorship and Career Growth\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional. ","department_cost_center":null,"description_short":"The Amazon Web Services Professional Services (ProServe) team is looking for an experienced ProServe Area Delivery Leader (PADL) to join our Shared Delivery Team (SDT). This senior leadership role is responsible","display_distance":null,"id":"c5fb9dab-5a1b-4db9-9b13-aa7157a187fb","id_icims":"3094878","is_intern":null,"is_manager":null,"job_category":"Solutions Architect","job_family":"Professional Services","job_function_id":null,"job_path":"/en/jobs/3094878/proserve-area-delivery-leader-security-latam","job_schedule_type":"full-time","location":"BR, SP, Sao Paulo","locations":["{\"normalizedStateName\":\"Sao Paulo\",\"normalizedCountryCode\":\"BRA\",\"city\":\"Sao Paulo\",\"countryIso3a\":\"BRA\",\"countryIso2a\":\"BR\",\"locationNonStemming\":\"Brazil, SP, Sao Paulo\",\"coordinates\":\"-23.56283,-46.65474\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Brazil\",\"normalizedLocation\":\"Sao Paulo, Sao Paulo, BRA\",\"location\":\"BR, SP, Sao Paulo\",\"region\":\"SP\",\"buildingCodeList\":[\"GRU10\"],\"normalizedCityName\":\"Sao Paulo\"}"],"normalized_location":"Sao Paulo, Sao Paulo, BRA","optional_search_labels":["aws-team-global-services-optional"],"posted_date":"September 26, 2025","preferred_qualifications":"- Relevant security certifications (AWS Security Specialty, CISSP, CCSP, etc.)\u003cbr/\u003e- Experience leading cloud transformation projects\u003cbr/\u003e- Ability to navigate complex stakeholder relationships and drive change\u003cbr/\u003e- Strategic thinking and decision-making capabilities in ambiguous environments\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"aws.team-pro-serv","source_system":"JobCreator","state":"SP","title":"ProServe Area Delivery Leader - Security , LATAM","university_job":null,"updated_time":"24 minutes","url_next_step":"https://account.amazon.com/jobs/3094878/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-pro-serv","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}}],"job_posting_search_request":"{\"jobPostingSearchRequest\":{\"query\":\"\",\"excludeFacets\":[{\"name\":\"businessCategory\",\"values\":[{\"name\":\"a-confidential-job\"}]},{\"name\":\"isPostedExternally\",\"values\":[{\"name\":\"0\"}]},{\"name\":\"isUnsearchable\",\"values\":[{\"name\":\"1\"}]}],\"filterFacets\":[],\"start\":0,\"size\":10,\"sort\":{\"sortOrder\":\"DESCENDING\",\"sortType\":\"SCORE\"},\"location\":null,\"accessLevel\":\"EXTERNAL\",\"includeFacets\":[],\"locationFacets\":[],\"jobTypeFacets\":[],\"contentFilterFacets\":[],\"treatment\":\"OM\"}}"}