{"error":null,"hits":10000,"facets":{},"content":{"sidebar":{},"search_results":{}},"jobs":[{"basic_qualifications":"- Knowledge of Flight Safety, Workplace Health and Safety (WHS), and Flight Operations regulations and procedures\u003cbr/\u003e- Work a flexible schedule/shift/work area, including weekends, nights, and/or holidays\u003cbr/\u003e- Can carry/lift up to 50 lbs, stand/walk during shifts lasting up to 12 hours, and frequently push, pull, squat, bend and reach\u003cbr/\u003e- Travel up to 25% of the time\u003cbr/\u003e- Experience with Federal Aviation Administration (FAA) regulations or similar technical platforms\u003cbr/\u003e- Ability to get FAA Part 107 Drone Pilot Certification in the first 90 days\u003cbr/\u003e- 2+ years in a safety-critical role.","business_category":"retail","city":"North Randall","company_name":"Amazon.com Services LLC - A57","country_code":"USA","description":"Here at Amazon, we embrace our differences. We are committed to furthering our culture of diversity and inclusion of our teams within the organization.\u003cbr/\u003eHow do you get items to customers quickly, cost-effectively, and—most importantly—safely, in less than an hour? And how do you do it in a way that can scale? Our teams of hundreds of scientists, engineers, aerospace professionals, and futurists have been working hard to do just that! We are delivering to customers, and are excited for what’s to come. Check out more information about Prime Air on the About Amazon blog\u003cbr/\u003e(https://www.aboutamazon.com/news/transportation/amazon-prime-air-delivery-drone-reveal-photos).\u003cbr/\u003eIf you are seeking an iterative environment where you can drive innovation, apply state-of-the-art technologies to solve real world delivery challenges, and provide benefits to customers, Prime Air is the place for you.\u003cbr/\u003eCome work on the Amazon Prime Air Team!\u003cbr/\u003e\u003cbr/\u003ePrime Air is seeking a highly motivated and safety-conscious Flight Safety and Compliance Officer (SCO) to join our dynamic team. As the local safety and flight operations expert, you will play a vital role in ensuring the safe and compliant operation of our drone delivery fleet.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e-  Audit flight monitors, ground crew, and operations to ensure adherence to safety standards and procedures.\u003cbr/\u003e-  Monitor all aspects of safety at Prime Air delivery sites, including risk assessment and incident investigation.\u003cbr/\u003e- Assist in creating and maintaining accurate records for assigned flight crew as authorized.\u003cbr/\u003e- Serve as the primary point of contact for WHS regulatory partners during inspections and visits.\u003cbr/\u003e- Analyze operations data and safety metrics to identify trends and potential risks, and report findings to senior leadership.\u003cbr/\u003e- Conduct routine audits of operations, Workplace Health and Safety (WHS) site safety, and compliance, and ensure corrective actions are implemented.\u003cbr/\u003e- Stay informed on and comply with all applicable Flight Safety, WHS, and Flight Operations regulations and procedures.\u003cbr/\u003e- Work collaboratively with all levels of the organization to promote a strong safety culture.\u003cbr/\u003e- Maintain a high level of accuracy and attention to detail in all aspects of work.\u003cbr/\u003e\u003cbr/\u003eExport Control License: This position may require a deemed export control license for compliance with applicable laws and regulations. Placement is contingent on Amazon’s ability to apply for and obtain an export control license on your behalf.","department_cost_center":null,"description_short":"Here at Amazon, we embrace our differences. We are committed to furthering our culture of diversity and inclusion of our teams within the organization.How do you get items to customers quickly, cost-effectively,","display_distance":null,"id":"1660d93a-e4b9-47e5-a813-a8bb46f977f5","id_icims":"3163917","is_intern":null,"is_manager":null,"job_category":"Medical, Health, \u0026 Safety","job_family":"Drone Operations","job_function_id":null,"job_path":"/en/jobs/3163917/safety-and-compliance-officer-prime-air","job_schedule_type":"full-time","location":"US, OH, North Randall","locations":["{\"normalizedStateName\":\"Ohio\",\"normalizedCountryCode\":\"USA\",\"city\":\"North Randall\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, OH, North Randall\",\"coordinates\":\"41.42734,-81.52566\",\"normalizedCountyName\":\"Cuyahoga\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"North Randall, Ohio, USA\",\"location\":\"US, OH, North Randall\",\"region\":\"OH\",\"buildingCodeList\":[\"OHA1\"],\"normalizedCityName\":\"North Randall\"}"],"normalized_location":"North Randall, Ohio, USA","optional_search_labels":[],"posted_date":"January 21, 2026","preferred_qualifications":"- Experience that includes strong analytical skills, attention to detail, and effective communication abilities, or experience working with customers with a passion for delivering exceptional service\u003cbr/\u003e- Experience working independently with minimal supervision, or 2+ years of Amazon experience\u003cbr/\u003e- Experience working with computers and Microsoft Office (including Outlook, Word, and Excel)\u003cbr/\u003e- Bachelor's degree in safety, environmental, or equivalent\u003cbr/\u003e- Experience working with customers with a passion for delivering exceptional service, or experience that includes strong analytical skills, attention to detail, and effective communication abilities\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, OH, NORTH RANDALL - 33.00 - 58.00 USD hourly","primary_search_label":"retail.team-global-prime-air","source_system":"JobCreator","state":"OH","title":"Safety and Compliance Officer, Prime Air","university_job":null,"updated_time":"13 minutes","url_next_step":"https://account.amazon.com/jobs/3163917/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-global-prime-air","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- High school or equivalent diploma\u003cbr/\u003e- 2+ years of professional experience\u003cbr/\u003e- 2+ years of troubleshooting in a multi-user high availability environment experience\u003cbr/\u003e- 2+ years of networking (such as DNS, DHCP, SSL, OSI Model, and TCP/IP) experience\u003cbr/\u003e- 2+ years of PC repair, troubleshooting, deployment and liquidation experience\u003cbr/\u003e- 1+ years of IT client, server, and network service delivery experience\u003cbr/\u003e- Fluent in Cisco/networking and either Linux and/or Microsoft","business_category":"operations","city":"Fall River","company_name":"Amazon.com Services LLC","country_code":"USA","description":"Operations is at the heart of Amazon’s business. We are known for our speed, accuracy, and exceptional service. Our buildings deliver tens of thousands of products to hundreds of countries worldwide, every day. Operations Technology Solutions provides nonstop global IT support to Amazon Operations as a vital piece to the puzzle. We are looking for self-motivated individuals to take on new challenges and motivate teams in fostering solutions to the hurdles we face. Together, we take ownership for what we do — whether supporting IT infrastructure, developing new technology inhouse, launching a new Amazon Operations facility, or delighting our customers by delivering packages directly to them.\u003cbr/\u003e\u003cbr/\u003eAbout The Role\u003cbr/\u003e\u003cbr/\u003eAs an IT Support Engineer I, you will use your knowledge and specialized skills to implement technical solutions and provide high quality support for computer hardware, operating systems, or enterprise application software across sites in a defined geographical area. You are able to determine when it is appropriate to deviate from a standard practice to accomplish the desired result. You can troubleshoot and solve straightforward problems that do not have defined SOPs.\u003cbr/\u003e\u003cbr/\u003eWhat Do We Offer?\u003cbr/\u003e\u003cbr/\u003eAmazon offers competitive compensation packages including comprehensive healthcare benefits starting on Day 1, matching 401(k) program, and up to 20 weeks of paid parental leave. But wait there’s more: we are a casual dress code at each of our locations (jeans, t-shirts, safety shoes and at times a neon safety vest will be your daily outfit).\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eJob Duties include, but are not limited to:\u003cbr/\u003e\u003cbr/\u003e- Network engineering and troubleshooting, data cabling and systems administration in a variety of software and hardware environments.\u003cbr/\u003e- Ensuring infrastructure networking and computing systems remain available during production hours.\u003cbr/\u003e- Interacting with management and staff to provide analytical and technical assistance for continuous improvement of IT solutions.\u003cbr/\u003e- Managing local technical projects.\u003cbr/\u003e- Maintaining or creating policies, procedures, and processes.\u003cbr/\u003e- Identifying root-causes of operational issues and process inefficiencies.\u003cbr/\u003e- Moving up to 49lbs as well as standing and walking during shifts lasting up to 12 hours.\u003cbr/\u003e- Supporting customers from multiple buildings in the area, as well as remote customers.\u003cbr/\u003e- Traveling within your local or regional area to support our customers.","department_cost_center":null,"description_short":"Operations is at the heart of Amazon’s business. We are known for our speed, accuracy, and exceptional service. Our buildings deliver tens of thousands of products to hundreds of countries worldwide, every","display_distance":null,"id":"27bdc762-be97-4153-b504-6499fee22aec","id_icims":"3175948","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Technical Services","job_function_id":null,"job_path":"/en/jobs/3175948/it-support-engineer-i-ots","job_schedule_type":"full-time","location":"US, MA, Fall River","locations":["{\"normalizedStateName\":\"Massachusetts\",\"normalizedCountryCode\":\"USA\",\"city\":\"Fall River\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, MA, Fall River\",\"coordinates\":\"41.69735,-71.14365\",\"normalizedCountyName\":\"Bristol\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Fall River, Massachusetts, USA\",\"location\":\"US, MA, Fall River\",\"region\":\"MA\",\"buildingCodeList\":[\"BOS7\"],\"normalizedCityName\":\"Fall River\"}"],"normalized_location":"Fall River, Massachusetts, USA","optional_search_labels":[],"posted_date":"February  6, 2026","preferred_qualifications":"- Bachelor's degree in Computer Science, Information Technology, or a related field\u003cbr/\u003e- CompTIA A+, CompTIA Network+, Cisco/CCNA, Linux (Redhat), Microsoft hardware (installation), AWS, or other industry relevant certifications\u003cbr/\u003e- Experience in data center\u003cbr/\u003e- Experience communicating technical concepts and processes using clear, simple language and visuals\u003cbr/\u003e- Experience managing multiple projects, prioritizing, planning, and managing time\u003cbr/\u003e- Experience in oral and written communication in English\u003cbr/\u003e- Proven ability to work successfully with limited supervision\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, MA, Fall River - 25.00 - 41.00 USD hourly","primary_search_label":"operations.team-ops-tech-engineering-it","source_system":"JobCreator","state":"MA","title":"IT Support Engineer I, OTS","university_job":null,"updated_time":"14 minutes","url_next_step":"https://account.amazon.com/jobs/3175948/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-ops-tech-engineering-it","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Experience leading the design, automation, deployment, and support of large-scale infrastructure\u003cbr/\u003e- 5+ years of programming with at least one modern language such as C++, C#, Java, Python, Golang, PowerShell, Ruby experience\u003cbr/\u003e- 5+ years experience with Linux/Unix\u003cbr/\u003e- 5+ years experience with CI/CD pipelines build processes","business_category":"alexa-and-amazon-devices","city":"Bellevue","company_name":"Amazon Kuiper Manufacturing Enterprises LLC","country_code":"USA","description":"Amazon Leo Productivity Infrastructure \u0026 Engineering (ALPINE) is seeking a motivated and autonomous builder to focus on Infrastructure for our SAP ERP \u0026 MES systems. This is a hands-on position where your daily activities will range from strategic planning to new system development to supporting the customers that depend on our services. Deliver consistent, well-defined results in an agile systems development workflow. To succeed in this role, you will deliver reliable, highly available, scalable, controlled working environments built on AWS.\u003cbr/\u003e\u003cbr/\u003eExport Control Requirements: Due to the need to access certain federal controlled information, you must be a U.S. citizen for consideration.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e• Provision and manage AWS infrastructure, including EC2, CloudFormation Templates, AppStream, and Load Balancers.\u003cbr/\u003e• Design and manage best in class cloud, on premise and hybrid service environments.\u003cbr/\u003e• Build dashboarding and alarming to drive operational excellence.\u003cbr/\u003e• Work with a wide range of technologies, and AWS products.\u003cbr/\u003e• Build enterprise-grade AWS application environments using Infrastructure as Code (IaC)\u003cbr/\u003e• Architect and setup infrastructure on AWS GovCloud.\u003cbr/\u003e• Analyze and support setup of new device connectivity to enterprise applications and services.\u003cbr/\u003e• Monitor network connectivity between all internal and external systems.\u003cbr/\u003e• Partner with application owners to understand needs and plan for infrastructure demands.\u003cbr/\u003e• Drive automation of routine tasks to help scale the operations.\u003cbr/\u003e• Maintain hardware architecture documentation for all infrastructure and networking components.\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eIn this role, you will function as a DevOps Engineer. You will work with stakeholders and senior engineers to design and develop Infrastructure solutions and integrations in a secure manner. You will directly guide the technical direction of the team.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eHere at Amazon, we embrace our differences. We are committed to furthering our culture of inclusion. Amazon has ten employee-led affinity groups, reaching 40,000 employees in over 190 chapters globally. We have innovative benefit offerings, and host annual and ongoing learning experiences. Amazon’s culture of inclusion is reinforced within our 16 Leadership Principles, which remind team members to seek diverse perspectives, learn and be curious, and earn trust.\u003cbr/\u003e\u003cbr/\u003eAt Amazon, our mission is to be the most customer-centric company on Earth. To get there, we need exceptionally talented, bright and driven people. We're dedicated to supporting new team members. Our team has a broad mix of experience levels and Amazon tenures, and we’re building an environment that celebrates knowledge sharing and mentorship.","department_cost_center":null,"description_short":"Amazon Leo Productivity Infrastructure \u0026 Engineering (ALPINE) is seeking a motivated and autonomous builder to focus on Infrastructure for our SAP ERP \u0026 MES systems. This is a hands-on position where your","display_distance":null,"id":"b715f169-c631-4443-9f1a-994686cfe1ff","id_icims":"3178299","is_intern":null,"is_manager":null,"job_category":"Systems, Quality, \u0026 Security Engineering","job_family":"System Development Engineering","job_function_id":null,"job_path":"/en/jobs/3178299/sr-systems-dev-engineer-amazon-leo-formerly-project-kuiper","job_schedule_type":"full-time","location":"US, WA, Bellevue","locations":["{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Bellevue\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Bellevue\",\"coordinates\":\"47.61001,-122.1872\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Bellevue, Washington, USA\",\"location\":\"US, WA, Bellevue\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA107\"],\"normalizedCityName\":\"Bellevue\"}"],"normalized_location":"Bellevue, Washington, USA","optional_search_labels":[],"posted_date":"February 10, 2026","preferred_qualifications":"- Experience with distributed systems at scale\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, WA, Bellevue - 151,200.00 - 204,600.00 USD annually","primary_search_label":"alexa-and-amazon-devices.team-project-kuiper","source_system":"JobCreator","state":"WA","title":"Sr. Systems Dev Engineer, Amazon Leo (formerly Project Kuiper)","university_job":null,"updated_time":"16 minutes","url_next_step":"https://account.amazon.com/jobs/3178299/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-project-kuiper","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- High school or equivalent diploma\u003cbr/\u003e- 1+ years of Microsoft Office products and applications experience\u003cbr/\u003e- Work flexible schedule including weekends, nights, and holidays\u003cbr/\u003e- certification from Amazon's Mechatronics and Robotics Apprenticeship Program, or 2+ years of automated conveyor systems and controls experience\u003cbr/\u003e- 2+ years of conducting predictive and preventative maintenance procedures experience\u003cbr/\u003e- 2+ years of reading blueprints and electrical schematics experience\u003cbr/\u003e- 2+ years of demonstrating safety standards experience\u003cbr/\u003e- 2+ years of troubleshooting and diagnostics of material handling equipment (MHE) experience","business_category":"operations","city":"Phoenix","company_name":"Amazon.com Services LLC - A57","country_code":"USA","description":"About Maintenance at Amazon\u003cbr/\u003e\u003cbr/\u003eOperations is at the heart of Amazon’s business. We are known for our speed, accuracy, and exceptional service. Our buildings deliver tens of thousands of products to hundreds of countries worldwide, every day. Reliability Maintenance \u0026 Engineering (RME) are the business partners that work tirelessly behind the scenes to make it all happen. We drive continuous improvement and maintain all of the Robotics and Material Handling Equipment (MHE) to ensure our customers are met with the Amazon smile. Come join us on our journey!\u003cbr/\u003e\u003cbr/\u003eAbout the Role\u003cbr/\u003e\u003cbr/\u003eAs a Mechatronics \u0026 Robotics Technician, you will use your skills to support the Operations Maintenance team in repairing and maintaining material handling equipment and pneumatic systems throughout the building. You will have the opportunity to install, maintain, and repair automated packaging and distribution equipment. In addition to developing your skills, you will mentor junior technicians to grow in their roles.\u003cbr/\u003e\u003cbr/\u003eWhat Do We Offer?\u003cbr/\u003e\u003cbr/\u003eAmazon offers competitive compensation packages including comprehensive healthcare benefits starting on Day 1, matching 401(k) program, and up to 20 weeks of paid parental leave. But wait, there is more: We provide lightweight fire-resistant daily wear and composite toe safety shoes for your safety!\u003cbr/\u003e\u003cbr/\u003eHere is what you can expect with the Reliability \u0026 Maintenance Engineering (RME) selection process for Mechatronics \u0026 Robotics Technicians: (Timeframe: Approximately 30-days)\u003cbr/\u003e\u003cbr/\u003eStep 1: Congratulations! You successfully submitted your application!\u003cbr/\u003e\u003cbr/\u003eStep 2: Amazon Recruiting will review your application and invite the most qualified candidate to complete a pre-employment assessment.\u003cbr/\u003e\u003cbr/\u003eStep 3: If you meet the role qualifications, you will receive an invitation from Amazon Recruiting (do-not-reply@criteriacorp.com) to begin your Criteria assessment. You have 5 days to complete.\u003cbr/\u003e\u003cbr/\u003eStep 4: Once you successfully meet the pre-employment assessment requirements, you will be invited to complete a video interview. Your video interview invitation will be from HireVue (interviews@hirevue.com) and you will have 7 days to record your interview.\u003cbr/\u003e\u003cbr/\u003eStep 5: Your video interview will be reviewed by the Amazon Hiring Team and you will be notified of next steps via email within 5 business days. \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eKey job responsibilities include, but are not limited to:\u003cbr/\u003e\u003cbr/\u003e    You will promote a safe working environment by following all safety procedures\u003cbr/\u003e    You will complete preventative maintenance routines with proper documentation\u003cbr/\u003e    You will troubleshoot electrical and mechanical problems related to all Material Handling Equipment (MHE) which includes belts, motors, photo-eyes, relays, and more\u003cbr/\u003e    You will maintain a positive working relationship across all of the Amazon Operations facility\u003cbr/\u003e    You must be able to move up to 49lbs, stand and walk during shifts lasting up to 12 hours, climb ladders and gangways safely, and without limitation, as well as perform regular bending, lifting, stretching, and reaching both below the waist and above the head\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003ePlease note that while we strive to accommodate employees' preferences for shift assignments, due to operational requirements and scheduling constraints, we cannot guarantee a specific shift assignment. ","department_cost_center":null,"description_short":"About Maintenance at AmazonOperations is at the heart of Amazon’s business. We are known for our speed, accuracy, and exceptional service. Our buildings deliver tens of thousands of products to hundreds","display_distance":null,"id":"a7af21a2-0785-4ad7-bc0d-1cd596b957f9","id_icims":"3171735","is_intern":null,"is_manager":null,"job_category":"Facilities, Maintenance, \u0026 Real Estate","job_family":"Real Estate/Facilities","job_function_id":null,"job_path":"/en/jobs/3171735/mechatronics-robotics-tech","job_schedule_type":"full-time","location":"US, AZ, Phoenix","locations":["{\"normalizedStateName\":\"Arizona\",\"normalizedCountryCode\":\"USA\",\"city\":\"Phoenix\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, AZ, Phoenix\",\"coordinates\":\"33.44825,-112.0758\",\"normalizedCountyName\":\"Maricopa\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Phoenix, Arizona, USA\",\"location\":\"US, AZ, Phoenix\",\"region\":\"AZ\",\"buildingCodeList\":[\"AZA5\"],\"normalizedCityName\":\"Phoenix\"}"],"normalized_location":"Phoenix, Arizona, USA","optional_search_labels":["operations.team-reliability-maintenance-engineering-na"],"posted_date":"February  2, 2026","preferred_qualifications":"- Experience with robotic operation and maintenance\u003cbr/\u003e- 2+ years of electrical and electronic principles experience\u003cbr/\u003e- 2+ years of Mechanical or Electrical apprenticeship experience\u003cbr/\u003e- Associate's degree in Mechnical or Electrical\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003eThe starting pay for this position is listed below including the base pay rate plus the highest available shift differential which applies depending on the shift you select. As a total compensation company, you are eligible for additional earnings including overtime pay and performance bonuses. Final pay will be based on factors including shift selection and location. Starting Day 1 of employment, Amazon offers EAP, Mental Health Support, Medical Advice Line, 401(k) matching. Learn more about our benefits at \u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://hiring.amazon.com/why-amazon/benefits\"\u003ehttps://hiring.amazon.com/why-amazon/benefits\u003c/a\u003e.\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, AZ, Phoenix - 31.00 - 32.00 USD hourly","primary_search_label":"operations.team-reliability-maintenance-engineering","source_system":"JobCreator","state":"AZ","title":"Mechatronics \u0026 Robotics Tech ","university_job":null,"updated_time":"16 minutes","url_next_step":"https://account.amazon.com/jobs/3171735/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-reliability-maintenance-engineering","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 2+ years of employee and performance management experience\u003cbr/\u003e- Bachelor's degree or equivalent, or 2+ years of Amazon (blue badge/FTE) experience\u003cbr/\u003e- Work a flexible schedule/shift/work area, including weekends, nights, and/or holidays","business_category":"fulfillment-ops","city":"St. Thomas","company_name":"Amazon Canada Fulfillment Services, ULC","country_code":"CAN","description":"Our WW Operations network delivers millions of packages and smiles to Amazon customers every day. We are looking for motivated, customer-focused individuals who want to join our team as an Area Manager. In this role, you will a team of hourly workforce and will be responsible for engaging your team during their shifts to maintain the highest levels of safety, quality, attendance, and performance. You will also play a key role in maintaining our customer expectations to ensure customer orders are delivered at the right time, to the right location.\u003cbr/\u003e\u003cbr/\u003eOur Operation’s workflow has three major components: First mile - where the product is housed and ready for order; Middle mile - where the order is hauled to your area; and Last mile - when the product is delivered to the customer’s door. Please note that all workflows have slight building variations, but one thing is constant: our vision and dedication to the customer.\u003cbr/\u003e\u003cbr/\u003eOur fulfillment network launches new Operations sites every year, providing various opportunities for your professional growth. We hire Area Managers based on location preference and the business’ current openings.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Support, mentor, and motivate your hourly workforce\u003cbr/\u003e- Manage safety, quality, productivity, and customer delivery promises\u003cbr/\u003e- Collaborate with all support teams including Safety, Engineering, Loss Prevention, Quality Assurance, Human Resources to develop plans to meet business objectives\u003cbr/\u003e- Lift up to 49 pounds and frequently push, pull, squat, bend, and reach\u003cbr/\u003e- Stand/walk for up to 12 hours during shifts\u003cbr/\u003e- Work in an environment where the noise level varies and can be loud\u003cbr/\u003e- Work in an environment that is subject to variable temperatures and weather (delivery stations include outside loading departments)\u003cbr/\u003e- Continuously climb and descend stairs (applies to sites with stairs)\u003cbr/\u003e- Possess a valid driver’s license in the state of residence\u003cbr/\u003e\u003cbr/\u003e","department_cost_center":null,"description_short":"Our WW Operations network delivers millions of packages and smiles to Amazon customers every day. We are looking for motivated, customer-focused individuals who want to join our team as an Area Manager.","display_distance":null,"id":"48e3f50d-568e-4b3e-8ffa-091042caedf9","id_icims":"3191012","is_intern":null,"is_manager":null,"job_category":"Fulfillment \u0026 Operations Management","job_family":"Fulfillment Center","job_function_id":null,"job_path":"/en/jobs/3191012/area-manager-ii","job_schedule_type":"full-time","location":"CA, ON, St. Thomas","locations":["{\"normalizedStateName\":\"Ontario\",\"normalizedCountryCode\":\"CAN\",\"city\":\"St. Thomas\",\"countryIso3a\":\"CAN\",\"countryIso2a\":\"CA\",\"locationNonStemming\":\"Canada, ON, St. Thomas\",\"coordinates\":\"42.77896,-81.1932\",\"normalizedCountyName\":\"Elgin\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Canada\",\"normalizedLocation\":\"St Thomas, Ontario, CAN\",\"location\":\"CA, ON, St. Thomas\",\"region\":\"ON\",\"buildingCodeList\":[\"YXU1\"],\"normalizedCityName\":\"St Thomas\"}"],"normalized_location":"St Thomas, Ontario, CAN","optional_search_labels":[],"posted_date":"February 26, 2026","preferred_qualifications":"- 1+ years of performance metrics, process improvement or lean techniques experience\u003cbr/\u003e- Experience in the management of large teams (50+ members)\u003cbr/\u003e- Experience with process improvements (Lean Six Sigma and/or Kaizen)\u003cbr/\u003e- Experience using strong customer service, communication, and interpersonal skills\u003cbr/\u003e- Bachelor's degree in Engineering, Operations, Supply Chain/Logistics, or a related field\u003cbr/\u003e- Experience in one or more of the following industries: shipping/logistics distribution centers, manufacturing environments, hospitality, healthcare, retail, and customer-facing / customer-service environments\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(34, 34, 34)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. As a total compensation company, Amazon's package may include other elements such as sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon offers comprehensive benefits including health insurance (medical, dental, vision, prescription, basic life \u0026amp; AD\u0026amp;D insurance), Registered Retirement Savings Plan (RRSP), Deferred Profit Sharing Plan (DPSP), paid time off, and other resources to improve health and well-being. We thank all applicants for their interest, however only those interviewed will be advised as to hiring status.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eCAN, ON, St. Thomas - 75,000.00 - 105,000.00 CAD annually","primary_search_label":"fulfillment-ops.team-fulfillment-center-management","source_system":"JobCreator","state":"ON","title":"Area Manager II","university_job":null,"updated_time":"21 minutes","url_next_step":"https://account.amazon.com/jobs/3191012/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-fulfillment-center-management","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 5+ years of non-internship professional software development experience\u003cbr/\u003e- 5+ years of designing or architecting (design patterns, reliability and scaling) of new and existing systems experience\u003cbr/\u003e- Experience leading the design, build and deployment of complex and performant (reliable and scalable) software solutions in production\u003cbr/\u003e- Experience with installing, commissioning, and troubleshooting industrial control OT equipment","business_category":"alexa-and-amazon-devices","city":"Redmond","company_name":"Amazon Kuiper Manufacturing Enterprises LLC","country_code":"USA","description":"Amazon Leo is Amazon’s low Earth orbit satellite network. Our mission is to deliver fast, reliable internet connectivity to customers beyond the reach of existing networks. From individual households to schools, hospitals, businesses, and government agencies, Amazon Leo will serve people and organizations operating in locations without reliable connectivity.\u003cbr/\u003e\u003cbr/\u003eThis role will primarily design, deploy, and maintain SCADA Platform as a Service for a streamlined SCADA Application developer experience and work on building standard data models and scalable SCADA applications using both on-premise and cloud-based systems. A successful candidate will have hands-on SCADA platform and application development experience along with system engineering skills to define and deploy standardized hardware to host the SCADA servers and clients. This is a highly collaborative position that interfaces with IT and enterprise software teams, system integration and data teams, manufacturing engineers, and production operations.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- System Design and Analyze: Analyze business requirements and specifications to design automation and integrated systems that meet the operational needs of the organization.\u003cbr/\u003e- Hardware and Software Integration: Build standard data models for integrating mechanical components, automation controls, electronics, sensors and software systems to create a unified data flow from factory floor to enterprise data stores\u003cbr/\u003e- Programming: Develop, configure and deploy SCADA platform (cloud-based and on-premise) to ensure seamless communication and coordination between machines and enterprise applications\u003cbr/\u003e- Testing and Troubleshooting: Conduct thorough testing of integrated manufacturing systems to identify and resolve any technical issues, ensuring proper functionality and reliability.\u003cbr/\u003e- Collaboration: Collaborate with cross-functional teams, including teams in Production Operations, and IT and Digital Operations (KET), to ensure successful project execution and completion.\u003cbr/\u003e- Safety and Compliance: Ensure that all integrated systems comply with internal IT and Security standards, with designs and code that is well-documented and version controlled. Contribute to the overall architecture for a high-performing, connected, safe and maintainable factory.\u003cbr/\u003e\u003cbr/\u003eExport Control Requirement:\u003cbr/\u003eDue to applicable export control laws and regulations, candidates must be a U.S. citizen or national, U.S. permanent resident (i.e., current Green Card holder), or lawfully admitted into the U.S. as a refugee or granted asylum.\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eThis is a fast-paced, intellectually challenging position. You will work with leaders in multiple technology areas across Amazon Leo to primarily define and develop a SCADA platform and SCADA application and data standards to meet the program needs. In addition, you will be responsible for project management, cost estimates and scheduling. You’ll have relentlessly high standards for yourself and everyone you work with, and you’ll be constantly looking for ways to improve your product’s performance, quality and cost. We want individuals who are ready for this challenge and want to reach beyond what is possible today.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eThe Ground Support Equipment (GSE) team is responsible for designing and commissioning automation and tooling for Satellite testing and production. This in-house team of engineers and support technicians work directly with satellite designers, testers, and manufacturing engineers to solve unique problems in high-volume satellite production.","department_cost_center":null,"description_short":"Amazon Leo is Amazon’s low Earth orbit satellite network. Our mission is to deliver fast, reliable internet connectivity to customers beyond the reach of existing networks. From individual households to","display_distance":null,"id":"33bf8ac3-a186-4c27-9536-9e2e9f5540cd","id_icims":"3130165","is_intern":null,"is_manager":null,"job_category":"Systems, Quality, \u0026 Security Engineering","job_family":"System Development Engineering","job_function_id":null,"job_path":"/en/jobs/3130165/sr-systems-dev-engineer-gse-automation-amazon-leo","job_schedule_type":"full-time","location":"US, WA, Redmond","locations":["{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Redmond\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Redmond\",\"coordinates\":\"47.67858,-122.13158\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Redmond, Washington, USA\",\"location\":\"US, WA, Redmond\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA99\"],\"normalizedCityName\":\"Redmond\"}","{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Kirkland\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Kirkland\",\"coordinates\":\"47.67887,-122.2066\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Kirkland, Washington, USA\",\"location\":\"US, WA, Kirkland\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA133\"],\"normalizedCityName\":\"Kirkland\"}"],"normalized_location":"Redmond, Washington, USA","optional_search_labels":["kuiper-mfg","devices-services.kuiper-prod-ops"],"posted_date":"November 20, 2025","preferred_qualifications":"- Knowledge of engineering practices and patterns for the full software/hardware/networks development life cycle, including coding standards, code reviews, source control management, build processes, testing, certification, and livesite operations\u003cbr/\u003e- Experience taking a leading role in building complex software or computing infrastructure that has been successfully delivered to customers\u003cbr/\u003e- 5+ years of development/programming/scripting language (Python/Java/Bash/Perl) experience\u003cbr/\u003e- Experience in mentoring, leading, or managing more junior engineers\u003cbr/\u003e- 5+ years developing software and systems for a manufacturing environment.\u003cbr/\u003e- Experience leading SCADA platform and application development using Ignition by Inductive Automation and modern DevOps practices or building scalable manufacturing software applications at a critical manufacturing environment including automotive, pharmaceutical, aerospace, or in a similar industry.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, WA, Kirkland - 151,200.00 - 204,600.00 USD annually\u003cbr/\u003eUSA, WA, REDMOND - 151,200.00 - 204,600.00 USD annually","primary_search_label":"alexa-and-amazon-devices.team-project-kuiper","source_system":"JobCreator","state":"WA","title":"Sr. Systems Dev Engineer, GSE Automation, Amazon Leo","university_job":null,"updated_time":"22 minutes","url_next_step":"https://account.amazon.com/jobs/3130165/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-project-kuiper","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Experience in automating, deploying, and supporting large-scale infrastructure\u003cbr/\u003e- Experience programming with at least one modern language such as Python, Ruby, Golang, Java, C++, C#, Rust\u003cbr/\u003e- Experience with Linux/Unix\u003cbr/\u003e- Experience with CI/CD pipelines build processes\u003cbr/\u003e- Bachelor's degree in computer science or equivalent\u003cbr/\u003e- 3+ years of designing or architecting (design patterns, reliability and scaling) of new and existing systems experience","business_category":"alexa-and-amazon-devices","city":"Kirkland","company_name":"Amazon Kuiper Manufacturing Enterprises LLC","country_code":"USA","description":"Amazon Leo is Amazon’s low Earth orbit satellite broadband network. Its mission is to deliver fast, reliable internet to customers and communities around the world, and we’ve designed the system with the capacity, flexibility, and performance to serve a wide range of customers, from individual households to schools, hospitals, businesses, government agencies, and other organizations operating in locations without reliable connectivity.\u003cbr/\u003e\u003cbr/\u003eWe are seeking an innovative and solution-oriented System Development Engineer (SysDE II) to join our team to develop innovative solutions and automated pipelines for deploying SCADA infrastructure and platform as a service. This role combines hardware, software, OT and IT stack development for SCADA infrastructure and platform within an active satellite manufacturing facility.\u003cbr/\u003e\u003cbr/\u003eIn this position, you will primarily work on backend code for IAC, CDK, and pipelines of full SCADA Infrastructure and Platform lifecycle to abstract SCADA deployment and configuration from SCADA Application development and provide engineering excellence for reliability and disaster recovery while ensuring optimal developer experience for the SCADA application developers and system integrators. Ideal candidate will have direct hands-on experience deploying Ignition SCADA Platform through modern DevOps practices at scale.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Design and implement scalable backend infrastructure for Ignition SCADA platform deployments\u003cbr/\u003e- Develop CI/CD pipelines and Infrastructure as Code using DevOps practices for SCADA system provisioning\u003cbr/\u003e- Build automated deployment frameworks and configuration tools for Ignition SCADA applications\u003cbr/\u003e- Architect cloud-native and hybrid infrastructure solutions supporting OT/IT convergence and SCADA scalability\u003cbr/\u003e- Develop backend services, APIs, and data integration layers supporting SCADA applications and manufacturing interoperability\u003cbr/\u003e- Create infrastructure monitoring, logging, and observability solutions for SCADA platform health and performance\u003cbr/\u003e- Implement security frameworks and compliance controls for OT infrastructure following industry best practices\u003cbr/\u003e- Build self-service infrastructure provisioning tools and maintain technical documentation for deployment procedures\u003cbr/\u003e- Lead technical troubleshooting and root cause analysis for infrastructure issues affecting SCADA availability\u003cbr/\u003e- Support operations through infrastructure automation, reducing manual intervention and improving reliability\u003cbr/\u003e- Drive continuous improvement for infrastructure deployment speed, reliability, and cost optimization\u003cbr/\u003e- Collaborate with production, engineering, IT, and procurement teams while managing escalations and coordinating incident resolution\u003cbr/\u003e\u003cbr/\u003eExport Control Requirement:\u003cbr/\u003eDue to applicable export control laws and regulations, candidates must be a U.S. citizen or national, U.S. permanent resident (i.e., current Green Card holder), or lawfully admitted into the U.S. as a refugee or granted asylum.\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eThis highly collaborative position interfaces across multiple Amazon Leo teams in a fast-paced manufacturing environment.\u003cbr/\u003e\u003cbr/\u003eThe successful candidate will have strong experience in automation technology development, with the ability to understand and contribute to platform as a service development, reliability metrics, and developer experience and testing within critical automated manufacturing systems.\u003cbr/\u003e\u003cbr/\u003eThe role requires hands-on technical expertise combined with strategic thinking to drive continuous improvement and deliver business-aligned solutions in an active production facility.\u003cbr/\u003e\u003cbr/\u003eThe typical schedule requires 5 days in-person per week, participation to on-call and weekend rotations to align with Leo production shifts.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eThe Ground Support Equipment (GSE) team is responsible for designing and commissioning automation and tooling for Satellite testing and production. This in-house team of engineers and support technicians work directly with satellite designers, testers, and manufacturing engineers to solve unique problems in high-volume satellite production. ","department_cost_center":null,"description_short":"Amazon Leo is Amazon’s low Earth orbit satellite broadband network. Its mission is to deliver fast, reliable internet to customers and communities around the world, and we’ve designed the system with the","display_distance":null,"id":"fb6ffc96-179d-4844-842d-a8dd800d481a","id_icims":"3127033","is_intern":null,"is_manager":null,"job_category":"Systems, Quality, \u0026 Security Engineering","job_family":"System Development Engineering","job_function_id":null,"job_path":"/en/jobs/3127033/system-development-engineer-gse-automation-amazon-leo","job_schedule_type":"full-time","location":"US, WA, Kirkland","locations":["{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Kirkland\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Kirkland\",\"coordinates\":\"47.67887,-122.2066\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Kirkland, Washington, USA\",\"location\":\"US, WA, Kirkland\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA133\"],\"normalizedCityName\":\"Kirkland\"}"],"normalized_location":"Kirkland, Washington, USA","optional_search_labels":["kuiper-mfg","devices-services.kuiper-prod-ops"],"posted_date":"November 14, 2025","preferred_qualifications":"- Experience with distributed systems at scale\u003cbr/\u003e- Experience building services using AWS products\u003cbr/\u003e- Experience in networking, storage systems, operating systems and hands-on systems engineering\u003cbr/\u003e- Experience utilizing AWS cloud solutions in a DevOps environment\u003cbr/\u003e- Knowledge of a front-end language (Javascript, CSS, HTML, etc.)\u003cbr/\u003e- Knowledge of database systems and SQL\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, WA, Kirkland - 129,200.00 - 174,800.00 USD annually","primary_search_label":"alexa-and-amazon-devices.team-project-kuiper","source_system":"JobCreator","state":"WA","title":"System Development Engineer, GSE Automation, Amazon Leo","university_job":null,"updated_time":"23 minutes","url_next_step":"https://account.amazon.com/jobs/3127033/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-project-kuiper","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 2+ years of Microsoft Office products and applications experience\u003cbr/\u003e- 2+ years of electrical and mechanical experience\u003cbr/\u003e- Ability to work on a flexible schedule including days, nights, and/or weekends.\"","business_category":"aws","city":"Canton","company_name":"Amazon Data Services, Inc.","country_code":"USA","description":"Join our dynamic team and become a critical guardian of technological infrastructure! As a Data Center Engineering Technician, you'll play a pivotal role in maintaining the heartbeat of mission-critical technology infrastructure, ensuring seamless operations that power global digital experiences. Your expertise will directly contribute to maintaining an extraordinary 99.999% uptime, keeping the digital world running smoothly and efficiently. \u003cbr/\u003e \u003cbr/\u003eEngineering Technicians are Amazon’s front line when it comes to hands-on electrical and mechanical equipment troubleshooting. They will maintain, operate, and troubleshoot, Data Center Operation’s Mission Critical Facilities, which includes stand-by diesel generators and related fuel systems, as well as three phase electrical systems such as: switch gear, UPSs, PDUs, wet cell batteries and associated systems, CRAC, centrifugal chillers, cooling towers/water chemical system, air handlers and associated systems, pumps, \u0026 motors. \u003cbr/\u003e\u003cbr/\u003eAWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help. \u003cbr/\u003e\u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion. \u003cbr/\u003e\u003cbr/\u003eNOTE: Amazon does not sponsor for immigration, including for H-1B, TN, and other non-immigrant visas, for this role. \u003cbr/\u003e\u003cbr/\u003eNOTE: Lump sum stipend will be provided to eligible candidates who relocate for this position. \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Daily building rounds to monitor and record information from electrical, mechanical, and fire/life safety equipment to ensure 24/7 reliability and availability\u003cbr/\u003e- Monitor Building Management Systems (BMS) and Electrical Power Management System (EPMS)\u003cbr/\u003e- Assist in troubleshooting of facility and rack-level events within internal Service Level Agreements (SLA)\u003cbr/\u003e- Perform rack installs and rack decommissioning within internal SLA\u003cbr/\u003e- Perform PM, troubleshooting, root cause analysis, and repair of electrical and mechanical equipment\u003cbr/\u003e- Technical writing to support change management program\u003cbr/\u003e- Monitor daily work requests and manage to resolution, and execute projects from conception to completion\u003cbr/\u003e- On-site support of contractors, sub-contractors and vendors, ensuring that all work performed is in accordance with established practices, procedures \u0026 local legislation\u003cbr/\u003e- Work schedule changes depending on specific site needs. Shifts can be up to 12-hours and may rotate on a predefined schedule. Some locations have on-call rotations.\u003cbr/\u003e- Role may support more than one location/site.\u003cbr/\u003e\u003cbr/\u003ePhysical Requirements:\u003cbr/\u003e- Willingness and demonstrated ability to work in the following physical conditions with reasonable accommodations:\u003cbr/\u003e- Regularly lift and/or move up to 39 pounds independently\u003cbr/\u003e- Participate in group lifts for 40+ pounds\u003cbr/\u003e- Maintain balance and perform construction tasks while on a ladder\u003cbr/\u003e- Regularly walk, use hands and fingers, handle or feel, reach with hands and arms, stoop, kneel, crouch or crawl, climb stairs, twist, bend, work above shoulders, grasp, carry, push and pull objects into position\u003cbr/\u003e- Work in an environment requiring provided ear protection\u003cbr/\u003e\u003cbr/\u003eThis role supports data centers in various operational stages. The position may be assigned to a facility still under development, which could require travel to established locations for training until your designated site becomes fully operational. \u003cbr/\u003e\u003cbr/\u003eEssential Requirements:  \u003cbr/\u003e\u003cbr/\u003e- Ability to travel to or commute between data center locations as needed  \u003cbr/\u003e\u003cbr/\u003e- Willingness to temporarily work at alternative sites during training periods or until assigned facility is operational  \u003cbr/\u003e\u003cbr/\u003e- Travel frequency will vary based on business needs and operational status of assigned facility \u003cbr/\u003e\u003cbr/\u003eCandidates must be able to travel (over 50 miles) or commute (less than 50 miles) to active data center sites as required by business needs. \u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eThis role acts as Amazon’s front line when it comes to hands-on electrical and mechanical equipment preventative maintenance (PM) and troubleshooting, reporting to a site’s Data Center Facility Manager (FM). They will maintain, operate, and troubleshoot mission-critical data center facility equipment including stand-by diesel generators and related fuel systems, 3 phase electrical systems such as switchgear, UPS units, PDUs, and wet cell batteries and associated systems. Mechanical equipment includes CRAHU units, centrifugal chillers, cooling towers, water systems, air handlers and associated systems, pumps, and motors. Additional support equipment is included in the scope of the role which includes fire/life safety equipment, building automation systems, and general facilities equipment.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eDiverse Experiences AWS values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying. \u003cbr/\u003e\u003cbr/\u003eWhy AWS? Amazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses. \u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture \u003cbr/\u003eAWS values curiosity and connection. Our employee-led and company-sponsored affinity groups promote inclusion and empower our people to take pride in what makes us unique. Our inclusion of events fosters stronger, more collaborative teams. Our continual innovation is fueled by the bold ideas, fresh perspectives, and passionate voices our teams bring to everything we do. \u003cbr/\u003e\u003cbr/\u003eMentorship \u0026 Career Growth  \u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship, and other career-advancing resources here to help you develop into a better-rounded professional. \u003cbr/\u003e\u003cbr/\u003eWork/Life Balance \u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve. ","department_cost_center":null,"description_short":"Join our dynamic team and become a critical guardian of technological infrastructure! As a Data Center Engineering Technician, you'll play a pivotal role in maintaining the heartbeat of mission-critical","display_distance":null,"id":"46ca82fe-c727-4307-b916-4afe98ad7822","id_icims":"3151174","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Tech Ops Engineering","job_function_id":null,"job_path":"/en/jobs/3151174/engineering-operations-technician","job_schedule_type":"full-time","location":"US, MS, Canton","locations":["{\"normalizedStateName\":\"Mississippi\",\"normalizedCountryCode\":\"USA\",\"city\":\"Canton\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, MS, Canton\",\"coordinates\":\"32.61258,-90.03472\",\"normalizedCountyName\":\"Madison\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Canton, Mississippi, USA\",\"location\":\"US, MS, Canton\",\"region\":\"MS\",\"buildingCodeList\":[\"JAN100\"],\"normalizedCityName\":\"Canton\"}"],"normalized_location":"Canton, Mississippi, USA","optional_search_labels":["aws.team-dc","aws.team-ais"],"posted_date":"January  2, 2026","preferred_qualifications":"- Experience working in a data center or mission critical facility (example: hospital, military facility, public safety facility, etc.)\u003cbr/\u003e- Associate or higher education in related field\u003cbr/\u003e- Experience with reading and writing procedures, technical documents, and engineering drawings\"\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, MS, Canton - 33.00 - 59.00 USD hourly","primary_search_label":"aws.team-support-engineer-primary","source_system":"JobCreator","state":"MS","title":"Engineering Operations Technician","university_job":null,"updated_time":"24 minutes","url_next_step":"https://account.amazon.com/jobs/3151174/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-support-engineer-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Experience with the project management of technical projects\u003cbr/\u003e- Bachelors Degree in Chemical Engineering, Mechanical Engineering or equivalent.\u003cbr/\u003e- Knowledge two or more of the following standards or equivalent:\u003cbr/\u003e- •\tASTM B31 4: Transportation Standards for Liquids and Slurries\u003cbr/\u003e- •\tAFSPCMAN 91-710: System Safety Requirements Manual for SF Ranges\u003cbr/\u003e- •\tASCE 7-16: Minimum Design Loads for Buildings\u003cbr/\u003e- •\tASCE 7-22: Minimum Design Loads for Building Hazards (Wind, Seismic, etc)","business_category":"alexa-and-amazon-devices","city":"Redmond","company_name":"Amazon Kuiper Manufacturing Enterprises LLC","country_code":"USA","description":"Amazon Leo is Amazon’s low Earth orbit satellite network. Our mission is to deliver fast, reliable internet connectivity to customers beyond the reach of existing networks. From individual households to schools, hospitals, businesses, and government agencies, Amazon Leo will serve people and organizations operating in locations without reliable connectivity.\u003cbr/\u003e\u003cbr/\u003eThis role will be responsible for the heartbeat of satellite production facility delivery. They will develop and deliver plans for facility layout and function, and will unite production teams to achieve mission success. This individual will work with a wide variety of contractors, technicians, engineers, architects, and Amazon leaders to develop and deliver a vision that meets our satellite production goals.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eEstimates and sums utility demands (LN2, GN2, electrical, etc), translates that into building infrastructure and optimizes and manages the installation and commissioning of the infrastructure and delivery system.\u003cbr/\u003e\u003cbr/\u003eKnowledge of the following standards:\u003cbr/\u003e•\tASTM B31 4: Transportation Standards for Liquids and Slurries\u003cbr/\u003e•\tNFPA 13: Standards for Fire Suppression Systems\u003cbr/\u003e•\tAFSPCMAN 91-710: System Safety Requirements Manual for SF Ranges\u003cbr/\u003e•\tASCE 7-16: Minimum Design Loads for Buildings\u003cbr/\u003e•\tASCE 7-22: Minimum Design Loads for Building Hazards (Wind, Seismic, etc)\u003cbr/\u003e","department_cost_center":null,"description_short":"Amazon Leo is Amazon’s low Earth orbit satellite network. Our mission is to deliver fast, reliable internet connectivity to customers beyond the reach of existing networks. From individual households to","display_distance":null,"id":"ee391b3f-622d-4f8f-a294-e7a787b6e9cf","id_icims":"3125054","is_intern":null,"is_manager":null,"job_category":"Hardware Development","job_family":"Hardware Development","job_function_id":null,"job_path":"/en/jobs/3125054/senior-plant-engineer-amazon-leo-tooling-and-gse-engineering","job_schedule_type":"full-time","location":"US, WA, Redmond","locations":["{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Redmond\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Redmond\",\"coordinates\":\"47.67858,-122.13158\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Redmond, Washington, USA\",\"location\":\"US, WA, Redmond\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA99\"],\"normalizedCityName\":\"Redmond\"}"],"normalized_location":"Redmond, Washington, USA","optional_search_labels":["devices-services.kuiper-prod-ops"],"posted_date":"November 12, 2025","preferred_qualifications":"- Professional Engineer License in Mechanical Engineering Thermal Fluid Systems or Chemical Engineering.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, WA, REDMOND - 137,300.00 - 185,700.00 USD annually","primary_search_label":"alexa-and-amazon-devices.team-project-kuiper","source_system":"JobCreator","state":"WA","title":"Senior Plant Engineer, Amazon Leo Tooling and GSE Engineering","university_job":null,"updated_time":"25 minutes","url_next_step":"https://account.amazon.com/jobs/3125054/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-project-kuiper","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 2+ years of hardware development, test lab, space/aerospace maintenance or hands-on engineering environment experience\u003cbr/\u003e- Minimum 5 years working experience with installing, commissioning, troubleshooting, and maintaining industrial controls equipment in a manufacturing or lab environment\u003cbr/\u003e- Experience leading a team of technicians and/or controls shop\u003cbr/\u003e- •\tDemonstrated proficiency in reading, interpreting, and executing electrical schematics and drawings (IEC standards preferred)\u003cbr/\u003e- Demonstrated knowledge of general electrical safety practices including lock-out/tag-out, PPE, arc flash protection, and NFPA 70E compliance for systems up to 480VAC\u003cbr/\u003e- Demonstrated experience leading technical projects from intake through commissioning\u003cbr/\u003e- Familiarity with work tracking systems (JIRA, Salesforce, etc.)\u003cbr/\u003e- Must be able to lift up to 49 pounds, stand/walk for up to 8-10 hours (with breaks), and frequently push, pull, squat, bend, and reach","business_category":"alexa-and-amazon-devices","city":"Kirkland","company_name":"Amazon Kuiper Manufacturing Enterprises LLC","country_code":"USA","description":"Amazon Leo is Amazon’s low Earth orbit satellite network. Our mission is to deliver fast, reliable internet connectivity to customers beyond the reach of existing networks. From individual households to schools, hospitals, businesses, and government agencies, Amazon Leo will serve people and organizations operating in locations without reliable connectivity.\u003cbr/\u003e\u003cbr/\u003eThe Controls Lead will work closely with mechanical and controls engineering teams to implement industrial automation and control equipment for the success of Amazon Leo. \u003cbr/\u003e\u003cbr/\u003eThis is a fast-paced, intellectually challenging position, and you’ll work with leaders in multiple technology areas. Ownership and an ability to thrive when faced with ambiguity is essential. \u003cbr/\u003e\u003cbr/\u003eYou’ll have relentlessly high standards for yourself and everyone you work with, and you’ll be constantly looking for ways to improve your product’s performance, quality and cost.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eLead and coordinate team of Controls Technicians in daily shop operations\u003cbr/\u003eManage work intake through JIRA, reviewing requests for quality, completeness, and documentation adequacy\u003cbr/\u003eDetermine project priorities by assessing complexity and urgency, interfacing with requestors to clarify requirements when needed\u003cbr/\u003eAllocate resources and assign work to technicians based on skill requirements, project complexity, and learning opportunities for team development\u003cbr/\u003eTake on simple or complex technical tasks directly when appropriate\u003cbr/\u003eReview and interpret electrical schematics and control panel layouts to prepare for implementation\u003cbr/\u003eServe as quality control before and during power-up and commissioning activities\u003cbr/\u003eTroubleshoot and resolve escalated technical issues across manufacturing and lab systems\u003cbr/\u003eEnsure all safety procedures, lockout/tagout protocols, and documentation requirements are followed\u003cbr/\u003eVerify implementation compliance with electrical codes, safety standards, and company policies\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eALTO (Amazon Leo Tooling Operations) provides on site expert technical support focused in the fields of Control Systems Builds, Welding, Machining, Metal Fabrication, Laser Tracking, Precision Assembly and DFM.","department_cost_center":null,"description_short":"Amazon Leo is Amazon’s low Earth orbit satellite network. Our mission is to deliver fast, reliable internet connectivity to customers beyond the reach of existing networks. From individual households to","display_distance":null,"id":"80c12fe4-c5f1-40e1-b61e-0cd96e0a9708","id_icims":"3183301","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Hardware Development","job_function_id":null,"job_path":"/en/jobs/3183301/controls-technician-lead-amazon-leo","job_schedule_type":"full-time","location":"US, WA, Kirkland","locations":["{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Kirkland\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Kirkland\",\"coordinates\":\"47.67887,-122.2066\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Kirkland, Washington, USA\",\"location\":\"US, WA, Kirkland\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA133\"],\"normalizedCityName\":\"Kirkland\"}"],"normalized_location":"Kirkland, Washington, USA","optional_search_labels":["devices-services.kuiper-prod-ops"],"posted_date":"February 17, 2026","preferred_qualifications":"- Associate's degree in electrical engineering or equivalent\u003cbr/\u003e- Professional certifications (e.g., Certified Automation Professional, Journeyman Electrician)\u003cbr/\u003e- IPC-A-620 certification or equivalent cable/harness assembly certification\u003cbr/\u003e- 7+ years working in manufacturing or lab environments with complex automation systems\u003cbr/\u003e- Familiarity with electrical CAD (EPLAN, AutoCAD Electrical, SolidWorks Electrical, etc.)\u003cbr/\u003e- Proficiency with industrial networking protocols (PROFINET, EtherNet/IP, Modbus)\u003cbr/\u003e- Experience with motion control systems, robotics integration, and vision systems\u003cbr/\u003e- Proven ability to mentor and train junior technicians\u003cbr/\u003e- Experience interfacing with cross-functional teams and managing vendor relationships\u003cbr/\u003e- Experience managing multiple concurrent projects with competing priorities\u003cbr/\u003e- Strong written and verbal communication skills for technical documentation and presentations\u003cbr/\u003e- Comfortable evangelizing ideas and concerns clearly and persuasively across organizational boundaries\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, WA, Kirkland - 99,400.00 - 160,000.00 USD annually","primary_search_label":"alexa-and-amazon-devices.team-project-kuiper","source_system":"JobCreator","state":"WA","title":"Controls Technician Lead, Amazon Leo","university_job":null,"updated_time":"25 minutes","url_next_step":"https://account.amazon.com/jobs/3183301/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-project-kuiper","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}}],"job_posting_search_request":"{\"jobPostingSearchRequest\":{\"query\":\"\",\"excludeFacets\":[{\"name\":\"businessCategory\",\"values\":[{\"name\":\"a-confidential-job\"}]},{\"name\":\"isPostedExternally\",\"values\":[{\"name\":\"0\"}]},{\"name\":\"isUnsearchable\",\"values\":[{\"name\":\"1\"}]}],\"filterFacets\":[],\"start\":0,\"size\":10,\"sort\":{\"sortOrder\":\"DESCENDING\",\"sortType\":\"SCORE\"},\"location\":null,\"accessLevel\":\"EXTERNAL\",\"includeFacets\":[],\"locationFacets\":[],\"jobTypeFacets\":[],\"contentFilterFacets\":[],\"treatment\":\"OM\"}}"}