{"error":null,"hits":10000,"facets":{},"content":{"sidebar":{},"search_results":{}},"jobs":[{"basic_qualifications":"- High school or equivalent diploma\u003cbr/\u003e- 1+ years of Microsoft Office products and applications experience\u003cbr/\u003e- Work a flexible schedule/shift/work area, including weekends, nights, and/or holidays\u003cbr/\u003e- 2+ years of conducting predictive and preventative maintenance procedures experience\u003cbr/\u003e- 2+ years of repairing material handling equipment (MHE), automated conveyor systems, or related mechanical/controls equipment experience\u003cbr/\u003e- 2+ years of reading blueprints and electrical schematics experience\u003cbr/\u003e- 2+ years of demonstrating safety standards experience\u003cbr/\u003e- 1+ years of troubleshooting and diagnostics of material handling equipment (MHE) experience","business_category":"operations","city":"Rossford","company_name":"Amazon.com Services LLC - A57","country_code":"USA","description":"About Maintenance at Amazon\u003cbr/\u003e\u003cbr/\u003eOperations is at the heart of Amazon’s business. We are known for our speed, accuracy, and exceptional service. Our buildings deliver tens of thousands of products to hundreds of countries worldwide, every day. Reliability Maintenance \u0026 Engineering (RME) are the business partners that work tirelessly behind the scenes to make it all happen. We drive continuous improvement, and maintain all of the Robotics and Material Handling Equipment (MHE) to ensure our customers are met with the Amazon smile. Come join us, on our journey!\u003cbr/\u003e\u003cbr/\u003eAbout the Role\u003cbr/\u003e\u003cbr/\u003eAs a Mechatronics \u0026 Robotics Technician, you will use your skills to support the Operations Maintenance team in repairing and maintaining material handling equipment and pneumatic systems throughout the building. You will have the opportunity to install, maintain and repair automated packaging and distribution equipment. In addition to developing your skills, you will mentor junior technicians to grow in their roles.\u003cbr/\u003e\u003cbr/\u003eWhat Do We Offer?\u003cbr/\u003e\u003cbr/\u003eAmazon offers competitive compensation packages including comprehensive healthcare benefits starting on Day 1, matching 401(k) program, and up to 20 weeks of paid parental leave. But wait, there is more: We provide lightweight fire-resistant daily wear and composite toe safety shoes for your safety!\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eHere is what you can expect with the Reliability \u0026 Maintenance Engineering (RME) selection process for Mechatronics \u0026 Robotics Technicians: (Timeframe: Approximately 30-days)\u003cbr/\u003e\u003cbr/\u003eStep 1: Congratulations! You successfully submitted your application! \u003cbr/\u003e\u003cbr/\u003eStep 2: Amazon Recruiting will review your application and invite the most qualified candidate to complete a pre-employment assessment. \u003cbr/\u003e\u003cbr/\u003eStep 3: If you meet the role qualifications, you will receive an invitation from Amazon Recruiting (do-not-reply@criteriacorp.com) to begin your Criteria assessment. You have 5 days to complete. \u003cbr/\u003e\u003cbr/\u003eStep 4: Once you successfully meet the pre-employment assessment requirements, you will be invited to complete a video interview. Your video interview invitation will be from HireVue (interviews@hirevue.com) and you will have 7 days to record your interview.\u003cbr/\u003e\u003cbr/\u003eStep 5: Your video interview will be reviewed by the Amazon Hiring Team and you will be notified of next steps via email within 5 business days. \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eKey job responsibilities include, but are not limited to:\u003cbr/\u003e\u003cbr/\u003e    You will promote a safe working environment by following all safety procedures\u003cbr/\u003e    You will complete preventative maintenance routines with proper documentation\u003cbr/\u003e    You will troubleshoot electrical and mechanical problems related to all Material Handling Equipment (MHE) which includes belts, motors, photo-eyes, relays, and more\u003cbr/\u003e    You will maintain a positive working relationship across all of the Amazon Operations facility\u003cbr/\u003e    You must be able to move up to 49lbs, stand and walk during shifts lasting up to 12 hours, climb ladders and gangways safely, and without limitation, as well as perform regular bending, lifting, stretching, and reaching both below the waist and above the head\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003ePlease note that while we strive to accommodate employees' preferences for shift assignments, due to operational requirements and scheduling constraints, we cannot guarantee a specific shift assignment. ","department_cost_center":null,"description_short":"About Maintenance at AmazonOperations is at the heart of Amazon’s business. We are known for our speed, accuracy, and exceptional service. Our buildings deliver tens of thousands of products to hundreds","display_distance":null,"id":"980981dd-8b07-4ece-8f9a-75b576f79270","id_icims":"3172267","is_intern":null,"is_manager":null,"job_category":"Facilities, Maintenance, \u0026 Real Estate","job_family":"Real Estate/Facilities","job_function_id":null,"job_path":"/en/jobs/3172267/mechatronics-robotics-technician","job_schedule_type":"full-time","location":"US, OH, Rossford","locations":["{\"normalizedStateName\":\"Ohio\",\"normalizedCountryCode\":\"USA\",\"city\":\"Rossford\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, OH, Rossford\",\"coordinates\":\"41.60889,-83.56042\",\"normalizedCountyName\":\"Wood\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Rossford, Ohio, USA\",\"location\":\"US, OH, Rossford\",\"region\":\"OH\",\"buildingCodeList\":[\"PCW1\"],\"normalizedCityName\":\"Rossford\"}"],"normalized_location":"Rossford, Ohio, USA","optional_search_labels":[],"posted_date":"February  2, 2026","preferred_qualifications":"- Experience with robotic operation and maintenance\u003cbr/\u003e- 2+ years of electrical and electronic principles experience\u003cbr/\u003e- Associate's degree in Mechnical or Electrical\u003cbr/\u003e- 2+ years of Mechanical or Electrical apprenticeship experience\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003eThe starting pay for this position is listed below including the base pay rate plus the highest available shift differential which applies depending on the shift you select. As a total compensation company, you are eligible for additional earnings including overtime pay and performance bonuses. Final pay will be based on factors including shift selection and location. Starting Day 1 of employment, Amazon offers EAP, Mental Health Support, Medical Advice Line, 401(k) matching. Learn more about our benefits at \u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://hiring.amazon.com/why-amazon/benefits\"\u003ehttps://hiring.amazon.com/why-amazon/benefits\u003c/a\u003e.\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, OH, Rossford - 31.00 - 31.00 USD hourly","primary_search_label":"operations.team-reliability-maintenance-engineering","source_system":"JobCreator","state":"OH","title":"Mechatronics \u0026 Robotics Technician","university_job":null,"updated_time":"1 minute","url_next_step":"https://account.amazon.com/jobs/3172267/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-reliability-maintenance-engineering","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 1+ years of electrical or mechanical experience\u003cbr/\u003e- 1+ years’ experience with Microsoft Office products\u003cbr/\u003e- Ability to work on a flexible schedule including days, nights, and/or weekends.","business_category":"aws","city":"Newalbany","company_name":"Amazon Data Services, Inc.","country_code":"USA","description":"Join our dynamic team and become a critical guardian of technological infrastructure! As a Data Center Engineering Technician, you'll play a pivotal role in maintaining the heartbeat of mission-critical technology infrastructure, ensuring seamless operations that power global digital experiences. Your expertise will directly contribute to maintaining an extraordinary 99.999% uptime, keeping the digital world running smoothly and efficiently.\u003cbr/\u003e\u003cbr/\u003eEngineering Technicians are Amazon’s front line when it comes to hands-on electrical and mechanical equipment troubleshooting. They will maintain, operate, and troubleshoot, Data Center Operation’s Mission Critical Facilities, which includes stand-by diesel generators and related fuel systems, as well as three phase electrical systems such as: switch gear, UPSs, PDUs, wet cell batteries and associated systems, CRAC, centrifugal chillers, cooling towers/water chemical system, air handlers and associated systems, pumps, \u0026 motors.\u003cbr/\u003eAWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help.\u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion.\u003cbr/\u003eNOTE: Amazon does not sponsor for immigration, including for H-1B, TN, and other non-immigrant visas, for this role.\u003cbr/\u003eNOTE: Lump sum stipend will be provided to eligible candidates who relocate for this position.\u003cbr/\u003e\u003cbr/\u003ePhysical Requirements:\u003cbr/\u003e•\tWillingness and demonstrated ability to work in the following physical conditions with reasonable accommodations:\u003cbr/\u003e•\tRegularly lift and/or move up to 39 pounds independently\u003cbr/\u003e•\tParticipate in group lifts for 40+ pounds\u003cbr/\u003e•\tMaintain balance and perform construction tasks while on a ladder\u003cbr/\u003e•\tRegularly walk, use hands and fingers, handle or feel, reach with hands and arms, stoop, kneel, crouch or crawl, climb stairs, twist, bend, work above shoulders, grasp, carry, push and pull objects into position\u003cbr/\u003e•\tWork in an environment requiring provided ear protection\u003cbr/\u003eThis role supports data centers in various operational stages. The position may be assigned to a facility still under development, which could require travel to established locations for training until your designated site becomes fully operational.\u003cbr/\u003eEssential Requirements: \u003cbr/\u003e•\tAbility to travel to or commute between data center locations as needed \u003cbr/\u003e•\tWillingness to temporarily work at alternative sites during training periods or until assigned facility is operational \u003cbr/\u003e•\tTravel frequency will vary based on business needs and operational status of assigned facility\u003cbr/\u003eCandidates must be able to travel (over 50 miles) or commute (less than 50 miles) to active data center sites as required by business needs.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e•\tDaily building rounds to monitor and record information from electrical, mechanical, and fire/life safety equipment to ensure 24/7 reliability and availability\u003cbr/\u003e•\tMonitor Building Management Systems (BMS) and Electrical Power Management System (EPMS)\u003cbr/\u003e•\tAssist in troubleshooting of facility and rack-level events within internal Service Level Agreements (SLA)\u003cbr/\u003e•\tPerform rack installs and rack decommissioning within internal SLA\u003cbr/\u003e•\tPerform PM, troubleshooting, root cause analysis, and repair of electrical and mechanical equipment\u003cbr/\u003e•\tTechnical writing to support change management program\u003cbr/\u003e•\tMonitor daily work requests and manage to resolution, and execute projects from conception to completion\u003cbr/\u003e•\tOn-site support of contractors, sub-contractors and vendors, ensuring that all work performed is in accordance with established practices, procedures \u0026 local legislation\u003cbr/\u003e•\tWork schedule changes depending on specific site needs. Shifts can be up to 12 hours and may rotate on a predefined schedule. Some locations have on-call rotations.\u003cbr/\u003e•\tRole may support more than one location/site.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eThis role acts as Amazon’s front line when it comes to hands-on electrical and mechanical equipment preventative maintenance (PM) and troubleshooting, reporting to a site’s Data Center Facility Manager (FM). They will maintain, operate, and troubleshoot mission-critical data center facility equipment including stand-by diesel generators and related fuel systems, 3 phase electrical systems such as switchgear, UPS units, PDUs, and wet cell batteries and associated systems. Mechanical equipment includes CRAHU units, centrifugal chillers, cooling towers, water systems, air handlers and associated systems, pumps, and motors. Additional support equipment is included in the scope of the role which includes fire/life safety equipment, building automation systems, and general facilities equipment.","department_cost_center":null,"description_short":"Join our dynamic team and become a critical guardian of technological infrastructure! As a Data Center Engineering Technician, you'll play a pivotal role in maintaining the heartbeat of mission-critical","display_distance":null,"id":"ef902205-0cc8-46d9-b89a-77e1d1d1217f","id_icims":"3187960","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Tech Ops Engineering","job_function_id":null,"job_path":"/en/jobs/3187960/engineering-operation-technician","job_schedule_type":"full-time","location":"US, OH, Newalbany","locations":["{\"normalizedStateName\":\"Ohio\",\"normalizedCountryCode\":\"USA\",\"city\":\"Newalbany\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, OH, Newalbany\",\"coordinates\":\"40.08131,-82.80885\",\"normalizedCountyName\":\"Franklin\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"New Albany, Ohio, USA\",\"location\":\"US, OH, Newalbany\",\"region\":\"OH\",\"buildingCodeList\":[\"CMH102\"],\"normalizedCityName\":\"New Albany\"}"],"normalized_location":"New Albany, Ohio, USA","optional_search_labels":["aws.team-ais","hourly","military","aws.team-dc"],"posted_date":"February 24, 2026","preferred_qualifications":"- 2+ years of data center engineering experience\u003cbr/\u003e- Technical (Military/Trade School) training\u003cbr/\u003e- Associate or higher education in related field\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003eThe starting pay for this position is listed below. Final starting pay will be based on factors including experience, qualifications, and location. Starting Day 1 of employment, Amazon offers EAP, Mental Health Support, Medical Advice Line, 401(k) matching. Learn more about our benefits at \u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://hiring.amazon.com/why-amazon/benefits\"\u003ehttps://hiring.amazon.com/why-amazon/benefits\u003c/a\u003e.\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, OH, Newalbany - 32.00 - 57.00 USD hourly","primary_search_label":"aws.team-support-engineer-primary","source_system":"JobCreator","state":"OH","title":"Engineering Operation Technician","university_job":null,"updated_time":"7 minutes","url_next_step":"https://account.amazon.com/jobs/3187960/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-support-engineer-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Bachelor's degree\u003cbr/\u003e- Experience owning/driving roadmap strategy and definition\u003cbr/\u003e- Experience with feature delivery and tradeoffs of a product\u003cbr/\u003e- Experience contributing to engineering discussions around technology decisions and strategy related to a product\u003cbr/\u003e- Experience managing technical products or online services\u003cbr/\u003e- Experience in representing and advocating for a variety of critical customers and stakeholders during executive-level prioritization and planning","business_category":"north-america-stores","city":"New York","company_name":"Amazon.com Services LLC","country_code":"USA","description":"We are seeking a technical, experienced, results-oriented leader to oversee the strategy and product vision for our Creators team. This position requires a candidate with the proven ability to insist on the highest standards”, be customer obsessed, and think big by owning third parity integrations, creator discovery, and developing our creator loyalty program.  \u003cbr/\u003e\u003cbr/\u003eThis leader will also work across functional domains, geographies, business lines, and partners to innovate for customers. Successful candidates are leaders who can prioritize well, are technically excellent, communicate clearly, and have a consistent track record of innovating and delivering results. You should have strong ability to dive deep, strong data/analytical skills, a self-starter spirit, and experience convincing senior leadership to invest in big ideas and new ways of connecting with customers. You must be a strong owner and influencer, as well as someone who can think beyond the way things have always been done. \u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Monitor industry changes, technologies, and trends, determining when they should or shouldn't drive strategic, tactical, or roadmap shifts.\u003cbr/\u003e- Lead for a suite of products and systems across 20+ countries, determining which creator-obsessed features and net new ideas to prioritize, build, and how/when/where to launch.\u003cbr/\u003e- Constantly experiment, developing data-backed solutions for problems on behalf of customers and creators. Work in close partnership with our science team to test and learn iteratively. You will be responsible for setting experimentation priorities, guardrails, success metrics, and gaining approvals to execute innovative tests.\u003cbr/\u003e- Own performance metrics and success criteria for your products during business-as-usual times as well as during critical high-velocity events, key levers for success of the channel.\u003cbr/\u003e- Work with WW business development leads to navigate existing business logic and feature sets. Define requirements for new products and features leading Amazon to innovate in how we work with creators and help them reach current and future customers.\u003cbr/\u003e- Create sustainable cross-functional and cross-product mechanisms to drive expansion and innovation while monitoring product and business health.\u003cbr/\u003e- Reduce defects and improve business performance through innovation and automation. Tirelessly improve products that will benefit creators and Amazon while owning the tools automating compensation changes.\u003cbr/\u003e- Conduct complex business analyses that identify opportunities to drive growth in our general creator population by extending learnings from BD teams within and across countries, in addition to deep dives. \u003cbr/\u003e- Develop and maintain relationships with key stakeholders inside and outside of the Amazon Creators team.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eThe Creators and Social team’s vision is to become Earth's most desired destination for creators and customers to engage in commerce content and discover relevant products through social experiences. We connect creators, customers, and brands through engaging social experiences that make shopping seamless and inspiring. By combining creator content with social reach, we meet customers wherever they are in their shopping journey while enabling creators to build successful businesses on Amazon.\u003cbr/\u003e","department_cost_center":null,"description_short":"We are seeking a technical, experienced, results-oriented leader to oversee the strategy and product vision for our Creators team. This position requires a candidate with the proven ability to insist on","display_distance":null,"id":"8a95aa47-62f4-4529-b085-1e502d9ce0c0","id_icims":"3162451","is_intern":null,"is_manager":null,"job_category":"Project/Program/Product Management--Technical","job_family":"Product Management - Technical","job_function_id":null,"job_path":"/en/jobs/3162451/senior-product-manager-tech-creators-and-social","job_schedule_type":"full-time","location":"US, NY, New York","locations":["{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Seattle\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Seattle\",\"coordinates\":\"47.60357,-122.32945\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Seattle, Washington, USA\",\"location\":\"US, WA, Seattle\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA70\"],\"normalizedCityName\":\"Seattle\"}","{\"normalizedStateName\":\"New York\",\"normalizedCountryCode\":\"USA\",\"city\":\"New York\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, NY, New York\",\"coordinates\":\"40.71453,-74.00712\",\"normalizedCountyName\":\"New York\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"New York, New York, USA\",\"location\":\"US, NY, New York\",\"region\":\"NY\",\"buildingCodeList\":[\"JFK27\"],\"normalizedCityName\":\"New York\"}"],"normalized_location":"New York, New York, USA","optional_search_labels":[],"posted_date":"January 20, 2026","preferred_qualifications":"- Experience in using analytical tools, such as Tableau, Qlikview, QuickSight\u003cbr/\u003e- Experience in building and driving adoption of new tools\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, NY, New York - 166,300.00 - 225,000.00 USD annually\u003cbr/\u003eUSA, WA, Seattle - 151,200.00 - 204,600.00 USD annually","primary_search_label":"north-america-stores.automated-marketing-and-events","source_system":"JobCreator","state":"NY","title":"Senior Product Manager - Tech, Creators and Social","university_job":null,"updated_time":"11 minutes","url_next_step":"https://account.amazon.com/jobs/3162451/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"automated-marketing-and-events","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Bachelor's degree\u003cbr/\u003e- Experience owning/driving roadmap strategy and definition\u003cbr/\u003e- Experience with feature delivery and tradeoffs of a product\u003cbr/\u003e- Experience contributing to engineering discussions around technology decisions and strategy related to a product\u003cbr/\u003e- Experience managing technical products or online services\u003cbr/\u003e- Experience in representing and advocating for a variety of critical customers and stakeholders during executive-level prioritization and planning","business_category":"north-america-stores","city":"Seattle","company_name":"Amazon.com Services LLC","country_code":"USA","description":"We are seeking a technical, experienced, results-oriented leader to oversee the strategy and product vision for our Creators team. This position requires a candidate with the proven ability to insist on the highest standards”, be customer obsessed, and think big by owning third parity integrations, creator discovery, and developing our creator loyalty program.\u003cbr/\u003e\u003cbr/\u003eThis leader will also work across functional domains, geographies, business lines, and partners to innovate for customers. Successful candidates are leaders who can prioritize well, are technically excellent, communicate clearly, and have a consistent track record of innovating and delivering results. You should have strong ability to dive deep, strong data/analytical skills, a self-starter spirit, and experience convincing senior leadership to invest in big ideas and new ways of connecting with customers. You must be a strong owner and influencer, as well as someone who can think beyond the way things have always been done.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Monitor industry changes, technologies, and trends, determining when they should or shouldn't drive strategic, tactical, or roadmap shifts.\u003cbr/\u003e- Lead for a suite of products and systems across 20+ countries, determining which creator-obsessed features and net new ideas to prioritize, build, and how/when/where to launch.\u003cbr/\u003e- Constantly experiment, developing data-backed solutions for problems on behalf of customers and creators. Work in close partnership with our science team to test and learn iteratively. You will be responsible for setting experimentation priorities, guardrails, success metrics, and gaining approvals to execute innovative tests.\u003cbr/\u003e- Own performance metrics and success criteria for your products during business-as-usual times as well as during critical high-velocity events, key levers for success of the channel.\u003cbr/\u003e- Work with WW business development leads to navigate existing business logic and feature sets. Define requirements for new products and features leading Amazon to innovate in how we work with creators and help them reach current and future customers.\u003cbr/\u003e- Create sustainable cross-functional and cross-product mechanisms to drive expansion and innovation while monitoring product and business health.\u003cbr/\u003e- Reduce defects and improve business performance through innovation and automation. Tirelessly improve products that will benefit creators and Amazon while owning the tools automating compensation changes.\u003cbr/\u003e- Conduct complex business analyses that identify opportunities to drive growth in our general creator population by extending learnings from BD teams within and across countries, in addition to deep dives.\u003cbr/\u003e- Develop and maintain relationships with key stakeholders inside and outside of the Amazon Creators team.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eThe Creators and Social team’s vision is to become Earth's most desired destination for creators and customers to engage in commerce content and discover relevant products through social experiences. We connect creators, customers, and brands through engaging social experiences that make shopping seamless and inspiring. By combining creator content with social reach, we meet customers wherever they are in their shopping journey while enabling creators to build successful businesses on Amazon.","department_cost_center":null,"description_short":"We are seeking a technical, experienced, results-oriented leader to oversee the strategy and product vision for our Creators team. This position requires a candidate with the proven ability to insist on","display_distance":null,"id":"ad7bfd96-3bf0-485f-9ca2-202a6d0f5ac5","id_icims":"3176259","is_intern":null,"is_manager":null,"job_category":"Project/Program/Product Management--Technical","job_family":"Product Management - Technical","job_function_id":null,"job_path":"/en/jobs/3176259/senior-product-manager-tech-creators-and-social","job_schedule_type":"full-time","location":"US, WA, Seattle","locations":["{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Seattle\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Seattle\",\"coordinates\":\"47.60357,-122.32945\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Seattle, Washington, USA\",\"location\":\"US, WA, Seattle\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA70\"],\"normalizedCityName\":\"Seattle\"}","{\"normalizedStateName\":\"New York\",\"normalizedCountryCode\":\"USA\",\"city\":\"New York\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, NY, New York\",\"coordinates\":\"40.71453,-74.00712\",\"normalizedCountyName\":\"New York\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"New York, New York, USA\",\"location\":\"US, NY, New York\",\"region\":\"NY\",\"buildingCodeList\":[\"JFK27\"],\"normalizedCityName\":\"New York\"}"],"normalized_location":"Seattle, Washington, USA","optional_search_labels":[],"posted_date":"February  6, 2026","preferred_qualifications":"- Experience in using analytical tools, such as Tableau, Qlikview, QuickSight\u003cbr/\u003e- Experience in building and driving adoption of new tools\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, NY, New York - 166,300.00 - 225,000.00 USD annually\u003cbr/\u003eUSA, WA, Seattle - 151,200.00 - 204,600.00 USD annually","primary_search_label":"north-america-stores.automated-marketing-and-events","source_system":"JobCreator","state":"WA","title":"Senior Product Manager - Tech, Creators and Social","university_job":null,"updated_time":"12 minutes","url_next_step":"https://account.amazon.com/jobs/3176259/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"automated-marketing-and-events","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Bachelor's degree\u003cbr/\u003e- Experience owning/driving roadmap strategy and definition\u003cbr/\u003e- Experience with feature delivery and tradeoffs of a product\u003cbr/\u003e- Experience technical product management","business_category":"north-america-stores","city":"Seattle","company_name":"Amazon.com Services LLC","country_code":"USA","description":"The Creators and Social team’s vision is to become Earth's most desired destination for creators and customers to engage in commerce content and discover relevant products through social experiences. We connect creators, customers, and brands through engaging social experiences that make shopping seamless and inspiring. By combining creator content with social reach, we meet customers wherever they are in their shopping journey while enabling creators to build successful businesses on Amazon.\u003cbr/\u003e\u003cbr/\u003eWe are seeking a technical, experienced, results-oriented leader to oversee the strategy and product vision for social marketing. This is a highly visible position requires a candidate with the proven ability to both “Dive Deep, “Think Big”, and “Insist on the Highest Standards” by re-envisioning our strategy across our Social Marketing to provide a brand burnishing experience that balances quality with performance. \u003cbr/\u003e\u003cbr/\u003eThis leader will also work across functional domains, geographies, business lines, and social media partners to innovate for customers. You must have a high bar for customer experience, understand social media applications, and be up to date on social and customer shopping trends. Successful candidates are leaders who can prioritize well, are technically excellent, communicate clearly, and have a consistent track record of innovating and delivering results. You should have strong ability to dive deep, strong data/analytical skills, a self-starter spirit, and experience convincing senior leadership to invest in big ideas and new ways of connecting with customers. You must be a strong owner and influencer, as well as someone who can think beyond the way things have always been done. \u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Monitor industry changes, technologies, and trends, determining when they should or shouldn't drive strategic, tactical, or roadmap shifts.\u003cbr/\u003e- Lead for a suite of products and systems across 20+ countries, determining which creator-obsessed features and net new ideas to prioritize, build, and how/when/where to launch.\u003cbr/\u003e- Constantly experiment, developing data-backed solutions for problems on behalf of customers and creators. Work in close partnership with our science team to test and learn iteratively. You will be responsible for setting experimentation priorities, guardrails, success metrics, and gaining approvals to execute innovative tests.\u003cbr/\u003e- Own performance metrics and success criteria for your products during business-as-usual times as well as during critical high-velocity events, key levers for success of the channel.\u003cbr/\u003e- Work with WW business development leads to navigate existing business logic and feature sets. Define requirements for new products and features leading Amazon to innovate in how we work with creators and help them reach current and future customers.\u003cbr/\u003e- Create sustainable cross-functional and cross-product mechanisms to drive expansion and innovation while monitoring product and business health.\u003cbr/\u003e- Reduce defects and improve business performance through innovation and automation. Tirelessly improve products that will benefit creators and Amazon while owning the tools automating compensation changes.\u003cbr/\u003e- Conduct complex business analyses that identify opportunities to drive growth in our general creator population by extending learnings from BD teams within and across countries, in addition to deep dives. \u003cbr/\u003e- Develop and maintain relationships with key stakeholders inside and outside of the Amazon Creators team.","department_cost_center":null,"description_short":"The Creators and Social team’s vision is to become Earth's most desired destination for creators and customers to engage in commerce content and discover relevant products through social experiences. We","display_distance":null,"id":"6385b61e-8d7a-49a9-91dc-cbb236aa0d19","id_icims":"3141365","is_intern":null,"is_manager":null,"job_category":"Project/Program/Product Management--Technical","job_family":"Product Management - Technical","job_function_id":null,"job_path":"/en/jobs/3141365/principal-product-mgr-tech-creators-and-social","job_schedule_type":"full-time","location":"US, WA, Seattle","locations":["{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Seattle\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Seattle\",\"coordinates\":\"47.60357,-122.32945\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Seattle, Washington, USA\",\"location\":\"US, WA, Seattle\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA70\"],\"normalizedCityName\":\"Seattle\"}","{\"normalizedStateName\":\"New York\",\"normalizedCountryCode\":\"USA\",\"city\":\"New York\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, NY, New York\",\"coordinates\":\"40.71453,-74.00712\",\"normalizedCountyName\":\"New York\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"New York, New York, USA\",\"location\":\"US, NY, New York\",\"region\":\"NY\",\"buildingCodeList\":[\"JFK27\"],\"normalizedCityName\":\"New York\"}"],"normalized_location":"Seattle, Washington, USA","optional_search_labels":[],"posted_date":"December 11, 2025","preferred_qualifications":"- Experience working directly with Engineers on product enhancements\u003cbr/\u003e- Experience in project management methodologies, business analysis, or process improvement\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, NY, New York - 197,900.00 - 267,800.00 USD annually\u003cbr/\u003eUSA, WA, Seattle - 179,900.00 - 243,400.00 USD annually","primary_search_label":"north-america-stores.automated-marketing-and-events","source_system":"JobCreator","state":"WA","title":"Principal Product Mgr - Tech, Creators and Social","university_job":null,"updated_time":"13 minutes","url_next_step":"https://account.amazon.com/jobs/3141365/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"automated-marketing-and-events","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Knowledge of internet fundamentals and cloud computing concepts\u003cbr/\u003e- Bachelor’s degree in Computer Science or related field and 1+ year of equivalent industry experience or 3+ years of equivalent industry experience.\u003cbr/\u003e- Core understanding of web application and service API vulnerabilities (e.g. mass assignment, broken object/function level authorization, JWT/OAuth, injection, business logic flaws, excessive data exposure, etc.).\u003cbr/\u003e- Experience tracing sources and sinks during code review to identify vulnerabilities, and providing contextual remediation guidance to address vulnerability root cause.\u003cbr/\u003e- Experience designing and reviewing secure system architectures through the use of Threat Modeling incorporating sophisticated and modern attacks.","business_category":"amazon-security","city":"Austin","company_name":"Amazon.com Services LLC","country_code":"USA","description":"Come join our penetration testing team dedicated to the detection and exploitation of vulnerabilities across Amazon’s portfolio ranging from consumer services and devices to the Kuiper satellites. This includes conducting in-depth reviews of complex service workflows including authentication mechanisms, AI, mobile, web applications, and web service APIs. Pentesters also invent new ways to automate and improve their work with techniques such as AI/LLMs, fuzzing, detection at scale, and static analysis.\u003cbr/\u003e\u003cbr/\u003eOur team operates under the Amazon Specialized Businesses Security (SBS) organization which was formed in 2014 with the mission of protecting Amazon Devices \u0026 Services (D\u0026S) customers’ trust, data, and the systems on which they rely. We protect customers by performing security reviews, offensive testing, vulnerability assessments, and provide guidance for remediations. We also drive down costs by building and automating security foundations and integrating them into design and release processes. SBS builds the foundational capabilities that raise an org-wide security bar across the growing diversity of D\u0026S businesses - securing 100+ device types, 12,000+ applications, and 100+ product lines that are developed and operated by more than 16,000+ builders.\u003cbr/\u003e\u003cbr/\u003eThe SBS penetration testing organization is growing and seeking an experienced web penetration tester to help shape the future of Amazon’s service security. You will work with builder teams and product owners to perform penetration testing and identify high-impact security vulnerabilities across the web services ecosystem supporting Amazon’s devices. The ideal candidate will be expected to comprehend large complex web service architectures and to dive deep into a service's source code, and to have some exposure to device penetration tests. This role will provide you with challenging technical opportunities and will also be a great deal of fun if hacking Amazon sounds exciting to you! \u003cbr/\u003e\u003cbr/\u003eIn this role, you will be part of a dedicated team of talented penetration testers identifying vulnerabilities in the devices and services ecosystem. You will strive to understand systems, software, and services deeply and develop creative ways to break assumptions in order to find vulnerabilities. You care deeply about keeping millions of customers that rely on Amazon’s consumer products safe and are passionate about mitigating vulnerabilities by providing actionable guidance to product teams. You're well-known for your excellent prioritization skills as well as your ability to communicate at all levels of an organization. If you're passionate about finding security bugs, writing tools to enhance manual testing capabilities, automating repetitive tasks, and enjoy seeing your work impact Amazon consumer devices and services, then this position is for you. Candidates from mid to senior level are encouraged to apply.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Contribute to penetration tests against services and software released by Amazon’s Devices \u0026 Services organization. This includes working closely with builder teams to find vulnerabilities, develop proof of concept exploits, report findings, and validate patches.\u003cbr/\u003e- Analyze and identify security vulnerabilities in source code using both automated and manual static analysis tools and techniques.\u003cbr/\u003e- Review and influence technical solutions to mitigate security vulnerabilities by providing actionable long-term risk mitigation guidance to drive security improvements.\u003cbr/\u003e- Provides impactful security contributions to large product lines through close collaboration with our partner builder teams.\u003cbr/\u003e- Develop detailed technical documentation describing identified vulnerabilities, associated impact, and recommended remediation to guide communication with internal engineering stakeholders and leadership.\u003cbr/\u003e- Continuous growth and development of technical skillsets while contributing to standing projects for program improvement in DSPT.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eDiverse Experiences\u003cbr/\u003eAmazon Security values diverse experiences. Even if you do not meet all of the qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.\u003cbr/\u003e\u003cbr/\u003eWhy Amazon Security?\u003cbr/\u003eAt Amazon, security is central to maintaining customer trust and delivering delightful customer experiences. Our organization is responsible for creating and maintaining a high bar for security across all of Amazon’s products and services. We offer talented security professionals the chance to accelerate their careers with opportunities to build\u003cbr/\u003eexperience in a wide variety of areas including cloud, devices, retail, entertainment, healthcare, operations, and physical stores.\u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture\u003cbr/\u003eIn Amazon Security, it’s in our nature to learn and be curious. Ongoing DEI events and learning experiences inspire us to continue learning and to embrace our uniqueness. Addressing the toughest security challenges requires that we seek out and celebrate a diversity of ideas, perspectives, and voices.\u003cbr/\u003e\u003cbr/\u003eTraining \u0026 Career Growth\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, training, and other career-advancing resources here to help you develop into a better-rounded professional.\u003cbr/\u003e\u003cbr/\u003eWork/Life Balance\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why flexible work hours and arrangements are part of our culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve.","department_cost_center":null,"description_short":"Come join our penetration testing team dedicated to the detection and exploitation of vulnerabilities across Amazon’s portfolio ranging from consumer services and devices to the Kuiper satellites. This","display_distance":null,"id":"14765e7c-aedd-43a1-9643-4d49068273f6","id_icims":"3177507","is_intern":null,"is_manager":null,"job_category":"Systems, Quality, \u0026 Security Engineering","job_family":"Systems Security Engineering","job_function_id":null,"job_path":"/en/jobs/3177507/pentest-security-engineer-specialized-pentest-team-devices-services","job_schedule_type":"full-time","location":"US, TX, Austin","locations":["{\"normalizedStateName\":\"Texas\",\"normalizedCountryCode\":\"USA\",\"city\":\"Austin\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, TX, Austin\",\"coordinates\":\"30.26759,-97.74299\",\"normalizedCountyName\":\"Travis\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Austin, Texas, USA\",\"location\":\"US, TX, Austin\",\"region\":\"TX\",\"buildingCodeList\":[\"AUS13\"],\"normalizedCityName\":\"Austin\"}","{\"normalizedStateName\":\"Arizona\",\"normalizedCountryCode\":\"USA\",\"city\":\"Virtual Location - Arizona\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, AZ, Virtual Location - Arizona\",\"coordinates\":\"33.44825,-112.07581\",\"type\":\"VIRTUAL\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Arizona, USA\",\"location\":\"US, AZ, Virtual Location - Arizona\",\"region\":\"AZ\",\"buildingCodeList\":[\"VIR\"]}"],"normalized_location":"Austin, Texas, USA","optional_search_labels":[],"posted_date":"February 10, 2026","preferred_qualifications":"- Foundational knowledge of hardware security fundamentals.\u003cbr/\u003e- Experience in CTF competitions, CVE research, and/or Bug Bounty recognition.\u003cbr/\u003e- Experience with Microservice architectures, AI/ML technologies, scripting and tooling, or pentesting as part of an SDLC operation of a large-scale enterprise environment.\u003cbr/\u003e- Published security research (e.g. conference presentations, whitepapers, blog posts).\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, TX, Austin - 136,000.00 - 184,000.00 USD annually\u003cbr/\u003eUSA, WA, Virtual Location - Washington - 136,000.00 - 184,000.00 USD annually","primary_search_label":"amazon-security.no-team-list","source_system":"JobCreator","state":"TX","title":"Pentest Security Engineer, Specialized Pentest Team, Devices \u0026 Services","university_job":null,"updated_time":"13 minutes","url_next_step":"https://account.amazon.com/jobs/3177507/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"no-team-list","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Bachelor's degree or equivalent, or 2+ years of equivalent experience\u003cbr/\u003e- Work flexible hours as business demands, including overnight, weekends and holidays\u003cbr/\u003e- 7+ years direct management experience, including a salaried workforce, in a manufacturing, production or distribution environment\u003cbr/\u003e- Prior experience with performance metrics, process improvement and Lean techniques\u003cbr/\u003e- Prior experience with the full staffing lifecycle, including interviewing, hiring, performance management, promotions and termination","business_category":"fulfillment-ops","city":"Tulsa","company_name":"Amazon.com Services LLC","country_code":"USA","description":"The Sr. Operations Manager oversees all budgetary, people development, and operational objectives at the site. This role involves managing and leading a team of Operations and Area Managers, coaching and mentoring them to ensure performance objectives are met. The Sr. Operations Manager is also responsible for building and maintaining positive employee relations and developing leadership strength within the Fulfillment Center (FC). This position requires a strategic leader who can balance operational excellence with team development while driving results across all areas of the facility.\u003cbr/\u003e\u003cbr/\u003eResponsibilities:\u003cbr/\u003e• Leads the development and implementation of quality improvement and process optimization initiatives, including Lean methodologies, to enhance operational efficiency within their functional area and enable the FC to consistently achieve and surpass business objectives.\u003cbr/\u003e• Responsible for overall performance of either Inbound or Outbound operation, including safety, quality and customer experience\u003cbr/\u003e• Sets and clarifies requirements and expectations for Operations and Area Managers. Measures performance, provides feedback, and holds Operations Managers accountable for their performance and the performance of their departments.\u003cbr/\u003e• Leverages Operations and Area Managers by sourcing and nurturing ideas, and rolling them into the creation of improvement plans for the functional area.\u003cbr/\u003e• Takes proactive steps to ensure that best practices are shared across all departments, shifts and among the network.\u003cbr/\u003e• Works closely with support staff (HR, Finance, Facilities, Safety, IT and other Sr. Operations Managers) to build and secure support and resources for projects and initiatives in their area, as well as providing needed support and resources for other staff initiatives.\u003cbr/\u003e\u003cbr/\u003eAdditional Job Elements:\u003cbr/\u003e• Lift and move totes up to 49 pounds each\u003cbr/\u003e• Regular bending, lifting, stretching and reaching both below the waist and above the head\u003cbr/\u003e• Walking around the FC with great frequency; FCs are over a quarter mile in length\u003cbr/\u003e• Continual standing and/or walking an average of 5 miles daily\u003cbr/\u003e• Ability to work in construction/distribution environments that may be noisy, unlit, unheated, not air-conditioned\u003cbr/\u003e• Able to access all areas of building (ascending and descending ladders, stairs, gangways safely and without limitation)\u003cbr/\u003eResponsibilities:\u003cbr/\u003e• Drives creation of quality initiatives, process change initiatives and other Lean initiatives to enable their functional area and ultimately the FC to meet and exceed business plan.\u003cbr/\u003e• Responsible for the overall safety, quality and performance and customer experience of either Inbound or Outbound operations.\u003cbr/\u003e• Will set and clarify requirements and expectations for Operations and Area Managers. Measures performance, provides feedback, and holds Ops Managers accountable for their performance and the performance of their departments.\u003cbr/\u003e• Leverages the Operations and Area Managers by sourcing and nurturing ideas, and rolling them into the creation of improvement plans for the functional area.\u003cbr/\u003e• Takes proactive steps to ensure that best practices are shared across all departments, shifts and among the network.\u003cbr/\u003e• Works closely with support staff (HR, Finance, Facilities, Safety, IT and other Sr. Operations Managers) to build and secure support and resources for projects and initiatives in their area, as well as providing needed support and resources for other staff initiatives.\u003cbr/\u003e\u003cbr/\u003eAdditional Job Elements:\u003cbr/\u003e• Lift and move totes up to 49 pounds each\u003cbr/\u003e• Regular bending, lifting, stretching and reaching both below the waist and above the head\u003cbr/\u003e• Walking in the FC and around area with great frequency; facilities are over a quarter mile in length\u003cbr/\u003e• Continual standing and/or walking an average of 5 miles daily\u003cbr/\u003e• Ability to work in construction /distribution environments that may be noisy, unlit, unheated, not air-conditioned\u003cbr/\u003e• Able to access all areas of building (ascending and descending ladders, stairs, gangways safely and without limitation)","department_cost_center":null,"description_short":"The Sr. Operations Manager oversees all budgetary, people development, and operational objectives at the site. This role involves managing and leading a team of Operations and Area Managers, coaching and","display_distance":null,"id":"7297dd98-9fb4-4bd7-a508-6f0e7927b623","id_icims":"3184130","is_intern":null,"is_manager":null,"job_category":"Fulfillment \u0026 Operations Management","job_family":"Fulfillment Center","job_function_id":null,"job_path":"/en/jobs/3184130/sr-operations-manager","job_schedule_type":"full-time","location":"US, OK, Tulsa","locations":["{\"normalizedStateName\":\"Oklahoma\",\"normalizedCountryCode\":\"USA\",\"city\":\"Tulsa\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, OK, Tulsa\",\"coordinates\":\"36.15011,-95.99352\",\"normalizedCountyName\":\"Tulsa\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Tulsa, Oklahoma, USA\",\"location\":\"US, OK, Tulsa\",\"region\":\"OK\",\"buildingCodeList\":[\"TUL2\"],\"normalizedCityName\":\"Tulsa\"}"],"normalized_location":"Tulsa, Oklahoma, USA","optional_search_labels":[],"posted_date":"February 23, 2026","preferred_qualifications":"- Ability to handle changing priorities and use good judgment in stressful situations\u003cbr/\u003e- Interest in long-term career development through assignments in multiple FCs across the nation\u003cbr/\u003e- Experience with a contingent workforce during peak seasons\u003cbr/\u003e- Bachelor's degree in Engineering, Operations or related field. MBA preferred\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, OK, Tulsa - 135,000.00 - 182,700.00 USD annually","primary_search_label":"fulfillment-ops.team-fulfillment-center-management","source_system":"JobCreator","state":"OK","title":"Sr. Operations Manager","university_job":null,"updated_time":"14 minutes","url_next_step":"https://account.amazon.com/jobs/3184130/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-fulfillment-center-management","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Bachelor's degree\u003cbr/\u003e- Experience owning/driving roadmap strategy and definition\u003cbr/\u003e- Experience with feature delivery and tradeoffs of a product\u003cbr/\u003e- Experience contributing to engineering discussions around technology decisions and strategy related to a product\u003cbr/\u003e- Experience managing technical products or online services\u003cbr/\u003e- Experience in representing and advocating for a variety of critical customers and stakeholders during executive-level prioritization and planning","business_category":"fulfillment-and-operations","city":"Bellevue","company_name":"Amazon.com Services LLC","country_code":"USA","description":"We are seeking a Senior Product Manager to own the end-to-end product vision and customer experience for Amazon’s last-hundred-yard automated delivery systems, spanning autonomy behaviors, human-robot interaction (HRI), and doorstep delivery experiences. This role is responsible for ensuring that autonomous delivery robots not only operate safely and reliably in complex real-world environments, but also deliver a trustworthy, intuitive, and delightful experience for customers, neighbors, and delivery associates.\u003cbr/\u003e\u003cbr/\u003eThe Sr. PM will define what “good” looks like for autonomous behavior and interaction at the doorstep—covering navigation in shared spaces, communication intent, failure handling, attended vs. unattended delivery modes, and edge-case customer experiences. Operating as a single-threaded owner, this role works closely with autonomy engineering, robotics hardware, safety, design, and Last Mile Tech teams to translate customer needs and business requirements into clear product requirements, measurable success metrics, and phased rollout plans.\u003cbr/\u003e\u003cbr/\u003eSuccess in this role requires strong product judgment in safety-critical systems, deep empathy for customers and frontline operators, and the ability to balance autonomy ambition with operational reality. The Sr. PM will play a critical role in shaping how millions of customers experience Amazon’s automated deliveries as we scale from pilots to broad deployment.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eOwn the product vision and roadmap for autonomy behaviors, HRI, and customer experience across last-hundred-yard automated deliveries.\u003cbr/\u003e\u003cbr/\u003eDefine customer-backward product requirements for autonomous navigation, intent communication, doorstep interaction, attended and unattended delivery flows, and failure handling.\u003cbr/\u003e\u003cbr/\u003eTranslate customer, associate, and community needs into clear PRDs, success metrics, and launch criteria across Alpha, Beta, and GA phases.\u003cbr/\u003e\u003cbr/\u003ePartner with autonomy engineering to set behavioral expectations for perception, planning, decision-making, and recovery in real-world delivery environments.\u003cbr/\u003e\u003cbr/\u003eLead the definition of HRI principles (visual, auditory, motion-based cues) to ensure robots are understandable, non-intimidating, and trusted by customers and bystanders.\u003cbr/\u003e\u003cbr/\u003eOwn the end-to-end delivery experience, including notifications, handoff flows, exception handling, and post-delivery feedback loops.\u003cbr/\u003e\u003cbr/\u003eDefine and track product KPIs such as delivery success rate, intervention rate, customer satisfaction, and experience quality metrics.\u003cbr/\u003e\u003cbr/\u003eBalance autonomy ambition with safety, reliability, and operational constraints, making clear trade-offs and prioritization decisions.\u003cbr/\u003e\u003cbr/\u003eDrive alignment across autonomy, robotics hardware, safety, design, and Last Mile Tech teams, resolving dependencies and conflicting priorities.\u003cbr/\u003e\u003cbr/\u003eRepresent the product in executive reviews, clearly articulating progress, risks, and readiness for scale.","department_cost_center":null,"description_short":"We are seeking a Senior Product Manager to own the end-to-end product vision and customer experience for Amazon’s last-hundred-yard automated delivery systems, spanning autonomy behaviors, human-robot","display_distance":null,"id":"c3315d1f-bc35-4653-859a-8691d5128034","id_icims":"3178991","is_intern":null,"is_manager":null,"job_category":"Project/Program/Product Management--Technical","job_family":"Product Management - Technical","job_function_id":null,"job_path":"/en/jobs/3178991/sr-product-manager-tech-last-mile-delivery-automation","job_schedule_type":"full-time","location":"US, WA, Bellevue","locations":["{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Bellevue\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Bellevue\",\"coordinates\":\"47.61001,-122.1872\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Bellevue, Washington, USA\",\"location\":\"US, WA, Bellevue\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA94\"],\"normalizedCityName\":\"Bellevue\"}"],"normalized_location":"Bellevue, Washington, USA","optional_search_labels":[],"posted_date":"February 11, 2026","preferred_qualifications":"- Experience in using analytical tools, such as Tableau, Qlikview, QuickSight\u003cbr/\u003e- Experience in building and driving adoption of new tools\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, WA, Bellevue - 151,200.00 - 204,600.00 USD annually","primary_search_label":"fulfillment-and-operations.team-last-mile-delivery","source_system":"JobCreator","state":"WA","title":"Sr Product Manager Tech , Last Mile Delivery Automation","university_job":null,"updated_time":"16 minutes","url_next_step":"https://account.amazon.com/jobs/3178991/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-last-mile-delivery","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Experience programming in Java, C++, Python or related language\u003cbr/\u003e- Experience with SQL and an RDBMS (e.g., Oracle) or Data Warehouse","business_category":"aws","city":"Santa Clara","company_name":"Amazon Development Center U.S., Inc.","country_code":"USA","description":"We are looking for passionate, talented, and inventive Applied Scientists with a strong machine learning background to help build industry-leading Conversational AI Systems. Our mission is to provide a delightful experience to Amazon’s customers by pushing the envelope in Natural Language Understanding (NLU), Dialog Systems including Generative AI with Large Language Models (LLMs) and Applied Machine Learning (ML).\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eAs part of our Science team in AWS Console, you will work alongside internationally recognized experts to develop novel algorithms and modeling techniques to advance the state-of-the-art in human language technology. Your work will directly impact millions of our customers in the form of products and services that make use language technology. You will gain hands on experience with Amazon’s heterogeneous text, structured data sources, and large-scale computing resources to accelerate advances in language understanding.\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eWe are hiring in all areas of human language technology: NLU, Dialog Management, Conversational AI, LLMs and Generative AI.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eUtility Computing (UC)\u003cbr/\u003eAWS Utility Computing (UC) provides product innovations — from foundational services such as Amazon’s Simple Storage Service (S3) and Amazon Elastic Compute Cloud (EC2), to consistently released new product innovations that continue to set AWS’s services and features apart in the industry. As a member of the UC organization, you’ll support the development and management of Compute, Database, Storage, Internet of Things (IoT), Platform, and Productivity Apps services in AWS, including support for customers who require specialized security solutions for their cloud services.\u003cbr/\u003e\u003cbr/\u003eDiverse Experiences\u003cbr/\u003e AWS values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.\u003cbr/\u003e\u003cbr/\u003eWhy AWS?\u003cbr/\u003e Amazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture\u003cbr/\u003eAWS values curiosity and connection. Our employee-led and company-sponsored affinity groups promote inclusion and empower our people to take pride in what makes us unique. Our inclusion events foster stronger, more collaborative teams. Our continual innovation is fueled by the bold ideas, fresh perspectives, and passionate voices our teams bring to everything we do.\u003cbr/\u003e\u003cbr/\u003eMentorship \u0026 Career Growth\u003cbr/\u003e We’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional.\u003cbr/\u003e\u003cbr/\u003eWork/Life Balance\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve.","department_cost_center":null,"description_short":"We are looking for passionate, talented, and inventive Applied Scientists with a strong machine learning background to help build industry-leading Conversational AI Systems. Our mission is to provide a","display_distance":null,"id":"fedbae8a-ae57-4e83-b1df-e64793117c24","id_icims":"3118661","is_intern":null,"is_manager":null,"job_category":"Machine Learning Science","job_family":"Applied Science","job_function_id":null,"job_path":"/en/jobs/3118661/applied-scientist-console-science","job_schedule_type":"full-time","location":"US, CA, Santa Clara","locations":["{\"normalizedStateName\":\"California\",\"normalizedCountryCode\":\"USA\",\"city\":\"Santa Clara\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, CA, Santa Clara\",\"coordinates\":\"37.3558,-121.95512\",\"normalizedCountyName\":\"Santa Clara\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Santa Clara, California, USA\",\"location\":\"US, CA, Santa Clara\",\"region\":\"CA\",\"buildingCodeList\":[\"SJC25\"],\"normalizedCityName\":\"Santa Clara\"}"],"normalized_location":"Santa Clara, California, USA","optional_search_labels":["aws.team-utility-computing","amazon.artificial-intelligence"],"posted_date":"October 30, 2025","preferred_qualifications":"- Experience implementing algorithms using both toolkits and self-developed code\u003cbr/\u003e- Have publications at top-tier peer-reviewed conferences or journals\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eLos Angeles County applicants: Job duties for this position include: work safely and cooperatively with other employees, supervisors, and staff; adhere to standards of excellence despite stressful conditions; communicate effectively and respectfully with employees, supervisors, and staff to ensure exceptional customer service; and follow all federal, state, and local laws and Company policies. Criminal history may have a direct, adverse, and negative relationship with some of the material job duties of this position. These include the duties and responsibilities listed above, as well as the abilities to adhere to company policies, exercise sound judgment, effectively manage stress and work safely and respectfully with others, exhibit trustworthiness and professionalism, and safeguard business operations and the Company’s reputation. Pursuant to the Los Angeles County Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, CA, Santa Clara - 157,300.00 - 212,800.00 USD annually","primary_search_label":"aws.team-data-science-primary","source_system":"JobCreator","state":"CA","title":"Applied Scientist, Console Science","university_job":null,"updated_time":"16 minutes","url_next_step":"https://account.amazon.com/jobs/3118661/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-data-science-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 5+ years of data querying languages (e.g. SQL), scripting languages (e.g. Python) or statistical/mathematical software (e.g. R, SAS, Matlab, etc.) experience\u003cbr/\u003e- 4+ years of data scientist experience\u003cbr/\u003e- Experience with statistical models e.g. multinomial logistic regression","business_category":"north-america-stores","city":"Seattle","company_name":"Amazon.com Services LLC","country_code":"USA","description":"Are you looking for a role where you have the opportunity to shape Amazon’s Pricing and using data science, analytics, and insights? If so, our role in Amazon's Pricing organization is for you. Amazon's Pricing Analytics organization is seeking a highly analytical Senior Data Scientist.\u003cbr/\u003e\u003cbr/\u003eIn this role, you will build and and delivers analytical solutions through agentic AI, insights, scientific studies, analyses, anomaly detection tools and technologies, which will deliver the best prices and experiences to our customers. Data science and analytics is at the core of Amazon’s culture, and your work will have a direct impact on decision making and strategy for the Pricing  organization. This role requires a self-starting leader with high judgment that thrives in ambiguity and inspires their team. We are looking for an experienced data scientist with broad and deep scientific and analytical abilities, that is customer and delivery-focused, and a has a track record of earning your customers and peer’s trust. \u003cbr/\u003e\u003cbr/\u003eTo be successful in this role, you will need a successful track record of working on diverse data science projects, agentic AI solutions, strong business acumen, statistics, experimentation, and an entrepreneurial mindset.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Build Agentic AI solutions within the pricing analytics organization\u003cbr/\u003e- Mentor and grow other scientists and BIEs \u003cbr/\u003e- Develop, build, and deliver scientific and analytical data science solutions, models, and business strategy. \u003cbr/\u003e- Lead modeling and experimentation, deep dive analyses of business problems and formulate conclusions and recommendations to be presented to senior leadership as well as published literature. \u003cbr/\u003e- Leverage LLMs to deploy, automate, and generate Insights and drive growth discussions with Product teams. \u003cbr/\u003e- Produce written scientific recommendations and insights for key stakeholders that will help shape effective metric development and reporting. \u003cbr/\u003e- Continuously invent, simplify, and automate your team’s products, tools, services, and methodologies. Improving back-end data sources and models for increased accuracy and simplicity. \u003cbr/\u003e- Recognize and adopt the best practices in data science, reporting, analyses, data quality, and modeling.","department_cost_center":null,"description_short":"Are you looking for a role where you have the opportunity to shape Amazon’s Pricing and using data science, analytics, and insights? If so, our role in Amazon's Pricing organization is for you. Amazon's","display_distance":null,"id":"c1d03466-7b79-4746-94a0-1160c574d779","id_icims":"3139265","is_intern":null,"is_manager":null,"job_category":"Data Science","job_family":"Science","job_function_id":null,"job_path":"/en/jobs/3139265/data-scientist-iii-p2-science-data-and-insights","job_schedule_type":"full-time","location":"US, WA, Seattle","locations":["{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Seattle\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Seattle\",\"coordinates\":\"47.60357,-122.32945\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Seattle, Washington, USA\",\"location\":\"US, WA, Seattle\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA71\"],\"normalizedCityName\":\"Seattle\"}"],"normalized_location":"Seattle, Washington, USA","optional_search_labels":[],"posted_date":"December  9, 2025","preferred_qualifications":"- 2+ years of data visualization using AWS QuickSight, Tableau, R Shiny, etc. experience\u003cbr/\u003e- Experience managing data pipelines\u003cbr/\u003e- Experience as a leader and mentor on a data science team\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, WA, Seattle - 159,200.00 - 215,300.00 USD annually","primary_search_label":"north-america-stores.pricing","source_system":"JobCreator","state":"WA","title":"Data Scientist III, P2 Science, Data, and Insights","university_job":null,"updated_time":"16 minutes","url_next_step":"https://account.amazon.com/jobs/3139265/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"pricing","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}}],"job_posting_search_request":"{\"jobPostingSearchRequest\":{\"query\":\"\",\"excludeFacets\":[{\"name\":\"businessCategory\",\"values\":[{\"name\":\"a-confidential-job\"}]},{\"name\":\"isPostedExternally\",\"values\":[{\"name\":\"0\"}]},{\"name\":\"isUnsearchable\",\"values\":[{\"name\":\"1\"}]}],\"filterFacets\":[],\"start\":0,\"size\":10,\"sort\":{\"sortOrder\":\"DESCENDING\",\"sortType\":\"SCORE\"},\"location\":null,\"accessLevel\":\"EXTERNAL\",\"includeFacets\":[],\"locationFacets\":[],\"jobTypeFacets\":[],\"contentFilterFacets\":[],\"treatment\":\"OM\"}}"}