{"error":null,"hits":10000,"facets":{},"content":{"sidebar":{},"search_results":{}},"jobs":[{"basic_qualifications":"- 2+ years of employee and performance management experience\u003cbr/\u003e- Bachelor's degree or equivalent, or 2+ years of Amazon (blue badge/FTE) experience\u003cbr/\u003e- Work a flexible schedule/shift/work area, including weekends, nights, and/or holidays","business_category":"fulfillment-ops","city":"Sparrows Point","company_name":"Amazon.com Services LLC","country_code":"USA","description":"Our WW Operations network delivers millions of packages and smiles to Amazon customers every day. We are looking for motivated, customer-focused individuals who want to join our team as an Area Manager. In this role, you will lead a team of hourly workforce and will be responsible for engaging your team during their shifts to maintain the highest levels of safety, quality, attendance, and performance. You will also play a key role in maintaining our customer expectations to ensure customer orders are delivered at the right time, to the right location.\u003cbr/\u003e\u003cbr/\u003eOur Operation’s workflow has three major components: First mile - where the product is housed and ready for order; Middle mile - where the order is hauled to your area; and Last mile - when the product is delivered to the customer’s door. Please note that all workflows have slight building variations, but one thing is constant: our vision and dedication to the customer. \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e* Support, mentor, and motivate your hourly workforce\u003cbr/\u003e* Manage safety, quality, productivity, and customer delivery promises\u003cbr/\u003e* Collaborate with all support teams including Safety, Engineering, Loss Prevention, Quality Assurance, Human Resources to develop plans to meet business objectives\u003cbr/\u003e* Lift up to 49 pounds and frequently push, pull, squat, bend, and reach\u003cbr/\u003e* Stand/walk for up to 12 hours during shifts\u003cbr/\u003e* Work in an environment where the noise level varies and can be loud\u003cbr/\u003e* Work in an environment that is subject to variable temperatures and weather (delivery stations include outside loading departments)\u003cbr/\u003e* Continuously climb and descend stairs (applies to sites with stairs)\u003cbr/\u003e\u003cbr/\u003eOur fulfillment network launches new Operations sites every year, providing various opportunities for your professional growth. We hire Area Managers based on location preference and the business’ current openings.","department_cost_center":null,"description_short":"Our WW Operations network delivers millions of packages and smiles to Amazon customers every day. We are looking for motivated, customer-focused individuals who want to join our team as an Area Manager.","display_distance":null,"id":"aa0ee910-bf63-4c7f-9b71-0793665adec6","id_icims":"3154639","is_intern":null,"is_manager":null,"job_category":"Fulfillment \u0026 Operations Management","job_family":"Fulfillment Center","job_function_id":null,"job_path":"/en/jobs/3154639/area-manager-ii","job_schedule_type":"full-time","location":"US, MD, Sparrows Point","locations":["{\"normalizedStateName\":\"Maryland\",\"normalizedCountryCode\":\"USA\",\"city\":\"Sparrows Point\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, MD, Sparrows Point\",\"coordinates\":\"39.2195,-76.47077\",\"normalizedCountyName\":\"Baltimore\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Sparrows Point, Maryland, USA\",\"location\":\"US, MD, Sparrows Point\",\"region\":\"MD\",\"buildingCodeList\":[\"DCA1\"],\"normalizedCityName\":\"Sparrows Point\"}"],"normalized_location":"Sparrows Point, Maryland, USA","optional_search_labels":[],"posted_date":"January  7, 2026","preferred_qualifications":"- 1+ years of performance metrics, process improvement or lean techniques experience\u003cbr/\u003e- Experience managing a team of 20+ employees\u003cbr/\u003e- Experience with process improvements (Lean process, Kaizen, and/or Six Sigma)\u003cbr/\u003e- Excellent customer service, communication, and interpersonal skills\u003cbr/\u003e- A Bachelor’s or Master’s degree in Engineering, Operations, Supply Chain/Logistics, or a related field.\u003cbr/\u003e- Industry experience in: retail, F\u0026B, military, manufacturing, automotive, biotech, electronics, energy, instrumentation, machinery, defense/aerospace, medical, cosmetics, production or distribution environments.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, MD, Sparrows Point - 70,000.00 - 90,900.00 USD annually","primary_search_label":"fulfillment-ops.team-fulfillment-center-management","source_system":"JobCreator","state":"MD","title":"Area Manager II ","university_job":null,"updated_time":"7 minutes","url_next_step":"https://account.amazon.com/jobs/3154639/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-fulfillment-center-management","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 1+ years of electrical or mechanical experience\u003cbr/\u003e- 1+ years’ experience with Microsoft Office products\u003cbr/\u003e- Ability to work on a flexible schedule including days, nights, and/or weekends.","business_category":"aws","city":"Berwick","company_name":"Amazon Data Services, Inc.","country_code":"USA","description":"Join our dynamic team and become a critical guardian of technological infrastructure! As a Data Center Engineering Technician, you'll play a pivotal role in maintaining the heartbeat of mission-critical technology infrastructure, ensuring seamless operations that power global digital experiences. Your expertise will directly contribute to maintaining an extraordinary 99.999% uptime, keeping the digital world running smoothly and efficiently. \u003cbr/\u003e \u003cbr/\u003eEngineering Technicians are Amazon’s front line when it comes to hands-on electrical and mechanical equipment troubleshooting. They will maintain, operate, and troubleshoot, Data Center Operation’s Mission Critical Facilities, which includes stand-by diesel generators and related fuel systems, as well as three phase electrical systems such as: switch gear, UPSs, PDUs, wet cell batteries and associated systems, CRAC, centrifugal chillers, cooling towers/water chemical system, air handlers and associated systems, pumps, \u0026 motors. \u003cbr/\u003e\u003cbr/\u003eAWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help. \u003cbr/\u003e\u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion. \u003cbr/\u003e\u003cbr/\u003eNOTE: Amazon does not sponsor for immigration, including for H-1B, TN, and other non-immigrant visas, for this role. \u003cbr/\u003e\u003cbr/\u003eNOTE: Lump sum stipend will be provided to eligible candidates who relocate for this position. \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e• Daily building rounds to monitor and record information from electrical, mechanical, and fire/life safety equipment to ensure 24/7 reliability and availability \u003cbr/\u003e• Monitor Building Management Systems (BMS) and Electrical Power Management System (EPMS) \u003cbr/\u003e• Assist in troubleshooting of facility and rack-level events within internal Service Level Agreements (SLA) \u003cbr/\u003e• Perform rack installs and rack decommissioning within internal SLA \u003cbr/\u003e• Perform PM, troubleshooting, root cause analysis, and repair of electrical and mechanical equipment \u003cbr/\u003e• Technical writing to support change management program \u003cbr/\u003e• Monitor daily work requests and manage to resolution, and execute projects from conception to completion \u003cbr/\u003e• On-site support of contractors, sub-contractors and vendors, ensuring that all work performed is in accordance with established practices, procedures \u0026 local legislation \u003cbr/\u003e• Work schedule changes depending on specific site needs. Shifts can be up to 12 hours and may rotate on a predefined schedule. Some locations have on-call rotations. \u003cbr/\u003e• Role may support more than one location/site. \u003cbr/\u003e\u003cbr/\u003ePhysical Requirements: \u003cbr/\u003e• Willingness and demonstrated ability to work in the following physical conditions with reasonable accommodations: \u003cbr/\u003e• Regularly lift and/or move up to 39 pounds independently \u003cbr/\u003e• Participate in group lifts for 40+ pounds \u003cbr/\u003e• Maintain balance and perform construction tasks while on a ladder \u003cbr/\u003e• Regularly walk, use hands and fingers, handle or feel, reach with hands and arms, stoop, kneel, crouch or crawl, climb stairs, twist, bend, work above shoulders, grasp, carry, push and pull objects into position \u003cbr/\u003e• Work in an environment requiring provided ear protection \u003cbr/\u003e\u003cbr/\u003eThis role supports data centers in various operational stages. The position may be assigned to a facility still under development, which could require travel to established locations for training until your designated site becomes fully operational. \u003cbr/\u003e\u003cbr/\u003eEssential Requirements:  \u003cbr/\u003e• Ability to travel to or commute between data center locations as needed  \u003cbr/\u003e• Willingness to temporarily work at alternative sites during training periods or until assigned facility is operational  \u003cbr/\u003e• Travel frequency will vary based on business needs and operational status of assigned facility \u003cbr/\u003eCandidates must be able to travel (over 50 miles) or commute (less than 50 miles) to active data center sites as required by business needs. \u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eThis role acts as Amazon’s front line when it comes to hands-on electrical and mechanical equipment preventative maintenance (PM) and troubleshooting, reporting to a site’s Data Center Facility Manager (FM). They will maintain, operate, and troubleshoot mission-critical data center facility equipment including stand-by diesel generators and related fuel systems, 3 phase electrical systems such as switchgear, UPS units, PDUs, and wet cell batteries and associated systems. Mechanical equipment includes CRAHU units, centrifugal chillers, cooling towers, water systems, air handlers and associated systems, pumps, and motors. Additional support equipment is included in the scope of the role which includes fire/life safety equipment, building automation systems, and general facilities equipment. \u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003eAmazon values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.\u003cbr/\u003e\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud.\u003cbr/\u003e\u003cbr/\u003eHere at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. Ongoing events and learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon (gender diversity) conferences, inspire us to never stop embracing our uniqueness.\u003cbr/\u003e\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional.","department_cost_center":null,"description_short":"Join our dynamic team and become a critical guardian of technological infrastructure! As a Data Center Engineering Technician, you'll play a pivotal role in maintaining the heartbeat of mission-critical","display_distance":null,"id":"f5763549-7f25-4225-bcda-bbbd988e7f0c","id_icims":"3180426","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Tech Ops Engineering","job_function_id":null,"job_path":"/en/jobs/3180426/engineering-operation-technician","job_schedule_type":"full-time","location":"US, PA, Berwick","locations":["{\"normalizedStateName\":\"Pennsylvania\",\"normalizedCountryCode\":\"USA\",\"city\":\"Berwick\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, PA, Berwick\",\"coordinates\":\"41.05089,-76.24352\",\"normalizedCountyName\":\"Columbia\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Berwick, Pennsylvania, USA\",\"location\":\"US, PA, Berwick\",\"region\":\"PA\",\"buildingCodeList\":[\"PHL122\",\"PHL125\",\"PHL108\",\"PHL99\",\"PHL114\",\"PHL111\",\"PHL119\",\"PHL103\",\"PHL901\",\"PHL100\",\"PHL123\",\"PHL120\",\"PHL126\",\"PHL107\",\"PHL118\",\"PHL115\",\"PHL101\",\"PHL104\",\"PHL112\",\"PHL900\",\"PHL106\",\"PHL109\",\"PHL110\",\"PHL124\",\"PHL116\",\"PHL121\",\"PHL113\",\"PHL117\",\"PHL102\",\"PHL105\"],\"normalizedCityName\":\"Berwick\"}"],"normalized_location":"Berwick, Pennsylvania, USA","optional_search_labels":["aws.team-ais","aws.team-dc","hourly","military"],"posted_date":"February 13, 2026","preferred_qualifications":"- 2+ years of data center engineering experience\u003cbr/\u003e- Technical (Military/Trade School) training\u003cbr/\u003e- Associate or higher education in related field\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003eThe starting pay for this position is listed below. Final starting pay will be based on factors including experience, qualifications, and location. Starting Day 1 of employment, Amazon offers EAP, Mental Health Support, Medical Advice Line, 401(k) matching. Learn more about our benefits at \u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://hiring.amazon.com/why-amazon/benefits\"\u003ehttps://hiring.amazon.com/why-amazon/benefits\u003c/a\u003e.\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, PA, Berwick - 32.00 - 57.00 USD hourly","primary_search_label":"aws.team-support-engineer-primary","source_system":"JobCreator","state":"PA","title":"Engineering Operation Technician","university_job":null,"updated_time":"8 minutes","url_next_step":"https://account.amazon.com/jobs/3180426/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-support-engineer-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Experience in analyzing and interpreting data with Redshift, Oracle, NoSQL etc.\u003cbr/\u003e- Experience with data visualization using Tableau, Quicksight, or similar tools\u003cbr/\u003e- Experience with data modeling, warehousing and building ETL pipelines\u003cbr/\u003e- Experience in Statistical Analysis packages such as R, SAS and Matlab\u003cbr/\u003e- Experience using SQL to pull data from a database or data warehouse and scripting experience (Python) to process data for modeling\u003cbr/\u003e- Experience with SQL\u003cbr/\u003e- Experience in the data/BI space","business_category":"alexa-and-amazon-devices","city":"Madrid","company_name":"Amazon Spain Services, S.L.U.","country_code":"ESP","description":"We are seeking a Business Intelligence Engineer to build reports and analytics for the Ring Business. You will deliver data-driven insights how users interact with Ring Products and sites. You will partner with product teams to understand their data needs, and look for opportunities to utilize GenAI tooling to accelerate time to insights. You will balance competing priorities to deliver actionable insights while building toward long-term data solutions. A successful candidate will have strong analytical and technical skills in data analytics and visualization. You will communicate complex data findings clearly to stakeholders and leadership. With your expertise and judgment, you'll make meaningful impact.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003es a Business Intelligence Engineer, you will solve ambiguous problems and implement data-driven solutions to improve store builder experience and business outcomes. You'll extract, integrate, and analyze critical data to design key performance metrics and indicators that drive strategic decisions.\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eA typical day offers opportunities to build innovative solutions with large-scale data systems and solve complex problems that impact strategic decisions across the company.\u003cbr/\u003e\u003cbr/\u003eYou'll start by partnering with stakeholders to understand their manual processes and pain points, diving deep to identify root causes. You'll think creatively about technology-driven solutions that can automate workflows and eliminate inefficiencies.\u003cbr/\u003e\u003cbr/\u003eYour day includes designing and implementing data pipelines, building dashboards that surface meaningful insights, and prioritizing high-impact projects that deliver maximum value to stakeholders. You'll respond to ad-hoc requests, troubleshoot reporting issues, and provide technical support to business teams.","department_cost_center":null,"description_short":"We are seeking a Business Intelligence Engineer to build reports and analytics for the Ring Business. You will deliver data-driven insights how users interact with Ring Products and sites. You will partner","display_distance":null,"id":"e64110b6-92f8-4cab-ad13-344f64fdfd5a","id_icims":"3181020","is_intern":null,"is_manager":null,"job_category":"Business Intelligence","job_family":"Business Intel Engineer","job_function_id":null,"job_path":"/en/jobs/3181020/business-intelligence-engineer-ii-ring-data-science-and-engineering","job_schedule_type":"full-time","location":"ES, M, Madrid","locations":["{\"normalizedStateName\":\"Community of Madrid\",\"normalizedCountryCode\":\"ESP\",\"city\":\"Madrid\",\"countryIso3a\":\"ESP\",\"countryIso2a\":\"ES\",\"locationNonStemming\":\"Spain, M, Madrid\",\"coordinates\":\"40.42024,-3.68755\",\"normalizedCountyName\":\"Madrid\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Spain\",\"normalizedLocation\":\"Madrid, Community of Madrid, ESP\",\"location\":\"ES, M, Madrid\",\"region\":\"M\",\"buildingCodeList\":[\"MAD12\"],\"normalizedCityName\":\"Madrid\"}"],"normalized_location":"Madrid, Community of Madrid, ESP","optional_search_labels":[],"posted_date":"February 13, 2026","preferred_qualifications":"- Experience with AWS solutions such as EC2, DynamoDB, S3, and Redshift\u003cbr/\u003e- Experience in data mining, ETL, etc. and using databases in a business environment with large-scale, complex datasets\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunities employer. We believe passionately that employing a diverse workforce is central to our success. We make recruiting decisions based on your experience and skills. We value your passion to discover, invent, simplify and build. Protecting your privacy and the security of your data is a longstanding top priority for Amazon. Please consult our Privacy Notice (\u003ca href=\"https://www.amazon.jobs/en/privacy_page\"\u003ehttps://www.amazon.jobs/en/privacy_page\u003c/a\u003e) to know more about how we collect, use and transfer the personal data of our candidates.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"alexa-and-amazon-devices.team-ring-key-blink","source_system":"JobCreator","state":"M","title":"Business Intelligence Engineer II, Ring Data Science and Engineering","university_job":null,"updated_time":"8 minutes","url_next_step":"https://account.amazon.com/jobs/3181020/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-ring-key-blink","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Experience in data engineering\u003cbr/\u003e- Experience with data modeling, warehousing and building ETL pipelines\u003cbr/\u003e- Experience with one or more query language (e.g., SQL, PL/SQL, DDL, MDX, HiveQL, SparkSQL, Scala)\u003cbr/\u003e- Experience with one or more scripting language (e.g., Python, KornShell)","business_category":"alexa-and-amazon-devices","city":"Madrid","company_name":"Amazon Spain Services, S.L.U.","country_code":"ESP","description":"Ring Data Science and Engineering team is looking for a Data Engineer (DE) to play a significant role in building their large-scale, high-volume data services. This role will be contributing to building extendable systems to support a variety of data needs, from handling large volumes of device data  needed for troubleshooting and analytics, to organizing data for usage in AI platforms to provide analytics with agility.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eThis role will be responsible for building and maintaining efficient, scalable, and privacy/security complaint data pipelines to support our business stakeholders. These pipelines will be built using both tools available in Native AWS as well as Amazon internal tools and technologies.\u003cbr/\u003e\u003cbr/\u003eThis role will need to be able to work closely with stakeholders to understand their needs and work alongside them to ensure data being ingested meets the business user's needs and will well modeled and organized to promote scalable usage and good data hygiene.\u003cbr/\u003e\u003cbr/\u003eThis role is expected to leverage new technologies like Gen AI to and adapt to business needs, building and improving frameworks and processes with these new tools to accelerate development and improve data quality.\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eThis Role will:\u003cbr/\u003e\u003cbr/\u003e- Collect and Discuss requirements from Business Stakeholders across verticals such as Subscriptions, Sales, Reverse Logistics, Finance, Product, etc.\u003cbr/\u003e-  Build new data ingestions using a combination of Native AWS services and/or internal Amazon tools. \u003cbr/\u003e- Maintaining/Improving existing data ingestions and ensuring they meet evolving standards and corporate mandates.\u003cbr/\u003e- Building/Improving/Maintaining frameworks or tools for internal team and external stakeholder usage to manage data.\u003cbr/\u003e- Performing Code Reviews and ensuring best practices are followed for ETL and Data Hygiene by team members and supporting teams.\u003cbr/\u003e- Building and updating AI Agents to streamline Data Engineering Tasks","department_cost_center":null,"description_short":"Ring Data Science and Engineering team is looking for a Data Engineer (DE) to play a significant role in building their large-scale, high-volume data services. This role will be contributing to building","display_distance":null,"id":"93c22b72-43df-4b43-828f-42d9e3849ea8","id_icims":"3181502","is_intern":null,"is_manager":null,"job_category":"Data Science","job_family":"Data Engineering","job_function_id":null,"job_path":"/en/jobs/3181502/data-engineer-i-ring-data-science-and-engineering","job_schedule_type":"full-time","location":"ES, M, Madrid","locations":["{\"normalizedStateName\":\"Community of Madrid\",\"normalizedCountryCode\":\"ESP\",\"city\":\"Madrid\",\"countryIso3a\":\"ESP\",\"countryIso2a\":\"ES\",\"locationNonStemming\":\"Spain, M, Madrid\",\"coordinates\":\"40.42024,-3.68755\",\"normalizedCountyName\":\"Madrid\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Spain\",\"normalizedLocation\":\"Madrid, Community of Madrid, ESP\",\"location\":\"ES, M, Madrid\",\"region\":\"M\",\"buildingCodeList\":[\"MAD12\"],\"normalizedCityName\":\"Madrid\"}"],"normalized_location":"Madrid, Community of Madrid, ESP","optional_search_labels":[],"posted_date":"February 16, 2026","preferred_qualifications":"- Experience with big data technologies such as: Hadoop, Hive, Spark, EMR\u003cbr/\u003e- Experience with any ETL tool like, Informatica, ODI, SSIS, BODI, Datastage, etc.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunities employer. We believe passionately that employing a diverse workforce is central to our success. We make recruiting decisions based on your experience and skills. We value your passion to discover, invent, simplify and build. Protecting your privacy and the security of your data is a longstanding top priority for Amazon. Please consult our Privacy Notice (\u003ca href=\"https://www.amazon.jobs/en/privacy_page\"\u003ehttps://www.amazon.jobs/en/privacy_page\u003c/a\u003e) to know more about how we collect, use and transfer the personal data of our candidates.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"alexa-and-amazon-devices.team-ring-key-blink","source_system":"JobCreator","state":"M","title":"Data Engineer I, Ring Data Science and Engineering","university_job":null,"updated_time":"8 minutes","url_next_step":"https://account.amazon.com/jobs/3181502/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-ring-key-blink","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Bachelor's degree, or Master's degree\u003cbr/\u003e- Experience in security services, asset protection, loss prevention, risk management, inventory management, investigations, supply chain, auditing, compliance, or similar\u003cbr/\u003e- Experience with Microsoft Office including Outlook, Word, and Excel\u003cbr/\u003e- Bachelor's degree or equivalent, or 1+ years of professional environment experience\u003cbr/\u003e- Speak, write, and read fluently in English, and have the ability to take direction in English\u003cbr/\u003e- 10+ years of managing teams experience\u003cbr/\u003e- 5+ years of working cross functionally with tech and non-tech teams experience","business_category":"fulfillment-ops","city":"Mexico City","company_name":"Servicios Comerciales Amazon Mexico S. de R.L. de C.V. - D44","country_code":"MEX","description":"Our operations network, known for our speed, accuracy, and exceptional service, delivers millions\u003cbr/\u003eof packages and smiles to Amazon customers every day. To keep our operations network secure\u003cbr/\u003eand assure operational continuity, we are looking for an experienced professional who wants to join\u003cbr/\u003eour team as Security and Loss Prevention (SLP) Senior (Sr) Manager. In this key role, you will be\u003cbr/\u003eaccountable for the delivery of security as a service to a region, composed of multiple clusters of\u003cbr/\u003eoperational sites across the end-to-end supply chain to protect our people and prevent loss.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e Be accountable to deliver strategic goals and objectives of your region\u003cbr/\u003e Manage a team of Cluster Loss Prevention Managers who provide security as a service to\u003cbr/\u003eoperational sites within a geographical area of responsibility that are composed of multiple\u003cbr/\u003eclusters\u003cbr/\u003e Ensure all operational sites within your region are compliant with security standards, are\u003cbr/\u003eregularly audited, and all sites have a robust physical security posture\u003cbr/\u003e Manage relevant risks within your region (prevention, intervention, investigation)\u003cbr/\u003e Engage senior management within your region to ensure a positive working relationship,\u003cbr/\u003eunderstand opportunities to support, and provide security risk guidance\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eAs an SLP Sr Regional Manager, you are responsible for a team of Cluster Loss Prevention Managers\u003cbr/\u003ewho provide security as a service to operational sites from across the Amazon supply chain within a\u003cbr/\u003egeographical area of responsibility that are composed of multiple security clusters. You will be\u003cbr/\u003eaccountable for the performance of Security and Loss Prevention within your region. Thus, you will\u003cbr/\u003eensure that the region can effectively deploy resources to deliver day-to-day operational services.\u003cbr/\u003eYou prioritize incoming workload and assess risks to ensure meeting service level agreements\u003cbr/\u003eagreed with your internal customers and proactively avoid adverse impact to the business. You will\u003cbr/\u003euse your knowledge and expertise to coach as well as manage your entire team and to remove\u003cbr/\u003eblockers that avoid them achieving their goals and objectives. Your team manages the day-to-day\u003cbr/\u003etactical and operational activities within each of the clusters; however, you will take ownership\u003cbr/\u003ewhen problems become highly complex. You will ensure your team will identify, evaluate, and\u003cbr/\u003emitigate all security risks within your region and share findings and best practices with the wider\u003cbr/\u003ebusiness. You are responsible for ensuring all operational sites within your region are compliant\u003cbr/\u003ewith security standards, are regularly audited, and all sites have a robust physical security posture.\u003cbr/\u003eYou own the strategic goals within your region and manage the planning of recruiting as well as\u003cbr/\u003efrugal deployment of resources. Finally, you will engage senior management within your region to\u003cbr/\u003eensure a positive working relationship, understand opportunities to support, and provide security\u003cbr/\u003erisk guidance.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eSitting within the Global Security Operations organization, Security and Loss Prevention supports the accomplishment of Amazon´s business targets and the strengthening of our brand by\u003cbr/\u003eeffectively protecting against relevant threats and by managing security and loss prevention risks\u003cbr/\u003ethat could:\u003cbr/\u003e Put our associates and customers under jeopardy\u003cbr/\u003e Disrupt the continuity of our business operations\u003cbr/\u003e Inflict damage to our assets\u003cbr/\u003e Have adverse impact on our brand reputation\u003cbr/\u003eWorking in partnership with our stakeholders, we secure the Amazon supply chain end-to-end and\u003cbr/\u003epromote security during business conversations. We do this by preventing security and loss\u003cbr/\u003eprevention-related risks and vulnerabilities as early as possible, intervening in unfolding incidents\u003cbr/\u003eto minimize any negative impact as well as thoroughly investigating security-related incidents to identify and remove root causes, preventing reoccurrence.\u003cbr/\u003e\u003cbr/\u003eInclusive team culture \u003cbr/\u003eAt Amazon we embrace our differences and we are committed to furthering our culture of inclusion. We host annual and ongoing learning experiences. Amazon’s culture of inclusion is reinforced within our 14 Leadership Principles, which remind team members to seek diverse perspectives, learn and be curious, and earn trust.\u003cbr/\u003e \u003cbr/\u003eWork Life Balance \u003cbr/\u003eWe believe striking the right balance between your personal and professional life is critical to life-long happiness and fulfillment. We offer flexibility in working hours and encourage you to find your own balance between your work and personal lives.\u003cbr/\u003e \u003cbr/\u003eMentorship \u0026 Career Growth \u003cbr/\u003eOur team is dedicated to supporting new members. We have a broad mix of experience levels and tenures, and we’re building an environment that celebrates knowledge sharing and mentorship. We care about your career growth and strive to assign projects based on what will help each team member develop into a better-rounded professional.","department_cost_center":null,"description_short":"Our operations network, known for our speed, accuracy, and exceptional service, delivers millionsof packages and smiles to Amazon customers every day. To keep our operations network secureand assure operational","display_distance":null,"id":"4d65ae42-6551-437e-9d79-78634e699767","id_icims":"3162743","is_intern":null,"is_manager":null,"job_category":"Investigation \u0026 Loss Prevention","job_family":"Fulfillment Center","job_function_id":null,"job_path":"/en/jobs/3162743/sr-regional-manager-mexico-security-loss-prevention","job_schedule_type":"full-time","location":"MX, DIF, Mexico City","locations":["{\"normalizedStateName\":\"Mexico City\",\"normalizedCountryCode\":\"MEX\",\"city\":\"Mexico City\",\"countryIso3a\":\"MEX\",\"countryIso2a\":\"MX\",\"locationNonStemming\":\"Mexico, DIF, Mexico City\",\"coordinates\":\"19.43195,-99.13315\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Mexico\",\"normalizedLocation\":\"Mexico City, Mexico City, MEX\",\"location\":\"MX, DIF, Mexico City\",\"region\":\"DIF\",\"buildingCodeList\":[\"MEX16\",\"DMX1\"],\"normalizedCityName\":\"Mexico City\"}"],"normalized_location":"Mexico City, Mexico City, MEX","optional_search_labels":[],"posted_date":"January 20, 2026","preferred_qualifications":"- Bachelor's degree or equivalent, or experience working for Amazon or any Amazon subsidiary or affiliate\u003cbr/\u003e- Associate's degree or above, or Advanced technical degree\u003cbr/\u003e- Experience with physical security best practices which includes the application of physical security systems, investigation techniques and management of contract security guards\u003cbr/\u003e- 5+ years of operations, customer service, retail, distribution, shipping, logistics, healthcare, hospitality or manufacturing experience\u003cbr/\u003e- Experience in Business English skills, both verbal and written\u003cbr/\u003e-  Driver’s license\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"fulfillment-ops.team-customer-service","source_system":"JobCreator","state":"DIF","title":"Sr Regional Manager, Mexico, Security \u0026 Loss Prevention","university_job":null,"updated_time":"9 minutes","url_next_step":"https://account.amazon.com/jobs/3162743/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-customer-service","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Baccalauréat en génie électrique, en génie mécanique ou dans un domaine connexe.  Plus de 8 ans d'expérience, douze ans d'expérience pertinente peuvent remplacer le diplôme. .\u003cbr/\u003e- Bachelor's degree in Electrical Engineering, Mechanical Engineering, or a related field and 8+ years of experience or 12 years of experience in lieu of degree\u003cbr/\u003e- Expérience de la mise en œuvre de nouveaux concepts de conception, de l'exploration au développement, jusqu'au déploiement ou à la production en série.\u003cbr/\u003e- Experience carrying new design concepts through exploration, development, and into deployment or mass production\u003cbr/\u003e- Expérience avec MS Excel, Word et les systèmes d'exploitation Windows.\" is the French translation for \"Experience in MS Excel, Word, and Windows Operating Systems.\u003cbr/\u003e- Experience in MS Excel, Word, and Windows Operating Systems\u003cbr/\u003e- Puisque ce rôle nécessite que l’employé interagisse avec d’autres entités d’Amazon à l’échelle mondiale ainsi qu’avec des employés et intervenants dans d’autres provinces canadiennes, la connaissance du français et de l’anglais est exigée pour ce poste.\u003cbr/\u003e- Due to the nature of the role that requires interaction with other Amazon entities globally and with Amazon employees and stakeholders in other provinces in Canada, bilingualism in French and English is required for this position. All physical requirements are expected with reasonable accommodations.","business_category":"aws","city":"Montreal","company_name":"Amazon Data Services Canada, Inc.","country_code":"CAN","description":"AWS Infrastructure Services conçoit, planifie, livre et exploite toute l'infrastructure mondiale d'AWS, qui inclut les centres de données et les équipements de serveurs, de stockage, de réseau, d'alimentation et de refroidissement nécessaires pour assurer l'accès continu des clients à l'innovation. L'équipe résout des problèmes complexes liés à la chaîne d'approvisionnement et recherche des talents pour aider.  \u003cbr/\u003e\u003cbr/\u003eVous rejoindrez une équipe diversifiée d'ingénieurs logiciels, matériels et réseau, de spécialistes de la chaîne d'approvisionnement, d'experts en sécurité, de responsables d'exploitation et d'autres rôles essentiels. Vous collaborerez avec des personnes à travers AWS pour nous aider à garantir les normes les plus élevées en matière de sûreté et de sécurité, tout en offrant une capacité apparemment infinie au coût le plus bas possible pour nos clients. Et vous découvrirez une culture inclusive qui accueille les idées audacieuses et vous donne les moyens de les mener à bien.  \u003cbr/\u003e\u003cbr/\u003eEn tant que Responsable de la construction de centres de données, vous ferez partie d'une équipe créative et diversifiée chargée de résoudre des problèmes fascinants liés à la construction de centres de données Amazon. Nos centres de données sont des exemples leaders du secteur en matière de conceptions écoénergétiques et rentables. Vous travaillerez aux côtés d'équipes partenaires telles que les Opérations, les Réseaux, les Contrôles, la Sécurité et la Mise en service pour construire des centres de données qui soutiennent directement nos clients.\u003cbr/\u003e\u003cbr/\u003eChez Amazon, nous sommes tous propriétaires et tirons parti des opportunités uniques qui nous sont offertes en gérant tout, de la revue de conception à l'appel d'offres de construction, en passant par l'exécution de la construction et la remise finale à nos clients. Nous sommes une équipe diversifiée, optimiste, créative, d'ingénieurs et de managers travaillant au quotidien pour développer des centres de données innovants pour nos clients.\u003cbr/\u003e\u003cbr/\u003eCe poste requiert que le candidat sélectionné maîtrise le français et l'anglais. \u003cbr/\u003e\u003cbr/\u003eCe poste nécessite environ 25 % de déplacements pour gérer simultanément des projets à Calgary et à Montréal.\u003cbr/\u003e\u003cbr/\u003eAWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help.\u003cbr/\u003e\u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion.\u003cbr/\u003e\u003cbr/\u003eAs a Data Center Construction Manager you will be a part of a creative, diverse team tasked with solving fascinating problems constructing Amazon Data Centers. Our data centers are industry-leading examples of energy efficient, cost-effective designs. You will work alongside partner teams such as Operations, Networking, Controls, Security, and Commissioning to build Data Centers that directly support our Customers.\u003cbr/\u003e\u003cbr/\u003eAs our Data Center Construction Manager, you will build some of the most interesting electrical and mechanical systems in the world. You will be on the construction site daily interacting with the construction trades, as Amazon’s owner’s representative and be directly responsible for driving cost, schedule, and quality while managing construction vendors and contractors building data centers.\u003cbr/\u003e\u003cbr/\u003eAt Amazon, we are all Owners and leverage unique opportunities presented to us by owning everything from the design review to construction bidding to construction execution and final hand-off to our customers. We are a diverse, upbeat, creative, team of engineers and managers working on a daily basis to develop innovative data centers for our Customers.\u003cbr/\u003e\u003cbr/\u003eThis position requires that the candidate selected be proficient in French and English.\u003cbr/\u003e\u003cbr/\u003eThis position requires travel of approximately 25% for managing projects in Calgary simultaneously with Montreal.  \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eLe responsable de la construction du centre de données sera responsable de la gestion des projets de construction et de la supervision des activités liées à la construction, qu'il s'agisse de nouvelles constructions ou de projets d'investissement généraux, ce qui inclut la responsabilité de la portée du projet, de la qualité, du calendrier et du budget. Certaines des tâches quotidiennes typiques du responsable de la construction :\u003cbr/\u003e\u003cbr/\u003eInterface directe avec les entrepreneurs généraux de construction pendant les phases d'appel d'offres, d'attribution, d'exécution, et de clôture/liste des réserves du projet.\u003cbr/\u003e\u003cbr/\u003eMener des négociations avec les entrepreneurs généraux et évaluer les offres/propositions avec détail et précision. \u003cbr/\u003e\u003cbr/\u003eDéfinir le périmètre du projet de construction et rédiger l'appel d'offres.\u003cbr/\u003e\u003cbr/\u003eAnalyse financière de la construction.\u003cbr/\u003e\u003cbr/\u003eGestion de projets de construction pour des initiatives spécifiques visant à accroître la résilience de nos centres de données.\u003cbr/\u003e\u003cbr/\u003eExamens de constructibilité des conceptions électriques et mécaniques associés à la construction de nouveaux centres de données ou à l'optimisation des centres de données existants.\u003cbr/\u003e\u003cbr/\u003eGestion des documents de construction, y compris l'examen des soumissions (ou \"livrables\"), les demandes d'informations (RFI), les ordres de modification et la facturation.\u003cbr/\u003e\u003cbr/\u003eContrôle de la qualité des projets de construction.\u003cbr/\u003e\u003cbr/\u003eConsigner et communiquer les principaux indicateurs de performance du chantier aux membres de l'équipe et à la direction.\u003cbr/\u003e\u003cbr/\u003eEncadrer les équipes pour effectuer le dépannage et l'analyse des causes profondes des défaillances associées aux équipements.\u003cbr/\u003e\u003cbr/\u003eÊtre un leader au sein du groupe ainsi qu'au sein des équipes internes et externes qui soutiennent le centre de données.\u003cbr/\u003e\u003cbr/\u003eThe Data Center Construction Manager will be responsible for construction project management and oversight of construction related activities as they relate to new builds or general capital projects which includes the ownership of the project scope, quality, schedule, and budget. Some of the typical daily tasks of the Construction Manager:\u003cbr/\u003e\u003cbr/\u003eDirect interface with construction general contractors during the bidding, award, execution, and project closeout/punch list phases.\u003cbr/\u003e\u003cbr/\u003eConduct negotiations with general contractors and evaluate bids/proposals with detail and accuracy.\u003cbr/\u003e\u003cbr/\u003eCreate construction project scope and request for proposals.\u003cbr/\u003e\u003cbr/\u003eFinancial analysis of construction.\u003cbr/\u003e\u003cbr/\u003eConstruction project management for specific initiatives aimed at increasing the resiliency of our data centers.\u003cbr/\u003e\u003cbr/\u003eConstructability reviews of electrical and mechanical designs associated with the construction of new data centers or optimization of existing data centers.\u003cbr/\u003e\u003cbr/\u003eConstruction document management including submittal review, RFI’s, change orders, and invoicing.\u003cbr/\u003e\u003cbr/\u003eConstruction project quality control.\u003cbr/\u003e\u003cbr/\u003eRecord and report key construction metrics to team members and management.\u003cbr/\u003e\u003cbr/\u003eDrive teams to perform troubleshooting and root-cause failure analysis associated with equipment failures.\u003cbr/\u003e\u003cbr/\u003eBe a leader within the group as well as within internal and external teams that support the data center.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eAmazon Web Services (AWS) est la plateforme cloud la plus complète et la plus largement adoptée au monde. Nous avons été les pionniers du cloud computing et n'avons jamais cessé d'innover ; c'est pourquoi les clients, des startups les plus prospères aux entreprises du Global 500, font confiance à notre suite robuste de produits et services pour alimenter leurs activités.\u003cbr/\u003e\u003cbr/\u003eNous prônons l'équilibre entre vie professionnelle et vie privée. Le succès au travail ne devrait jamais se faire au détriment de sacrifices à la maison, c'est pourquoi nous nous efforçons d'offrir de la flexibilité dans notre culture d'entreprise. Lorsque nous nous sentons soutenus au travail et à la maison, rien ne nous est impossible dans le cloud.\u003cbr/\u003e\u003cbr/\u003eIci chez AWS, il est dans notre nature d'apprendre et de faire preuve de curiosité. Nos groupes d'affinité dirigés par les employés favorisent une culture d'inclusion qui nous permet d'être fiers de nos différences. Des événements continus et des expériences d'apprentissage, y compris nos conférences « Conversations on Race and Ethnicity (CORE) » et « AmazeCon », nous incitent à ne jamais cesser d'embrasser notre singularité. \u003cbr/\u003e\u003cbr/\u003eNous relevons continuellement la barre de nos performances alors que nous nous efforçons de devenir le meilleur employeur de la Terre. C'est pourquoi vous trouverez ici un partage de connaissances infini, du mentorat et d'autres ressources de progression de carrière pour vous aider à devenir un professionnel plus complet.\u003cbr/\u003e\u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003eAmazon values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.\u003cbr/\u003e\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud.\u003cbr/\u003e\u003cbr/\u003eHere at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. Ongoing events and learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon conferences, inspire us to never stop embracing our uniqueness.\u003cbr/\u003e\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional.","department_cost_center":null,"description_short":"AWS Infrastructure Services conçoit, planifie, livre et exploite toute l'infrastructure mondiale d'AWS, qui inclut les centres de données et les équipements de serveurs, de stockage, de réseau, d'alimentation","display_distance":null,"id":"0ffc2443-5e06-4049-83da-bc18fe20b843","id_icims":"3133171","is_intern":null,"is_manager":null,"job_category":"Facilities, Maintenance, \u0026 Real Estate","job_family":"Tech Ops Engineering","job_function_id":null,"job_path":"/en/jobs/3133171/chef-de-chantier-construction-de-centres-de-donnees-construction-manager-data-center-construction-construction-de-centres-de-donnees-data-center-construction","job_schedule_type":"full-time","location":"CA, QC, Montreal","locations":["{\"normalizedStateName\":\"Quebec\",\"normalizedCountryCode\":\"CAN\",\"city\":\"Montreal\",\"countryIso3a\":\"CAN\",\"countryIso2a\":\"CA\",\"locationNonStemming\":\"Canada, QC, Montreal\",\"coordinates\":\"45.5124,-73.55469\",\"normalizedCountyName\":\"Montreal\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Canada\",\"normalizedLocation\":\"Montreal, Quebec, CAN\",\"location\":\"CA, QC, Montreal\",\"region\":\"QC\",\"buildingCodeList\":[\"YUL65\"],\"normalizedCityName\":\"Montreal\"}"],"normalized_location":"Montreal, Quebec, CAN","optional_search_labels":["aws.team-ais","aws.team-adc-infra-optional","amazon-cleared","aws.team-clearedvets","amazon-cleared-jobs"],"posted_date":"November 26, 2025","preferred_qualifications":"- Expérience en gestion de projet dans des centres de données ou des infrastructures critiques comparables.\u003cbr/\u003e- Experience in project management in data centers or comparable critical infrastructure.\u003cbr/\u003e- Expérience en exploitation d'ingénierie de centres de données, avec une compréhension approfondie de l'infrastructure électrique et mécanique des centres de données.\u003cbr/\u003e- Experience in Data Center Engineering Operations, with a deep understanding of electrical and mechanical data center infrastructure.\u003cbr/\u003e- Expérience dans Procore.\u003cbr/\u003e- Experience in Procore\u003cbr/\u003e\u003cbr/\u003eAmazon est un employeur garantissant l'égalité des chances et ne fait aucune discrimination sur la base du statut d'ancien combattant protégé, d'un handicap ou de tout autre statut protégé par la loi.\u003cbr/\u003e\u003cbr/\u003eNotre culture inclusive permet aux Amazoniens d'offrir les meilleurs résultats à nos clients. Si vous avez un handicap et que vous avez besoin de mesures d'adaptation ou d'adaptation en milieu de travail pendant le processus de candidature et d'embauche, y compris du soutien pour l'entrevue ou le processus d'intégration, veuillez visiter \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e pour plus d'informations. Si le pays ou la région dans lequel vous postulez ne figure pas dans la liste, veuillez communiquer avec votre partenaire de recrutement.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003eL'échelle salariale de base pour ce poste est indiquée ci-dessous. En tantqu'entreprise offrant une rémunération globale, Amazon peut inclure d'autres éléments dans son offre, tels que des primes à la signature et des unités d'actions restreintes (UAR). La rémunération finale sera déterminée en fonction de facteurs tels que l'expérience, les qualifications et le lieu de travail. Amazon offre des avantages sociaux complets, notamment une assurance maladie (soins médicaux, dentaires, vision, ordonnance, assurance-vie de base et assurance DMA), un régime enregistré d'épargne-retraite (REER), un régime de participation différée aux bénéfices (RPDB), des congés payés et d'autres ressources visant à améliorer la santé et le bien-être. Nous remercions tous les candidats de leur intérêt, mais seuls ceux retenus pour un entretien seront informés du résultat du processus de recrutement.\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eCAN, QC, Montreal - 104,500.00 - 137,100.00 CAD annually","primary_search_label":"aws.team-government-cloud","source_system":"JobCreator","state":"QC","title":"Chef de Chantier, Construction de Centres de Données; Construction Manager, Data Center Construction, Construction de Centres de Données; Data Center Construction","university_job":null,"updated_time":"11 minutes","url_next_step":"https://account.amazon.com/jobs/3133171/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-government-cloud","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- high school diploma or equivalent\u003cbr/\u003e- 1+ years in a high traceability manufacturing environment, or relevant trade school certification\u003cbr/\u003e- 1+ years of hand tools experience (i.e., Calipers, multi-meters, torque wrenches)\u003cbr/\u003e- 1+ years working with test tools and test methods that adequately validate the system","business_category":"alexa-and-amazon-devices","city":"Kirkland","company_name":"Amazon Kuiper Manufacturing Enterprises LLC - M90","country_code":"USA","description":"Amazon Leo is Amazon's low Earth orbit satellite network. Our mission is to deliver fast, reliable internet connectivity to customers beyond the reach of existing networks. From individual households to schools, hospitals, businesses, and government agencies, Amazon Leo will serve people and organizations operating in locations without reliable connectivity.\u003cbr/\u003e\u003cbr/\u003eOne of the most ambitious missions that Amazon has undertaken to date, the Leo satellite constellation, is our solution to providing reliable internet. We are looking for talented technicians to help full-scale production of the Leo satellites.\u003cbr/\u003e\u003cbr/\u003eThe success of Leo depends on the quality, reliability, cost, manufacturability, throughput, and security of the products that you deliver. If you seek a fast-paced, dynamic environment; if you thrive on solving difficult problems where resolutions have high impact; and if you love the challenge of building something from scratch, then this role will be an ideal next career step. To be successful you need to be highly motivated and detail oriented while showing the highest standards of execution.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Champion safety requirements in all designated zones and work locations\u003cbr/\u003e- Assemble and test with emphasis to detail, an assortment of avionic LRUs, electrical-mechanical assemblies, handle and install fiber-optics, and PCBAs\u003cbr/\u003e- Ensure lab equipment is maintained and calibrated\u003cbr/\u003e- Supports some preventative maintenance activities on test equipment and data acquisition systems\u003cbr/\u003e- Identify equipment requirements, process improvements, maintain floor stock inventory\u003cbr/\u003e- You will independently execute and prioritize work to meet company deliverables\u003cbr/\u003e- Execute test procedures for component and system level testing maintenance\u003cbr/\u003e- Receive shipments and coordinate deliveries with recipients (Using pallet jacks, kit carts, etc)\u003cbr/\u003e- Your work may include contributing to improving SOPs and safety procedures\u003cbr/\u003e\u003cbr/\u003eCandidates must be 18 years or older with the ability to understand and adhere to all job requirements and safety guidelines.\u003cbr/\u003e\u003cbr/\u003eSecond Shift Schedule: 4 /10s  Sun-Wednesday 5pm-3:30pm\u003cbr/\u003e\u003cbr/\u003eThe starting pay for this role in Washington State is up to $33.50/hour and employees are eligible for incremental raises based on tenure. A full range of medical, financial, and/or other benefits are provided. This information is provided per the Washington State Pay Transparency Act. Base pay information is based on market location. Applicants should apply via Amazon's internal or external careers site.\u003cbr/\u003e\u003cbr/\u003eExport Control Requirement:\u003cbr/\u003eDue to applicable export control laws and regulations, candidates must be a U.S. citizen or national, U.S. permanent resident (i.e., current Green Card holder), or lawfully admitted into the U.S. as a refugee or granted asylum.\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eWe are a group of Technicians with well over 20+ years of diverse skills and experience. Each team member brings in willingness to train and positive team energy. Some tasks you may be an individual contributor, but may also work in a group environment to achieve organizational goals. This group of Technicians thrived in success by working as a team. We are currently in research and development but moving towards production environment.","department_cost_center":null,"description_short":"Amazon Leo is Amazon's low Earth orbit satellite network. Our mission is to deliver fast, reliable internet connectivity to customers beyond the reach of existing networks. From individual households to","display_distance":null,"id":"de5059b1-72e6-4dbc-9595-beba4fe105cc","id_icims":"3175525","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Manufacturing","job_function_id":null,"job_path":"/en/jobs/3175525/manufacturing-assembly-technician-ii-2nd-shift-amazon-leo","job_schedule_type":"full-time","location":"US, WA, Kirkland","locations":["{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Kirkland\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Kirkland\",\"coordinates\":\"47.67887,-122.2066\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Kirkland, Washington, USA\",\"location\":\"US, WA, Kirkland\",\"region\":\"WA\",\"buildingCodeList\":[\"ONM233\",\"SEA11\",\"ZKL2\",\"METR6\",\"SEA133\",\"ATBP16\",\"LSE2\",\"ONM129\",\"JSE7\",\"PAE33\",\"ONM235\",\"UWA1\",\"WFM655\"],\"normalizedCityName\":\"Kirkland\"}"],"normalized_location":"Kirkland, Washington, USA","optional_search_labels":["devices-services.kuiper-prod-ops"],"posted_date":"February  5, 2026","preferred_qualifications":"- Aircraft \u0026 Powerplant (A\u0026P) certification/license Prior telecom (fiber optics) experience a plus\u003cbr/\u003e- CFOT certification or equivalent experience\u003cbr/\u003e- Airman or Avionic certification or equivalent experience -ASE certification or equivalent experience\u003cbr/\u003e- Experience in fast-paced production environment with flight hardware\u003cbr/\u003e- Ability to use precision measuring instruments\u003cbr/\u003e- 1+ years able to read, interpret and work from engineering documentation and/ or drawings\u003cbr/\u003e- Experience working with FOD, ESD sensitive hardware and clean room requirements\u003cbr/\u003e- 1+ years of Electro-Mechanical Assembly, Final Integration and/or Harness Integration experience\u003cbr/\u003e- Ability to work effectively in a team environment\u003cbr/\u003e- Ability to rapidly change roles/responsibilities while working in a high-paced, challenging work environment\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003eThe starting pay for this position is listed below including the base pay rate plus the highest available shift differential which applies depending on the shift you select. As a total compensation company, you are eligible for additional earnings including overtime pay and performance bonuses. Final pay will be based on factors including shift selection and location. Starting Day 1 of employment, Amazon offers EAP, Mental Health Support, Medical Advice Line, 401(k) matching. Learn more about our benefits at \u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://hiring.amazon.com/why-amazon/benefits\"\u003ehttps://hiring.amazon.com/why-amazon/benefits\u003c/a\u003e.\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, WA, Kirkland - 33.00 - 36.00 USD hourly","primary_search_label":"alexa-and-amazon-devices.team-project-kuiper","source_system":"JobCreator","state":"WA","title":"Manufacturing Assembly Technician II (2nd Shift), Amazon Leo","university_job":null,"updated_time":"11 minutes","url_next_step":"https://account.amazon.com/jobs/3175525/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-project-kuiper","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- High school or equivalent\u003cbr/\u003e- A minimum of 1 year in an Environmental Health \u0026 Safety (EHS) related field OR; A Bachelor’s degree in EHS-relevant background OR; 6 months experience performing in a safety-related role within Amazon\u003cbr/\u003e- Knowledge of OSHA regulations specifically 29 CFR 1910\u003cbr/\u003e- Experience using Microsoft Word and Excel in a professional capacity\u003cbr/\u003e- Experience maintaining confidentiality in matter involving security and/or personnel issues in the workplace","business_category":"fulfillment-and-operations","city":"Jessup","company_name":"Amazon.com Services LLC","country_code":"USA","description":"Join Amazon’s mission to become Earth’s safest place to work! At Amazon, we’ve set the ambitious goal to become the benchmark of safety excellence across all industries in which we operate. As a Workplace Health \u0026 Safety Specialist (WHSS), you'll be at the forefront of transforming workplace safety culture at one of the world's most innovative companies. Your expertise and dedication will directly protect employees, ensuring they return home safely to their families every day. You'll facilitate new approaches to safety, combining technology with human-centered solutions to create an environment where safety and productivity thrive together. This isn't just about maintaining safety standards – it's about revolutionizing how we think about and implement workplace safety, making a lasting impact on our people and operations. As your building's designated safety champion, you'll have the unique opportunity to build relationships, influence positive change, and help write the next chapter in Amazon's commitment to becoming Earth's Safest Place to Work.\u003cbr/\u003e\u003cbr/\u003eCore Impact Areas:\u003cbr/\u003eSafety Program Excellence \u0026 Implementation - Drive comprehensive safety programs through data-driven strategies. Lead daily safety audits, incident investigations, and risk assessments while implementing innovative solutions to prevent injuries. Deliver engaging safety training that resonates with associates and promotes a proactive safety culture. Champion continuous improvement initiatives that enhance workplace safety while maintaining operational efficiency.\u003cbr/\u003e\u003cbr/\u003eAssociate Advocacy \u0026 Cultural Leadership - Serve as a trusted safety advisor and advocate for associate wellbeing, building strong partnerships across all levels of the organization. Foster a culture where safety is everyone's priority through effective communication, coaching, and positive reinforcement. Develop strong relationships with frontline associates and leadership to drive behavioral changes and ensure safety best practices become natural habits. Transform safety data into compelling narratives that influence positive change and drive engagement in safety initiatives.\u003cbr/\u003e\u003cbr/\u003eAdditional Job Elements include:\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e    Lift up to 49 pounds and frequently push, pull, squat, bend, and reach\u003cbr/\u003e\u003cbr/\u003e    Stand/walk for up to 12 hours during shifts\u003cbr/\u003e\u003cbr/\u003e    Work in an environment where the noise level varies\u003cbr/\u003e\u003cbr/\u003e    Work in an environment that is subject to variable temperatures and weather (delivery stations include outside loading departments)\u003cbr/\u003e\u003cbr/\u003e    Continuously climb and descend stairs (applies to sites with stairs)\u003cbr/\u003e\u003cbr/\u003e    Maintain effective care delivery in emergencies and assist emergency response at the site\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eMust be available to work flexible shifts including days, nights and/or weekends.\u003cbr/\u003e\u003cbr/\u003eFor those that do not have an adult First Aid, CPR, AED certification from the American Heart Association or American Red Cross, must obtain within 3 weeks of start date.","department_cost_center":null,"description_short":"Join Amazon’s mission to become Earth’s safest place to work! At Amazon, we’ve set the ambitious goal to become the benchmark of safety excellence across all industries in which we operate. As a Workplace","display_distance":null,"id":"396a1773-9c97-4cc1-8c68-c8fc3dd498cb","id_icims":"3168936","is_intern":null,"is_manager":null,"job_category":"Medical, Health, \u0026 Safety","job_family":"Fulfillment Center","job_function_id":null,"job_path":"/en/jobs/3168936/ehs-specialist","job_schedule_type":"full-time","location":"US, PA, Jessup","locations":["{\"normalizedStateName\":\"Pennsylvania\",\"normalizedCountryCode\":\"USA\",\"city\":\"Jessup\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, PA, Jessup\",\"coordinates\":\"41.4699,-75.56049\",\"normalizedCountyName\":\"Lackawanna\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Jessup, Pennsylvania, USA\",\"location\":\"US, PA, Jessup\",\"region\":\"PA\",\"buildingCodeList\":[\"AVP9\"],\"normalizedCityName\":\"Jessup\"}"],"normalized_location":"Jessup, Pennsylvania, USA","optional_search_labels":[],"posted_date":"January 28, 2026","preferred_qualifications":"- Bachelor’s degree or higher, preferably in a safety related field\u003cbr/\u003e- Strong communication, teamwork, analysis, judgment, and customer focus skills\u003cbr/\u003e- Experience leading and managing a team, ability to analyze accident data, new processes, and machinery for potential safety concerns, and conduct job hazard and job safety analyses\u003cbr/\u003e- Experience in emergency response and currently holds First Aid and CPR certificates\u003cbr/\u003e- Experience in workers compensation case management\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, PA, Jessup - 27.00 - 33.00 USD hourly","primary_search_label":"fulfillment-and-operations.team-global-ehs","source_system":"JobCreator","state":"PA","title":"EHS Specialist","university_job":null,"updated_time":"12 minutes","url_next_step":"https://account.amazon.com/jobs/3168936/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-global-ehs","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- High School diploma or equivalent\u003cbr/\u003e- 1+ years in a high traceability manufacturing environment, or relevant trade school certification\u003cbr/\u003e- 1+ years of hand tools experience (i.e., Calipers, multi-meters, torque wrenches)\u003cbr/\u003e- 1+ years working with test tools and test methods that adequately validate the system","business_category":"alexa-and-amazon-devices","city":"Kirkland","company_name":"Amazon Kuiper Manufacturing Enterprises LLC - M90","country_code":"USA","description":"Amazon Leo is Amazon's low Earth orbit satellite network. Our mission is to deliver fast, reliable internet connectivity to customers beyond the reach of existing networks. From individual households to schools, hospitals, businesses, and government agencies, Amazon Leo will serve people and organizations operating in locations without reliable connectivity.\u003cbr/\u003e\u003cbr/\u003eOne of the most ambitious missions that Leo has undertaken to date, the Leo satellite constellation, is our solution to providing reliable internet. We are looking for talented technicians to help full-scale production of the Leo satellites.\u003cbr/\u003e\u003cbr/\u003eThe success of Leo depends on the quality, reliability, cost, manufacturability, throughput, and security of the products that you deliver. If you seek a fast-paced, dynamic environment; if you thrive on solving difficult problems where resolutions have high impact; and if you love the challenge of building something from scratch, then this role will be an ideal next career step. To be successful you need to be highly motivated and detail oriented while showing the highest standards of execution.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Champion safety requirements in all designated zones and work locations\u003cbr/\u003e- Assemble and test with emphasis to detail, an assortment of avionic LRUs, electrical-mechanical assemblies, handle and install fiber-optics, and PCBAs\u003cbr/\u003e- Ensure lab equipment is maintained and calibrated\u003cbr/\u003e- Supports some preventative maintenance activities on test equipment and data acquisition systems\u003cbr/\u003e- Identify equipment requirements, process improvements, maintain floor stock inventory\u003cbr/\u003e- You will independently execute and prioritize work to meet company deliverables\u003cbr/\u003e- Execute test procedures for component and system level testing maintenance\u003cbr/\u003e- Receive shipments and coordinate deliveries with recipients (Using pallet jacks, kit carts, etc)\u003cbr/\u003e- Your work may include contributing to improving SOPs and safety procedures\u003cbr/\u003e\u003cbr/\u003eCandidates must be 18 years or older with the ability to understand and adhere to all job requirements and safety guidelines.\u003cbr/\u003e\u003cbr/\u003eSecond Shift Schedule: 4 /10s  Sun-Wednesday 5pm-3:30pm\u003cbr/\u003e\u003cbr/\u003eThe starting pay for this role in Washington State is up to $33.50/hour and employees are eligible for incremental raises based on tenure. A full range of medical, financial, and/or other benefits are provided. This information is provided per the Washington State Pay Transparency Act. Base pay information is based on market location. Applicants should apply via Amazon's internal or external careers site.\u003cbr/\u003e\u003cbr/\u003eExport Control Requirement:\u003cbr/\u003eDue to applicable export control laws and regulations, candidates must be a U.S. citizen or national, U.S. permanent resident (i.e., current Green Card holder), or lawfully admitted into the U.S. as a refugee or granted asylum.\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eWe are a group of Technicians with well over 20+ years of diverse skills and experience. Each team member brings in willingness to train and positive team energy. Some tasks you may be an individual contributor, but may also work in a group environment to achieve organizational goals. This group of Technicians thrived in success by working as a team. We are currently in research and development but moving towards production environment.","department_cost_center":null,"description_short":"Amazon Leo is Amazon's low Earth orbit satellite network. Our mission is to deliver fast, reliable internet connectivity to customers beyond the reach of existing networks. From individual households to","display_distance":null,"id":"a5a4f104-6302-46d2-afb0-c96e889a2e16","id_icims":"3159626","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Manufacturing","job_function_id":null,"job_path":"/en/jobs/3159626/manufacturing-assembly-technician-ii-2nd-shift-amazon-leo","job_schedule_type":"full-time","location":"US, WA, Kirkland","locations":["{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Kirkland\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Kirkland\",\"coordinates\":\"47.67887,-122.2066\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Kirkland, Washington, USA\",\"location\":\"US, WA, Kirkland\",\"region\":\"WA\",\"buildingCodeList\":[\"ONM233\",\"SEA11\",\"ZKL2\",\"METR6\",\"SEA133\",\"ATBP16\",\"LSE2\",\"ONM129\",\"JSE7\",\"PAE33\",\"ONM235\",\"UWA1\",\"WFM655\"],\"normalizedCityName\":\"Kirkland\"}"],"normalized_location":"Kirkland, Washington, USA","optional_search_labels":["devices-services.kuiper-prod-ops"],"posted_date":"January 14, 2026","preferred_qualifications":"- Aircraft \u0026 Powerplant (A\u0026P) certification/license Prior telecom (fiber optics) experience a plus\u003cbr/\u003e- CFOT certification or equivalent experience\u003cbr/\u003e- Airman or Avionic certification or equivalent experience -ASE certification or equivalent experience\u003cbr/\u003e- Experience in fast-paced production environment with flight hardware\u003cbr/\u003e- Ability to use precision measuring instruments\u003cbr/\u003e- 1+ years able to read, interpret and work from engineering documentation and/ or drawings\u003cbr/\u003e- Experience working with FOD, ESD sensitive hardware and clean room requirements\u003cbr/\u003e- 1+ years of Electro-Mechanical Assembly, Final Integration and/or Harness Integration experience\u003cbr/\u003e- Ability to work effectively in a team environment\u003cbr/\u003e- Ability to rapidly change roles/responsibilities while working in a high-paced, challenging work environment\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003eThe starting pay for this position is listed below including the base pay rate plus the highest available shift differential which applies depending on the shift you select. As a total compensation company, you are eligible for additional earnings including overtime pay and performance bonuses. Final pay will be based on factors including shift selection and location. Starting Day 1 of employment, Amazon offers EAP, Mental Health Support, Medical Advice Line, 401(k) matching. Learn more about our benefits at \u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://hiring.amazon.com/why-amazon/benefits\"\u003ehttps://hiring.amazon.com/why-amazon/benefits\u003c/a\u003e.\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, WA, Kirkland - 33.00 - 36.00 USD hourly","primary_search_label":"alexa-and-amazon-devices.team-project-kuiper","source_system":"JobCreator","state":"WA","title":"Manufacturing Assembly Technician II (2nd Shift), Amazon Leo","university_job":null,"updated_time":"12 minutes","url_next_step":"https://account.amazon.com/jobs/3159626/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-project-kuiper","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- High School diploma or equivalent\u003cbr/\u003e- 1+ years in a high traceability manufacturing environment, or relevant trade school certification\u003cbr/\u003e- 1+ years of hand tools experience (i.e., Calipers, multi-meters, torque wrenches)\u003cbr/\u003e- 1+ years working with test tools and test methods that adequately validate the system","business_category":"alexa-and-amazon-devices","city":"Kirkland","company_name":"Amazon Kuiper Manufacturing Enterprises LLC - M90","country_code":"USA","description":"Amazon Leo is Amazon's low Earth orbit satellite network. Our mission is to deliver fast, reliable internet connectivity to customers beyond the reach of existing networks. From individual households to schools, hospitals, businesses, and government agencies, Amazon Leo will serve people and organizations operating in locations without reliable connectivity.\u003cbr/\u003e\u003cbr/\u003eOne of the most ambitious missions that Leo has undertaken to date, the Leo satellite constellation, is our solution to providing reliable internet. We are looking for talented technicians to help full-scale production of the Leo satellites.\u003cbr/\u003e\u003cbr/\u003eThe success of Leo depends on the quality, reliability, cost, manufacturability, throughput, and security of the products that you deliver. If you seek a fast-paced, dynamic environment; if you thrive on solving difficult problems where resolutions have high impact; and if you love the challenge of building something from scratch, then this role will be an ideal next career step. To be successful you need to be highly motivated and detail oriented while showing the highest standards of execution.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Champion safety requirements in all designated zones and work locations\u003cbr/\u003e- Assemble and test with emphasis to detail, an assortment of avionic LRUs, electrical-mechanical assemblies, handle and install fiber-optics, and PCBAs\u003cbr/\u003e- Ensure lab equipment is maintained and calibrated\u003cbr/\u003e- Supports some preventative maintenance activities on test equipment and data acquisition systems\u003cbr/\u003e- Identify equipment requirements, process improvements, maintain floor stock inventory\u003cbr/\u003e- You will independently execute and prioritize work to meet company deliverables\u003cbr/\u003e- Execute test procedures for component and system level testing maintenance\u003cbr/\u003e- Receive shipments and coordinate deliveries with recipients (Using pallet jacks, kit carts, etc)\u003cbr/\u003e- Your work may include contributing to improving SOPs and safety procedures\u003cbr/\u003e\u003cbr/\u003eCandidates must be 18 years or older with the ability to understand and adhere to all job requirements and safety guidelines.\u003cbr/\u003e\u003cbr/\u003eSecond Shift Schedule: 4 /10s  Sun-Wednesday 5pm-3:30pm\u003cbr/\u003e\u003cbr/\u003eThe starting pay for this role in Washington State is up to $33.50/hour and employees are eligible for incremental raises based on tenure. A full range of medical, financial, and/or other benefits are provided. This information is provided per the Washington State Pay Transparency Act. Base pay information is based on market location. Applicants should apply via Amazon's internal or external careers site.\u003cbr/\u003e\u003cbr/\u003eExport Control Requirement:\u003cbr/\u003eDue to applicable export control laws and regulations, candidates must be a U.S. citizen or national, U.S. permanent resident (i.e., current Green Card holder), or lawfully admitted into the U.S. as a refugee or granted asylum.\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eWe are a group of Technicians with well over 20+ years of diverse skills and experience. Each team member brings in willingness to train and positive team energy. Some tasks you may be an individual contributor, but may also work in a group environment to achieve organizational goals. This group of Technicians thrived in success by working as a team. We are currently in research and development but moving towards production environment.","department_cost_center":null,"description_short":"Amazon Leo is Amazon's low Earth orbit satellite network. Our mission is to deliver fast, reliable internet connectivity to customers beyond the reach of existing networks. From individual households to","display_distance":null,"id":"7371e832-5128-406b-a910-b5f7d5c43868","id_icims":"3159559","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Manufacturing","job_function_id":null,"job_path":"/en/jobs/3159559/manufacturing-assembly-technician-ii-2nd-shift-amazon-leo","job_schedule_type":"full-time","location":"US, WA, Kirkland","locations":["{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Kirkland\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Kirkland\",\"coordinates\":\"47.67887,-122.2066\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Kirkland, Washington, USA\",\"location\":\"US, WA, Kirkland\",\"region\":\"WA\",\"buildingCodeList\":[\"ONM233\",\"SEA11\",\"ZKL2\",\"METR6\",\"SEA133\",\"ATBP16\",\"LSE2\",\"ONM129\",\"JSE7\",\"PAE33\",\"ONM235\",\"UWA1\",\"WFM655\"],\"normalizedCityName\":\"Kirkland\"}"],"normalized_location":"Kirkland, Washington, USA","optional_search_labels":["devices-services.kuiper-prod-ops"],"posted_date":"January 14, 2026","preferred_qualifications":"- Aircraft \u0026 Powerplant (A\u0026P) certification/license Prior telecom (fiber optics) experience a plus\u003cbr/\u003e- CFOT certification or equivalent experience\u003cbr/\u003e- Airman or Avionic certification or equivalent experience -ASE certification or equivalent experience\u003cbr/\u003e- Experience in fast-paced production environment with flight hardware\u003cbr/\u003e- Ability to use precision measuring instruments\u003cbr/\u003e- 1+ years able to read, interpret and work from engineering documentation and/ or drawings\u003cbr/\u003e- Experience working with FOD, ESD sensitive hardware and clean room requirements\u003cbr/\u003e- 1+ years of Electro-Mechanical Assembly, Final Integration and/or Harness Integration experience\u003cbr/\u003e- Ability to work effectively in a team environment\u003cbr/\u003e- Ability to rapidly change roles/responsibilities while working in a high-paced, challenging work environment\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003eThe starting pay for this position is listed below including the base pay rate plus the highest available shift differential which applies depending on the shift you select. As a total compensation company, you are eligible for additional earnings including overtime pay and performance bonuses. Final pay will be based on factors including shift selection and location. Starting Day 1 of employment, Amazon offers EAP, Mental Health Support, Medical Advice Line, 401(k) matching. Learn more about our benefits at \u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://hiring.amazon.com/why-amazon/benefits\"\u003ehttps://hiring.amazon.com/why-amazon/benefits\u003c/a\u003e.\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, WA, Kirkland - 33.00 - 36.00 USD hourly","primary_search_label":"alexa-and-amazon-devices.team-project-kuiper","source_system":"JobCreator","state":"WA","title":"Manufacturing Assembly Technician II (2nd Shift), Amazon Leo","university_job":null,"updated_time":"12 minutes","url_next_step":"https://account.amazon.com/jobs/3159559/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-project-kuiper","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}}],"job_posting_search_request":"{\"jobPostingSearchRequest\":{\"query\":\"\",\"excludeFacets\":[{\"name\":\"businessCategory\",\"values\":[{\"name\":\"a-confidential-job\"}]},{\"name\":\"isPostedExternally\",\"values\":[{\"name\":\"0\"}]},{\"name\":\"isUnsearchable\",\"values\":[{\"name\":\"1\"}]}],\"filterFacets\":[],\"start\":0,\"size\":10,\"sort\":{\"sortOrder\":\"DESCENDING\",\"sortType\":\"SCORE\"},\"location\":null,\"accessLevel\":\"EXTERNAL\",\"includeFacets\":[],\"locationFacets\":[],\"jobTypeFacets\":[],\"contentFilterFacets\":[],\"treatment\":\"OM\"}}"}