{"error":null,"hits":10000,"facets":{},"content":{"sidebar":{},"search_results":{}},"jobs":[{"basic_qualifications":"- High school or equivalent diploma\u003cbr/\u003e- Are 18 years of age or older\u003cbr/\u003e- 1+ years retail or customer-facing, or 1+ years floor leader or other  leadership, or 1+ years Amazon (Blue Badge/FTE) experience","business_category":"fulfillment-ops","city":"Middletown","company_name":"Prime Now LLC - E78","country_code":"USA","description":"Pay starts at $19.15 per hour with benefits available.\u003cbr/\u003e\u003cbr/\u003eReduced Time Hours: Average work between 30-39 hrs per week. \u003cbr/\u003e\u003cbr/\u003e\u003cspan style=\"font-style: italic;\"\u003eThis role requires open availability Tuesday-Saturday between 2:45pm and 9:15pm.\u003c/span\u003e\u003cbr/\u003e\u003cbr/\u003eAs a Retail Lead Associate, you will be the face of Amazon and contribute to the culture based on customer obsession, trust, respect, integrity, continuous learning, and fun. You possess strong attention to detail, the ability to quickly prioritize tasks, the willingness to learn new things, and a commitment to delighting our customers. You will assist with customer service operations and floor leader responsibilities.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Interact with customers by effectively using customer engagement strategies and model desired behavior for the rest of the team.\u003cbr/\u003e- Utilize inventory management systems to scan, process, and count product.\u003cbr/\u003e- Provide peer-to-peer feedback on processes and standards, serving as the escalation point to assist associate peers in solving customer issues, where appropriate.\u003cbr/\u003e- Contribute to continuous improvement of the customer experience and operations by participating in the development of best practices.\u003cbr/\u003e- Help identify and communicate barriers and trends that contribute to the customer and associate experience and support the manager in building a strong site culture.\u003cbr/\u003e- Work with a manager to maintain the physical safety and quality standards of the site.\u003cbr/\u003e- Work in a fast changing and ambiguous environment.\u003cbr/\u003e- Perform additional duties, as assigned\u003cbr/\u003e- Work flexible hours including nights, weekends, and holidays.\u003cbr/\u003e- Lift up to 49 pounds, stand and walk during shifts lasting up to 12 hours, and frequently push, pull, squat, bend, and reach, as well as continuously climb and descend stairs.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eInterested in joining our dedicated team at Amazon that makes the return of pickup and packages convenient for our customers at our Locker+ retail locations? Curious to be at the heart of where innovation meets customer obsession? \u003cbr/\u003e\u003cbr/\u003eCustomer Experience Operations (CXO) is an exciting organization within Amazon specializing in delighting our customers with quality service in an ever-changing environment. Our goal is to go beyond assisting with customer orders. We strive to connect personally with our customers and uplift their lives – even if for just a few moments. We operate out of designated retail locations – where it’s convenient for our customers – helping facilitate the delivery and return of customer orders.","department_cost_center":null,"description_short":"Pay starts at $19.15 per hour with benefits available.Reduced Time Hours: Average work between 30-39 hrs per week. This role requires open availability Tuesday-Saturday between 2:45pm and 9:15pm.As a Retail","display_distance":null,"id":"15edc309-d9ac-4b07-9681-89cb2cb0af27","id_icims":"3116803","is_intern":null,"is_manager":null,"job_category":"Fulfillment \u0026 Operations Management","job_family":"Physical Retail Store","job_function_id":null,"job_path":"/en/jobs/3116803/retail-lead-associate-reduced-time-customer-experience-operations","job_schedule_type":"part-time","location":"US, NJ, Middletown","locations":["{\"normalizedStateName\":\"New Jersey\",\"normalizedCountryCode\":\"USA\",\"city\":\"Middletown\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, NJ, Middletown\",\"coordinates\":\"40.40533,-74.12756\",\"normalizedCountyName\":\"Monmouth\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Middletown, New Jersey, USA\",\"location\":\"US, NJ, Middletown\",\"region\":\"NJ\",\"buildingCodeList\":[\"LMID\"],\"normalizedCityName\":\"Middletown\"}"],"normalized_location":"Middletown, New Jersey, USA","optional_search_labels":[],"posted_date":"October 28, 2025","preferred_qualifications":"- Experience in training others\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003eThe starting pay for this position is listed below including the base pay rate plus the highest available shift differential which applies depending on the shift you select. As a total compensation company, you are eligible for additional earnings including overtime pay and performance bonuses. Final pay will be based on factors including shift selection and location. Starting Day 1 of employment, Amazon offers EAP, Mental Health Support, Medical Advice Line, 401(k) matching. Learn more about our benefits at \u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://hiring.amazon.com/why-amazon/benefits\"\u003ehttps://hiring.amazon.com/why-amazon/benefits\u003c/a\u003e.\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, NJ, Middletown - 19.00 - 19.00 USD hourly","primary_search_label":"fulfillment-ops.team-global-specialty-fulfillment","source_system":"JobCreator","state":"NJ","title":"Retail Lead Associate (Reduced-Time), Customer Experience Operations","university_job":null,"updated_time":"2 minutes","url_next_step":"https://account.amazon.com/jobs/3116803/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-global-specialty-fulfillment","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Bachelor's degree in Engineering, Business Administration, Logistics, or related fields;\u003cbr/\u003e- Ability to multitask, managing multiple collection partners simultaneously with attention to station details;\u003cbr/\u003e- Availability to work flexible shifts including weekends and holidays;\u003cbr/\u003e- MS Office proficiency, with intermediate level Excel skills (vlookup, advanced formulas, pivot tables, macros);\u003cbr/\u003e- Excellent Communication skills - dealing with carriers as stakeholders/clients;\u003cbr/\u003e- Fluent Portuguese;\u003cbr/\u003e- Experience in Logistics and Transportation.\u003cbr/\u003e- Travel up to 15% of the time","business_category":"transportation-and-logistics","city":"Ribeirao Preto","company_name":"Amazon Logistica do Brasil","country_code":"BRA","description":"Nossas equipes de logística estão mudando a maneira como interagimos com clientes em todo o mundo todos os dias e resolvendo alguns dos maiores desafios logísticos enfrentados não apenas pela Amazon, mas também por toda a indústria.\u003cbr/\u003eSejam itens grandes ou pequenos, encontramos soluções para garantir que estamos cumprindo nossa promessa para os clientes. \u003cbr/\u003e\u003cbr/\u003eA equipe da Amazon Logistics Brasil (AMZL) está procurando uma pessoa Analista de Operações Logísticas para se juntar ao time de EDSP (External Delivery Service Providers), ou seja, as estações de entrega da AMZL operadas por parceiros. Essa pessoa irá atuar como Torre de Controle para essas operações operadas por parceiros. As operações serão feitas 7 dias por semana, incluindo feriados; portanto, os Analistas de Operações Logísticas são todos em escala 4x3, separados entre equipe front e back. \u003cbr/\u003e\u003cbr/\u003eEssa pessoa atuará na gestão de estações de entrega dos parceiros logísticos externos para garantir o desempenho e conformidade dos processos desses parceiros. Trabalhará em um ambiente altamente colaborativo que é mais próximo de uma start-up do que uma grande empresa. A atitude adotada é que nenhuma ideia é uma má ideia e as melhores ideias são aquelas que devem ser testadas e experimentadas. \u003cbr/\u003eEssa pessoa precisará prosperar e entregar resultados em um ambiente ambíguo, rápido e dinâmico. Parte de suas funções poderão ser realizadas virtualmente, como também auditoria /visitas aos parceiros logísticos in loco.\u003cbr/\u003eNossa cultura inclusiva capacita os Amazonians a oferecer os melhores resultados para nossos clientes. Não celebramos apenas a diversidade de nossa força de trabalho, celebramos as diversas formas como trabalhamos. Se você quiser solicitar uma acomodação para a entrevista ou o processo de integração, avise seu recrutador e ele o conectará à nossa equipe de acomodação.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Monitorar diariamente o funcionamento eficiente dos parceiros logísticos, sugerir e implantar melhorias;\u003cbr/\u003e- Criar e acompanhar métricas operacionais com os parceiros logísticos;\u003cbr/\u003e- Analisar dados de várias fontes e identificar tendências relevantes para que, a partir deles, decisões rápidas e importantes ao negócio sejam tomadas;\u003cbr/\u003e- Encontrar soluções práticas e simples para problemas complexos;\u003cbr/\u003e- Servir de elo entre os stakeholders internos e externos tendo em vista os objetivos, limites, conformidade e privacidade das informações;\u003cbr/\u003e- Mergulhar profundamente nas causas raízes dos problemas operacionais.\u003cbr/\u003e","department_cost_center":null,"description_short":"Nossas equipes de logística estão mudando a maneira como interagimos com clientes em todo o mundo todos os dias e resolvendo alguns dos maiores desafios logísticos enfrentados não apenas pela Amazon, mas","display_distance":null,"id":"0339a930-a1e8-4218-92f9-d2d061f5d65d","id_icims":"3174020","is_intern":null,"is_manager":null,"job_category":"Supply Chain/Transportation Management","job_family":"Fulfillment Center","job_function_id":null,"job_path":"/en/jobs/3174020/analista-operacoes-logisticas-amzl","job_schedule_type":"full-time","location":"BR, Ribeirao Preto","locations":["{\"normalizedStateName\":\"Sao Paulo\",\"normalizedCountryCode\":\"BRA\",\"city\":\"Ribeirao Preto\",\"countryIso3a\":\"BRA\",\"countryIso2a\":\"BR\",\"locationNonStemming\":\"Brazil, Ribeirao Preto\",\"coordinates\":\"-21.177,-47.8078\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Brazil\",\"normalizedLocation\":\"Ribeirão Preto, Sao Paulo, BRA\",\"location\":\"BR, Ribeirao Preto\",\"region\":\"\",\"buildingCodeList\":[\"SRP9\"],\"normalizedCityName\":\"Ribeirão Preto\"}"],"normalized_location":"Ribeirão Preto, Sao Paulo, BRA","optional_search_labels":[],"posted_date":"February  5, 2026","preferred_qualifications":"- 1+ years of logistics, transportation, supply chain, import/export operations, or data entry/data administration experience\u003cbr/\u003e- Inglês avançado.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"transportation-and-logistics.team-amzl","source_system":"JobCreator","state":null,"title":"Analista Operações Logísticas, AMZL","university_job":null,"updated_time":"8 minutes","url_next_step":"https://account.amazon.com/jobs/3174020/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-amzl","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 2+ years of computer hardware troubleshooting and repair experience\u003cbr/\u003e- 1+ years of computer networking experience\u003cbr/\u003e- High school or equivalent diploma","business_category":"aws","city":"Mumbai","company_name":"ADSIPL - Maharashtra - E22","country_code":"IND","description":"AWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help.\u003cbr/\u003e\u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion.\u003cbr/\u003e\u003cbr/\u003eData Center Operations designs, installs \u0026 maintains the world’s largest Cloud Computing Infrastructure. We are looking for skilled Data Centre Linux \u0026 HW Engineer at Amazon Data Services India Private Limited (“ADSIPL”) with a passion for technology to help us expand AWS Cloud offerings to the next level.\u003cbr/\u003e\u003cbr/\u003eADSIPL offers an exciting, dynamic and challenging environment encouraging creativity and personal development while maintaining AWS computing environments in a secure, scalable, and cost-effective manner.\u003cbr/\u003e\u003cbr/\u003eAt ADSIPL, career progression is part of our environment. We want you to progress. If your career path is in Systems, Network or Database Engineering, Software Development or maybe AWS Support, Technical Operations or perhaps Project Management, we will create a development plan to enable you to succeed reaching those goals. This begins on Day One! \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eA Data Centre Operation Technician at ADSIPL may be the primary point of contact for both internal customers (for example: Network Engineers, Systems Engineers, Software Developers, Database Engineers, Technical Operations) and external customers (Hardware Vendors, Contractors, Service Providers among others).\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eA Data Centre Operation Technician at ADSIPL, expectation from role are:\u003cbr/\u003e\u003cbr/\u003e• You work as part of the Operations team, whose primary responsibility is the maintenance and upkeep of the data center infrastructure.\u003cbr/\u003e• your role and responsibilities include, but are not limited to, server rack installation, hardware break-fix on various components, troubleshooting network issues also responding to emergent situations that affect operational stability.\u003cbr/\u003e• You may be the primary contact point for both internal customers (for example: Network Engineers, Systems Engineers, Software Developers, Technical Operations) and external service partners (Hardware Vendors, Contractors, Service Providers among others).\u003cbr/\u003e• You will work and meet SLAs against assigned trouble tickets via a directed workflow, be the first line touch point for hardware troubleshooting and technical issues.\u003cbr/\u003e• You perform on-call duties and will participate in Data Center operations, handling scheduled maintenance and change management activities that require monitoring of the data center infrastructure.\u003cbr/\u003e• You participate in team meetings for metric analysis and to discuss achieving daily/weekly goals.\u003cbr/\u003e• You possess knowledge of the policies and procedures, including safety and security, within your department, and understand the appropriate application of such knowledge\u003cbr/\u003e• You contribute to documentation on technical issues through root cause analysis for operational issues that occur, and contribute to process improvement initiatives relevant to the data center environment.\u003cbr/\u003e• More experienced technicians may assist in training less experienced members of the team.\u003cbr/\u003e* This position also has a physical component requiring the ability to lift \u0026 rack equipment up to 20kg; it may require working in cramped spaces or in elevated locations while adhering to health \u0026 safety guidelines.\u003cbr/\u003e* This role involves covering 24x7 shift rotation \u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eYou will support DC (Data Center) infrastructure equipment (e.g. racks, servers, networking devices, hardware components, cables, etc.),\u003cbr/\u003e• You will follow the instructions ticket-based environment and work on systematic problem resolution and perform routine operation activities on hardware, or spare parts, including rack install, server break/fix, rack decom etc.\u003cbr/\u003e• You will perform on-call duties and will participate in Data Center operations, handling scheduled maintenance and change management activities that require monitoring of the data center infrastructure.\u003cbr/\u003e• Show a strong aptitude for troubleshooting and problem solving\u003cbr/\u003e• You will be involved with site management and maintain tidiness in operation areas\u003cbr/\u003e• Your role also has a physical component requiring the ability to lift \u0026 rack equipment up to 20kg; it may require working in cramped spaces or in elevated locations while adhering to health \u0026 safety guidelines.\u003cbr/\u003e• Your role involves covering 24x7 shift rotation \u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eDiverse Experiences\u003cbr/\u003eAmazon values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.\u003cbr/\u003e\u003cbr/\u003eWhy AWS\u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003eWork/Life Balance\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve.\u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture\u003cbr/\u003eAWS values curiosity and connection. Our employee-led and company-sponsored affinity groups promote inclusion and empower our people to take pride in what makes us unique. Our inclusion events foster stronger, more collaborative teams. Our continual innovation is fueled by the bold ideas, fresh perspectives, and passionate voices our teams bring to everything we do.\u003cbr/\u003e\u003cbr/\u003eMentorship and Career Growth\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional.","department_cost_center":null,"description_short":"AWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers","display_distance":null,"id":"64185bf9-2adf-418c-b205-84f3d37e7962","id_icims":"3176596","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Data Center Operations","job_function_id":null,"job_path":"/en/jobs/3176596/data-center-technician-dco-data-center-operations-dco","job_schedule_type":"full-time","location":"IN, MH, Mumbai","locations":["{\"normalizedStateName\":\"Maharashtra\",\"normalizedCountryCode\":\"IND\",\"city\":\"Mumbai\",\"countryIso3a\":\"IND\",\"countryIso2a\":\"IN\",\"locationNonStemming\":\"India, MH, Mumbai\",\"coordinates\":\"18.94018,72.83484\",\"normalizedCountyName\":\"Mumbai\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"India\",\"normalizedLocation\":\"Mumbai, Maharashtra, IND\",\"location\":\"IN, MH, Mumbai\",\"region\":\"MH\",\"buildingCodeList\":[\"BOM61\",\"BOM920\",\"UBMD\",\"BOM89\",\"UBOA\",\"IRDM\",\"CBO1\",\"QWNS\",\"TMO6\",\"FBOK\",\"ISK1\",\"YWCS\",\"BOM44\",\"SBOG\",\"BOM148\",\"TMF5\",\"TMQ3\",\"XWAA\",\"KWC7\",\"PBO8\",\"TMR9\",\"YWCH\",\"YWTH\",\"BOM170\",\"BOM73\",\"BOM119\",\"FMPA\",\"XBLM\",\"PBOC\",\"QWUW\",\"UBO2\",\"YWCD\",\"TME3\",\"BOM107\",\"QWVN\",\"QWAI\",\"TMA5\",\"BOM56\",\"TMA9\",\"YEYB\",\"TMP8\",\"TML3\",\"UPNO\",\"BOM82\",\"TMF9\",\"BOM85\",\"TMH2\",\"YWSX\",\"TMK1\",\"BOM136\",\"FBO5\",\"BOM120\",\"BOM262\",\"TMQ7\",\"KWBD\",\"TMO2\",\"UB093\",\"YWTA\",\"HMH9\",\"TME6\",\"QWAE\",\"TMN8\",\"BOM112\",\"TMJ3\",\"YZZ7\",\"BOM157\",\"HMH8\",\"YWTL\",\"TMG3\",\"YWT5\",\"BOM40\",\"SBON\",\"TMJ2\",\"PBO4\",\"TMB7\",\"FBOD\",\"YEVV\",\"TMH9\",\"TMS4\",\"BOM65\",\"RWRP\",\"BOM132\",\"LBO1\",\"YWW4\",\"YEYC\",\"FBOC\",\"BOM263\",\"BOM64\",\"QWND\",\"BOM254\",\"TMR5\",\"BOM141\",\"HMH1\",\"PBO5\",\"TMQ6\",\"UPNK\",\"IRDU\",\"MUM86\",\"TMN7\",\"BOM74\",\"QWUS\",\"BOM128\",\"TMG4\",\"YWTG\",\"BOM135\",\"TNA49\",\"TMK2\",\"FBO4\",\"UBOX\",\"TMR8\",\"REBZ\",\"KWDR\",\"BOM45\",\"YWCG\",\"BOT2\",\"VABC\",\"PBO7\",\"YWCE\",\"TMR6\",\"BOM253\",\"YEX8\",\"TMA6\",\"YWT1\",\"KWC8\",\"BOM76\",\"UBMC\",\"TMF4\",\"YWSY\",\"BOM78\",\"TME9\",\"BOM171\",\"XWKK\",\"TMS3\",\"TME4\",\"YWTI\",\"BOM123\",\"HBM5\",\"KWDI\",\"BOM41\",\"TMJ7\",\"FBON\",\"MUM88\",\"FWMU\",\"TMH5\",\"BOM66\",\"YWT3\",\"YWT6\",\"FBO2\",\"PBO9\",\"KWBA\",\"UBO5\",\"TMH7\",\"RWVS\",\"BOM53\",\"FBOE\",\"TME7\",\"TMR1\",\"IRXU\",\"TMJ5\",\"TMB4\",\"TMR3\",\"UBOH\",\"TMQ8\",\"BOM68\",\"FBOG\",\"YEYA\",\"YWTK\",\"BOM2\",\"HBO3\",\"SBO3\",\"RWVQ\",\"BOM258\",\"IABB\",\"BOM81\",\"MULC\",\"TMG2\",\"IRDQ\",\"BOM143\",\"BOLT1\",\"BOM51\",\"QWAH\",\"BWN40\",\"YWT8\",\"YWTD\",\"UBOC\",\"BOM115\",\"YEW5\",\"SBOP\",\"TMB9\",\"TMO3\",\"QWUV\",\"UBO7\",\"BOM86\",\"QWAM\",\"TMF2\",\"SBOD\",\"HMV4\",\"UPNN\",\"BOM96\",\"TME2\",\"TMG7\",\"IRDX\",\"BOM71\",\"FBOL\",\"QWQL\",\"TMA4\",\"MUM83\",\"HMH3\",\"VABB\",\"YWSZ\",\"BBG401\",\"TMG9\",\"YWCF\",\"BOM92\",\"IRDZ\",\"BOM13\",\"TME1\",\"PBOE\",\"RWS6\",\"KELR\",\"QWAV\",\"MUM85\",\"TMR7\",\"RWVZ\",\"BOM30\",\"BOM75\",\"TMJ8\",\"FBOM\",\"TMK3\",\"FBO3\",\"QWUN\",\"TMQ5\",\"FBOB\",\"YWTF\",\"MBOA\",\"TMF7\",\"QWUU\",\"IRYP\",\"CVP1\",\"ISK3\",\"BOM146\",\"HBM4\",\"BOM110\",\"TMJ1\",\"UBOJ\",\"LMH6\",\"BOM129\",\"HDE7\",\"KWDU\",\"BOM256\",\"BOM117\",\"TMF3\",\"BOM259\",\"UBMB\",\"BOM63\",\"YWT0\",\"TMQ1\",\"PBO6\",\"TMB2\",\"UPN7\",\"BOX2\",\"HBA4\",\"BOM1\",\"HBO4\",\"BCT40\",\"TMB6\",\"TMS6\",\"UBOG\",\"TMS5\",\"BOM130\",\"TMJ4\",\"BOM83\",\"YWTB\",\"YWCB\",\"YWT4\",\"MMC94\",\"HMH7\",\"RWJZ\",\"TMP7\",\"BOM79\",\"TMG5\",\"UPN3\",\"BOM255\",\"BOM84\",\"BOM54\",\"BOM108\",\"TMH4\",\"BOM138\",\"RWS2\",\"HMU1\",\"KWBB\",\"YWCI\",\"YEY1\",\"BOM55\",\"HMU2\",\"YWCC\",\"QWVM\",\"BOM264\",\"UBO40\",\"QWQI\",\"BOM122\",\"BOM131\",\"TME5\",\"TML2\",\"BOM109\",\"MMC41\",\"QWAD\",\"BOM147\",\"TMJ9\",\"BOM99\",\"TMA7\",\"TMH1\",\"PBOD\",\"KWCC\",\"MUM84\",\"BOM149\",\"TMA8\",\"FMPB\",\"HMV3\",\"BOM60\",\"BOM118\",\"FBOA\",\"IRDY\",\"BOM14\",\"TMO7\",\"BOM59\",\"YZZ2\",\"UBOB\",\"MUM41\",\"UBO3\",\"BOMD\",\"HMH4\",\"TML4\",\"TMQ2\",\"XWAB\",\"MMC86\",\"RWS7\",\"QWUZ\",\"TMH3\",\"TMG8\",\"BOM62\",\"BOM72\",\"TMG6\",\"TNA40\",\"HMV5\",\"BOM50\",\"RWVW\",\"IRDP\",\"UBOD\",\"ISK2\",\"RWS3\",\"FBOH\",\"PBOB\",\"YWTE\",\"RWW1\",\"TMR4\",\"UBOZ\",\"UNDI\",\"BOM111\",\"BOM142\",\"BOM114\",\"BOM139\",\"QWAL\",\"TMF6\",\"YWWA\",\"BOM69\",\"TMK4\",\"MMC93\",\"TMQ4\",\"MUM94\",\"TBC153\",\"YWC8\",\"TMB5\",\"BOM22\",\"TMQ9\",\"TMR2\",\"YWCA\",\"BOM260\",\"KWBE\",\"HMU5\",\"RWS0\",\"TMN9\",\"KWDL\",\"BOM52\",\"BOM97\",\"TMH8\",\"GUS9\",\"KWB9\",\"BOM49\",\"YWCK\",\"RWRY\",\"UBO1\",\"BOM70\",\"QWQK\",\"VANM\",\"YWTC\",\"UPNM\",\"YWT7\",\"YWW7\",\"TMS7\",\"TMH6\",\"BOM124\",\"TMO4\",\"YEVZ\",\"TMJ6\",\"TMF1\",\"UBOI\",\"BOM87\",\"BOM42\",\"BOM3\",\"TMF8\",\"TMB3\",\"YWT2\",\"QWAS\",\"TMS2\",\"IRDR\",\"BOM106\",\"TMG1\",\"TMP9\",\"QWUP\",\"QWAG\",\"TME8\",\"BOM144\",\"KES0\",\"RWSA\",\"YWTJ\",\"RWIX\",\"FBOF\"],\"normalizedCityName\":\"Mumbai\"}"],"normalized_location":"Mumbai, Maharashtra, IND","optional_search_labels":["aws.team-ais","aws.team-dc"],"posted_date":"February  9, 2026","preferred_qualifications":"- Experience dealing effectively with customers during problem resolution and operating efficiently under pressure\u003cbr/\u003e- Can lift and rack equipment up to 40 pounds\u003cbr/\u003e- Knowledge of fiber optic and copper cabling standards, testing equipment and troubleshooting methodologies\u003cbr/\u003e- Experience working in a colocation data center facility\u003cbr/\u003e- Experience in networking\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"aws.team-support-engineer-primary","source_system":"JobCreator","state":"MH","title":"Data Center Technician (DCO), Data Center Operations (DCO)","university_job":null,"updated_time":"9 minutes","url_next_step":"https://account.amazon.com/jobs/3176596/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-support-engineer-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Basic qualifications\u003cbr/\u003e- Possess a degree from an accredited institution,\u003cbr/\u003e- Previous experience in leading large, diverse teams,\u003cbr/\u003e- You possess excellent communication skills, both verbal and written,\u003cbr/\u003e- You’re competent in two or more production or supply chain areas, with an impressive track record in a similar, fast-paced logistics, distribution or manufacturing environment,\u003cbr/\u003e- You possess the ability to manage details, establish and carry out root cause analysis, and then extract and analyse the data you generate,\u003cbr/\u003e- You thrive on change, and are willing to relocate if necessary\u003cbr/\u003e- You have excellent written and spoken English\u003cbr/\u003e- Work shifts, including weekends, in an operational 7/365 environment.","business_category":"fulfillment-ops","city":"Jesi","company_name":"Amazon Italia Logistica S.R.L.","country_code":"ITA","description":"At Amazon, we pioneer.\r\u003cbr/\u003eWe also treat every day just like it’s day one. And we never sit still while we do it.   \r\u003cbr/\u003eAre you up for creating solutions and solving tomorrow’s problems today?\r\u003cbr/\u003e\r\u003cbr/\u003e\r\u003cbr/\u003eThen we have the opportunity for you!\r\u003cbr/\u003eWe’re seeking an experienced, Operations Manager to join our Customer Fulfillment team. You’ll operate out of one of our dynamic Fulfillment Centers: these sit at the heart of Amazon’s world-class, rapidly growing business. They’re where we manage our fast-moving inventory; they’re also where we developed our smart, industry-leading workflows. \r\u003cbr/\u003eAs an Operations Manager, you’ll deliver inspiring, supportive leadership for the teams you manage. But at the same time, you don’t shy away from rolling up your sleeves and getting involved whenever necessary.\r\u003cbr/\u003eYou’ll be directly responsible for managing a team of Area Managers and their direct reports: meanwhile, you will report to the Senior Operations Manager of your Fulfillment Center. The quality of your leadership is key to success in this role: you’ll motivate and inspire your teams to do their best work, while planning schedules and activities that balance their needs with that of the business.\r\u003cbr/\u003eAnother key aspect of your role will be to lead on numerous process improvement projects, with the aim of streamlining all activities, both for yourself and the team members you manage. The ideas, innovation and leaps out of the status quo that you come up with could very well be rolled out across the Amazon network: this immense opportunity is yours for the taking.\r\u003cbr/\u003e\r\u003cbr/\u003e\r\u003cbr/\u003eJob Description\r\u003cbr/\u003eYour role will be pivotal in the overall management, control, organisation and direction of either Outbound or Inbound operational areas of your FC. Your responsibilities will include, amongst others:\r\u003cbr/\u003e - Maintaining Health and Safety standards within your remit area, while promoting an inspiring Health and Safety culture on-site,\u003cbr/\u003e - Become a subject matter expert on specific, larger-scale processes and activities within FCs, such as 5S audits,\u003cbr/\u003e - In your inventory control and systems environment, you’ll manage timely data collection, updating operations metrics on an hourly basis,\u003cbr/\u003e - Therefore, you’ll aim to achieve productivity targets, reduce cost per unit, eliminate errors and ensure an excellent customer experience,\u003cbr/\u003e - Work closely with other support teams (HR, Finance, Facilities, Safety and Security, IT) on staffing plans, schedules and performance levels,\u003cbr/\u003e - Implement process change and contribute in cross-functional Six Sigma initiatives within your site and the broader Amazon EU Operations network,\u003cbr/\u003e \r\u003cbr/\u003e","department_cost_center":null,"description_short":"At Amazon, we pioneer.\rWe also treat every day just like it’s day one. And we never sit still while we do it.   \rAre you up for creating solutions and solving tomorrow’s problems today?\r\r\rThen we have","display_distance":null,"id":"ed01bbe3-8200-4e76-8d33-9dc543788eee","id_icims":"3160976","is_intern":null,"is_manager":null,"job_category":"Fulfillment \u0026 Operations Management","job_family":"Fulfillment Center","job_function_id":null,"job_path":"/en/jobs/3160976/operations-manager","job_schedule_type":"full-time","location":"IT, AN, Jesi","locations":["{\"normalizedStateName\":\"Marches\",\"normalizedCountryCode\":\"ITA\",\"city\":\"Jesi\",\"countryIso3a\":\"ITA\",\"countryIso2a\":\"IT\",\"locationNonStemming\":\"Italy, AN, Jesi\",\"coordinates\":\"43.5207,13.23808\",\"normalizedCountyName\":\"Ancona\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Italy\",\"normalizedLocation\":\"Jesi, Marches, ITA\",\"location\":\"IT, AN, Jesi\",\"region\":\"AN\",\"buildingCodeList\":[\"AOI1\"],\"normalizedCityName\":\"Jesi\"}"],"normalized_location":"Jesi, Marches, ITA","optional_search_labels":[],"posted_date":"January 16, 2026","preferred_qualifications":"- Preferred qualifications:\u003cbr/\u003e- Ideally degree qualified in Engineering or a Supply Chain/Logistics/ Manufacturing related discipline or MBA graduate.\u003cbr/\u003e- Knowledge of Lean, Six Sigma and Kaizen methodologies would be highly advantageous.\u003cbr/\u003e- What we offer We’ll expect you to go the extra mile, but we’ll also make sure you’re well rewarded. As well as a competitive salary, stock units and site performance-related pay potential, we offer a whole host of other benefits, including an employee discount. Amazon is an equal opportunities employer. We believe passionately that employing a diverse workforce is central to our success. We make recruiting decisions based on your experience and skills. We value your passion to discover, invent, simplify and build. Protecting your privacy and the security of your data is a longstanding top priority for Amazon. Please consult our Privacy Notice (\u003ca href=\"https://www.amazon.jobs/en/privacy_page\"\u003ehttps://www.amazon.jobs/en/privacy_page\u003c/a\u003e) to know more about how we collect, use and transfer the personal data of our candidates. Our inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunities employer. We believe passionately that employing a diverse workforce is central to our success. We make recruiting decisions based on your experience and skills. We value your passion to discover, invent, simplify and build. Protecting your privacy and the security of your data is a longstanding top priority for Amazon. Please consult our Privacy Notice (\u003ca href=\"https://www.amazon.jobs/en/privacy_page\"\u003ehttps://www.amazon.jobs/en/privacy_page\u003c/a\u003e) to know more about how we collect, use and transfer the personal data of our candidates.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"fulfillment-ops.team-global-specialty-fulfillment","source_system":"JobCreator","state":"AN","title":"Operations Manager ","university_job":null,"updated_time":"9 minutes","url_next_step":"https://account.amazon.com/jobs/3160976/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-global-specialty-fulfillment","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Manual handling experience as a logistics professional supporting inventory maintenance/cycle counts and inbound/outbound shipments processing","business_category":"aws","city":"Katrineholm","company_name":"Amazon Data Services Sweden AB","country_code":"SWE","description":"Job summary\u003cbr/\u003eBe a part of operating the world’s largest cloud computing infrastructure. Amazon Web Services is seeking a bright, motivated and hard working individual for the Data Center Logistics Specialist position. The ideal candidate possesses a strong work ethic, attention to detail, the ability to meet deadlines and a commitment to Operational Excellence.\u003cbr/\u003e\u003cbr/\u003eThe Logistics Specialist reviews data center inventory, in-bound shipments and ongoing demand to ensure that proper stock levels are maintained in all locations to support build and repair activities. Working with the Logistics Manager, they create plans to optimize the flow of parts through their lifecycle; tracking inventory location, movement, age, and turns. They work closely with Data Center Operations Technicians and Data Center Engineers to fulfill parts quickly and accurately. They work with Procurement and Hardware Engineering to source new parts and interface directly with vendors to process RMAs and receive replacements. They are responsible for accurate data entry and resolving questions from peer organizations.\u003cbr/\u003e\u003cbr/\u003eThe ideal Logistics Specialist will dive deep into data to understand everything about the data center asset lifecycle. They maintain up-to-date metrics dashboards and create reports for internal and external suppliers and management as required.\u003cbr/\u003e\u003cbr/\u003eAWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help.\u003cbr/\u003e\u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, logistics specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eResponsibilities are divided between manual and administration tasks, including:\u003cbr/\u003e· Coordination of all inbound/outbound deliveries, liaise with vendors, couriers/carriers, transportation and inventory planning teams.\u003cbr/\u003e· Receiving/shipping parts logically and physically, ensuring our Inventory management system is up to date and accurate at all times.\u003cbr/\u003e· Working closely with internal customers to fulfill parts quickly and accurately.\u003cbr/\u003e· Responsible for accurate data entry and resolving questions from peer organizations.\u003cbr/\u003e· Executing stock re-balancing through transfers between locations locally and globally, to ensure stock utilization and availability maximization of parts on each location.\u003cbr/\u003e· Responsible for Inventory management, regular cycle counts, customer-oriented storage space optimization, cleanliness, organization and safety of all workspace.\u003cbr/\u003e· Ad hoc analysis and projects based on business needs.\u003cbr/\u003e· Reverse Logistics; interface directly with vendors to process warranty parts returns and receive replacements.\u003cbr/\u003e\u003cbr/\u003eLogistics Specialists are expected to understand all aspects of the production, adhere to strict safety standards, maintain high levels of quality and be willing to travel to support other locations within and outside the country.\u003cbr/\u003e\u003cbr/\u003e*Please apply with an English version of your resume\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eDiverse Experiences\u003cbr/\u003eAWS values diverse experiences. Even if you do not meet all of the qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.\u003cbr/\u003e\u003cbr/\u003eWhy AWS?\u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture\u003cbr/\u003eAWS values curiosity and connection. Our employee-led and company-sponsored affinity groups promote inclusion and empower our people to take pride in what makes us unique. Our inclusion events foster stronger, more collaborative teams. Our continual innovation is fueled by the bold ideas, fresh perspectives, and passionate voices our teams bring to everything we do.\u003cbr/\u003e\u003cbr/\u003eMentorship \u0026 Career Growth\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional.\u003cbr/\u003e\u003cbr/\u003eWork/Life Balance\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why flexible work hours and arrangements are part of our culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud.","department_cost_center":null,"description_short":"Job summaryBe a part of operating the world’s largest cloud computing infrastructure. Amazon Web Services is seeking a bright, motivated and hard working individual for the Data Center Logistics Specialist","display_distance":null,"id":"5b647133-0ff7-463a-98ce-03d9c8b9eb9c","id_icims":"3141772","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Data Center Materials","job_function_id":null,"job_path":"/en/jobs/3141772/logistics-specialist-aws-data-center","job_schedule_type":"full-time","location":"SE, Katrineholm","locations":["{\"normalizedStateName\":\"Sodermanland County\",\"normalizedCountryCode\":\"SWE\",\"city\":\"Katrineholm\",\"countryIso3a\":\"SWE\",\"countryIso2a\":\"SE\",\"locationNonStemming\":\"Sweden, Katrineholm\",\"coordinates\":\"58.99286,16.2103\",\"normalizedCountyName\":\"Katrineholm\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Sweden\",\"normalizedLocation\":\"Katrineholm, Sodermanland County, SWE\",\"location\":\"SE, Katrineholm\",\"region\":\"\",\"buildingCodeList\":[\"ARN51\"],\"normalizedCityName\":\"Katrineholm\"}"],"normalized_location":"Katrineholm, Sodermanland County, SWE","optional_search_labels":["aws.team-ais"],"posted_date":"December 12, 2025","preferred_qualifications":"- Relevant Degree in Logistics or Supply Chain\u003cbr/\u003e- Experience of working within a complex logistics set-up. Experience in Data Center is a plus\u003cbr/\u003e- Project Management experience\u003cbr/\u003e- Ability to identify issues, develop solutions and drive results\u003cbr/\u003e- Good knowledge of IT and network equipment\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunities employer. We believe passionately that employing a diverse workforce is central to our success. We make recruiting decisions based on your experience and skills. We value your passion to discover, invent, simplify and build. Protecting your privacy and the security of your data is a longstanding top priority for Amazon. Please consult our Privacy Notice (\u003ca href=\"https://www.amazon.jobs/en/privacy_page\"\u003ehttps://www.amazon.jobs/en/privacy_page\u003c/a\u003e) to know more about how we collect, use and transfer the personal data of our candidates.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"aws.team-support","source_system":"JobCreator","state":null,"title":"Logistics Specialist (AWS Data Center)","university_job":null,"updated_time":"12 minutes","url_next_step":"https://account.amazon.com/jobs/3141772/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-support","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- • Bachelor’s Degree or 2+ years Amazon experience. • 7+ years direct management experience, including a salaried workforce, in a manufacturing, production or distribution environment. • Prior experience with performance metrics, process improvement and Lean techniques. • Prior experience with the full staffing lifecycle, including interviewing, hiring, performance management, promotions and termination.","business_category":"fulfillment-ops","city":"Jesi","company_name":"Amazon Italia Logistica S.R.L. - B96","country_code":"ITA","description":"Our operations help everything to come together at Amazon. As the Site Leader/Senior Operations Manager in a fast-paced and challenging environment, you’ll be the person who knows your area of the business inside out. You’ll own the operational metrics and set the strategy for your area of the business to deliver for our customers and ultimately grow our operations. You’ll also develop a large team and coach and mentor team leaders.  \u003cbr/\u003e   \u003cbr/\u003e  \u003cbr/\u003e  \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Monitor operational metrics and business performance   \u003cbr/\u003e- Contribute to planning the operational budget, considering everything from financial and labour planning \u003cbr/\u003e- Protect high standards of operational Health and Safety  \u003cbr/\u003e- Strategic planning for the next three, six and twelve months, with a particular focus on peak-season planning \u003cbr/\u003e- Be accountable for operational leadership by measuring performance, offering feedback, and providing development support\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eYou’ll be based at one of our operational sites/You’ll split your time across a number of our operational sites. Spending lots of time on site will help you develop your team and collaborate on operational planning. This role has two sides. You’ll manage and motivate a team of leaders. At the same time, you’ll focus on long-term objectives. This includes creating contingency plans to keep operations running and mitigate against disruptions and driving initiatives that boost quality, safety and productivity. You’ll be a source of accountability and a business-wide champion of best practice.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eCustomer Fulfilment, or CF, is where it all started for Amazon. CF has scaled up from a humble team of booksellers to a sophisticated global team which handles more than 1.5 million orders every day. The team is the foundation of our business and its efforts have helped us diversify across new regions and services. With the help of emerging technology, we’re always looking for ways to offer a bigger, better product range – delivered quickly and affordably.\u003cbr/\u003e\u003cbr/\u003eThe CF team are the first people in the chain that helps customers get products at the speed we’re known for. We’re based in Fulfilment Centres, which are at the heart of Amazon’s fast-paced Operations network. Our centres are sometimes referred to as the ‘First Mile’ because it’s where most Amazon packages start their journey. We help to manage dynamic inventory and facilitate speedy deliveries round the clock.\u003cbr/\u003e\u003cbr/\u003eLots of different people work in our Fulfilment Centres, so there are plenty of opportunities for every skillset. Some of us work with physical products, while others analyse data to help everyone across the business make smart decisions.","department_cost_center":null,"description_short":"Our operations help everything to come together at Amazon. As the Site Leader/Senior Operations Manager in a fast-paced and challenging environment, you’ll be the person who knows your area of the business","display_distance":null,"id":"0c4d8349-772e-45f7-90ee-a0cd33712f4f","id_icims":"3160042","is_intern":null,"is_manager":null,"job_category":"Fulfillment \u0026 Operations Management","job_family":"Fulfillment Center","job_function_id":null,"job_path":"/en/jobs/3160042/senior-operations-manager","job_schedule_type":"full-time","location":"IT, AN, Jesi","locations":["{\"normalizedStateName\":\"Marches\",\"normalizedCountryCode\":\"ITA\",\"city\":\"Jesi\",\"countryIso3a\":\"ITA\",\"countryIso2a\":\"IT\",\"locationNonStemming\":\"Italy, AN, Jesi\",\"coordinates\":\"43.5207,13.23808\",\"normalizedCountyName\":\"Ancona\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Italy\",\"normalizedLocation\":\"Jesi, Marches, ITA\",\"location\":\"IT, AN, Jesi\",\"region\":\"AN\",\"buildingCodeList\":[\"AOI1\"],\"normalizedCityName\":\"Jesi\"}"],"normalized_location":"Jesi, Marches, ITA","optional_search_labels":[],"posted_date":"January 15, 2026","preferred_qualifications":"- • Degree in Engineering, Operations or related field and MBA preferred • Experience with a contingent workforce during peak seasons • Ability to handle changing priorities and use good judgment in stressful situations • Interest in long-term career development through assignments in multiple FCs across the nation Amazon is committed to a diverse and inclusive workplace. Amazon is an equal opportunity employer and does not discriminate on the basis of race, national origin, gender, gender identity, sexual orientation, protected veteran status, disability, age, or other legally protected status. For individuals with disabilities who would like to request an accommodation, please visit https://www.amazon.jobs/en/disability/us.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunities employer. We believe passionately that employing a diverse workforce is central to our success. We make recruiting decisions based on your experience and skills. We value your passion to discover, invent, simplify and build. Protecting your privacy and the security of your data is a longstanding top priority for Amazon. Please consult our Privacy Notice (\u003ca href=\"https://www.amazon.jobs/en/privacy_page\"\u003ehttps://www.amazon.jobs/en/privacy_page\u003c/a\u003e) to know more about how we collect, use and transfer the personal data of our candidates.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"fulfillment-ops.team-global-specialty-fulfillment","source_system":"JobCreator","state":"AN","title":"Senior Operations Manager ","university_job":null,"updated_time":"12 minutes","url_next_step":"https://account.amazon.com/jobs/3160042/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-global-specialty-fulfillment","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Formation et expérience : Bac Pro, BTS, BUT ou équivalent (Bac+2 minimum) en maintenance industrielle, électrotechnique ou mécanique, avec expérience en maintenance électrique et mécanique ou une expérience sur un poste similaire pour une durée d'au moins de deux ans.\u003cbr/\u003e- Maintenance préventive et GMAO : Expérience prouvée avec les systèmes de maintenance préventive planifiée et maîtrise des plateformes GMAO\u003cbr/\u003e- Dépannage et diagnostic : Capacités avancées de dépannage sur équipements de manutention et systèmes d'automatisation, avec maîtrise de la lecture des plans mécaniques et électriques\u003cbr/\u003e- Compétences techniques : Expérience pratique avec systèmes de convoyeurs, contrôleurs moteur, variateurs de fréquence et technologies de capteurs\u003cbr/\u003e- Compétences opérationnelles : Connaissance des normes de santé et sécurité, fortes compétences organisationnelles et excellentes capacités de communication","business_category":"fulfillment-ops","city":"Satolas-et-bonce","company_name":"Amazon France Logistique SAS","country_code":"FRA","description":"Technicien de Maintenance (F/H) Chaque jour, des millions de clients comptent sur Amazon pour recevoir leurs commandes à temps. Derrière cette promesse se cache un réseau d'automatisation sophistiqué où chaque seconde compte. En tant que Technicien/ne RME, vous serez au cœur de cette mécanique de précision, gardien des technologies qui permettent à nos centres de distribution de fonctionner 24h/24 et 7j/7.\u003cbr/\u003eCe qui rend ce rôle unique ? Vous travaillerez sur des équipements à la pointe de la technologie, parfois conçus en interne, dans un environnement où l'innovation rencontre l'excellence opérationnelle. Votre expertise technique aura un impact direct et mesurable : chaque intervention réussie, c'est des milliers de colis qui arrivent à destination comme prévu.\u003cbr/\u003eSi vous adorez les challenges techniques, que vous vous épanouissez dans des environnements dynamiques et que vous voulez voir l'impact concret de votre travail à l'échelle mondiale, ce poste est fait pour vous.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eResponsabilités Clés\u003cbr/\u003eGarantir la sécurité et la conformité\u003cbr/\u003e•\tPromouvoir les meilleures pratiques de santé et sécurité dans toutes les activités de maintenance, en assurant la conformité totale aux normes et réglementations\u003cbr/\u003e•\tEffectuer des évaluations de risques et mettre en place des protocoles de sécurité pour les travaux de maintenance\u003cbr/\u003eAssurer l'excellence en maintenance préventive\u003cbr/\u003e•\tExécuter des programmes complets de maintenance préventive planifiée sur des équipements automatisés diversifiés : convoyeurs, robots, systèmes de tri et d'emballage\u003cbr/\u003e•\tUtiliser les systèmes informatisés de gestion de la maintenance (GMAO) pour suivre, programmer et documenter les activités de maintenance\u003cbr/\u003e•\tCollaborer avec les fabricants d'équipements et prestataires externes pour optimiser les procédures de maintenance\u003cbr/\u003eIntervenir rapidement et résoudre les problèmes complexes\u003cbr/\u003e•\tFournir une réponse rapide aux pannes d'équipement avec communication claire aux équipes opérationnelles\u003cbr/\u003e•\tEffectuer un dépannage avancé sur les systèmes électriques, mécaniques et d'automatisation complexes\u003cbr/\u003e•\tUtiliser les outils de diagnostic et documentation technique pour identifier efficacement les causes racines\u003cbr/\u003eMaîtriser les technologies d'automatisation\u003cbr/\u003e•\tMaintenir et configurer des systèmes d'automatisation sophistiqués incluant les contrôleurs logiques programmables (API) et réseaux de terrain\u003cbr/\u003e•\tEntretenir et calibrer les scanners de codes-barres, systèmes d'impression-application et équipements de tri\u003cbr/\u003eContribuer à l'amélioration continue\u003cbr/\u003e•\tAnalyser les données de performance des équipements pour identifier les opportunités d'amélioration\u003cbr/\u003e•\tDévelopper et mettre en œuvre des initiatives de réduction des coûts par l'optimisation des équipements\u003cbr/\u003e•\tPartager les connaissances techniques et encadrer les techniciens juniors\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eHoraires de travail : Ce poste fonctionne dans un environnement 24h/24 et 7j/7 nécessitant une flexibilité avec des horaires variables, incluant nuits, week-ends et jours fériés.","department_cost_center":null,"description_short":"Technicien de Maintenance (F/H) Chaque jour, des millions de clients comptent sur Amazon pour recevoir leurs commandes à temps. Derrière cette promesse se cache un réseau d'automatisation sophistiqué où","display_distance":null,"id":"61fdae03-a663-4d4b-bbc1-04695d049f95","id_icims":"3177698","is_intern":null,"is_manager":null,"job_category":"Facilities, Maintenance, \u0026 Real Estate","job_family":"Real Estate/Facilities","job_function_id":null,"job_path":"/en/jobs/3177698/technicien-de-maintenance-m-f","job_schedule_type":"full-time","location":"FR, Satolas-et-bonce","locations":["{\"normalizedStateName\":\"Auvergne-Rhone-Alpes\",\"normalizedCountryCode\":\"FRA\",\"city\":\"Satolas-et-bonce\",\"countryIso3a\":\"FRA\",\"countryIso2a\":\"FR\",\"locationNonStemming\":\"France, Satolas-et-bonce\",\"coordinates\":\"45.69358,5.12729\",\"normalizedCountyName\":\"Isère\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"France\",\"normalizedLocation\":\"Satolas-et-Bonce, Auvergne-Rhone-Alpes, FRA\",\"location\":\"FR, Satolas-et-bonce\",\"region\":\"\",\"buildingCodeList\":[\"LYS8\"],\"normalizedCityName\":\"Satolas-et-Bonce\"}"],"normalized_location":"Satolas-et-Bonce, Auvergne-Rhone-Alpes, FRA","optional_search_labels":["operations-team.reliability-maintenance-engineering-eu","ops.lander-emea-rme-reliability","ops.lander-emea-rme-technician","ops.rme-technician"],"posted_date":"February 10, 2026","preferred_qualifications":"- Certifications électriques : Habilitations électriques avec expérience en travaux d'ordre électrique et maintenance des contrôleurs moteur/variateurs\u003cbr/\u003e- Expertise en automatisation : Expérience avec systèmes Siemens (API), réseaux de terrain, robotique et systèmes automatisés de stockage/récupération\u003cbr/\u003e- Technologies de traçabilité : Expertise en configuration et maintenance de scanners de codes-barres et systèmes d'impression-application\u003cbr/\u003e- Technologie de maintenance 4.0: Utilisation et/ou exploitation des différentes technologies liées à la maintenance 4.0\u003cbr/\u003e- Leadership technique : Expérience d'encadrement de techniciens juniors avec compétences en rédaction technique pour la documentation\u003cbr/\u003e- Gestion de projets : Expérience en gestion de projet d'installations d'équipements et capacités multilingues (un atout)\u003cbr/\u003e- Machine de conditionnement: Entretien et mise au point de machine de conditionnement automatique\u003cbr/\u003e\u003cbr/\u003eAmazon est un employeur engagé pour l'égalité des chances. Nous sommes convaincus qu'une main d'oeuvre diversifée est essentielle à notre réussite. Nous prenons nos décisions de recrutement en fonction de votre expérience et de vos compétences. Nous apprécions votre envie de découvrir, d'inventer, de simplifier et de construire. La protection de votre vie privée et la sécurité de vos données constituent depuis longtemps une priorité absolue pour Amazon. Veuillez consulter notre Politique de Confidentialité pour en savoir plus sur la façon dont nous collectons, utilisons et traitons les données personnelles de nos candidats.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"fulfillment-ops.team-emea-rme","source_system":"JobCreator","state":null,"title":"Technicien de Maintenance M/F","university_job":null,"updated_time":"16 minutes","url_next_step":"https://account.amazon.com/jobs/3177698/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-emea-rme","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 8+ years of quality assurance engineering experience\u003cbr/\u003e- Experience leading large teams of Software Quality and Design Assurance Engineers across complicated cross-discipline programs\u003cbr/\u003e- Experience defining and owning the technical strategy for automated testing using diverse technical solutions including Generative AI\u003cbr/\u003e- Experience with JIRA, Zephyr, Appium and other common tools\u003cbr/\u003e- Experience with software engineering practices \u0026 patterns for the full software development life cycle, including coding standards, code reviews, source control management, build processes, CI/CD, testing, and production operations","business_category":"subsidiaries","city":"Newark","company_name":"Audible, Inc. - B13","country_code":"USA","description":"At Audible, we believe stories have the power to transform lives. It’s why we work with some of the world’s leading creators to produce and share audio storytelling with our millions of global listeners. We are dreamers and inventors who come from a wide range of backgrounds and experiences to empower and inspire each other. Imagine your future with us.\u003cbr/\u003e\u003cbr/\u003eABOUT THIS ROLE\u003cbr/\u003eAs a Principal Quality Assurance Engineer, you will provide organization-wide strategic leadership and set the standard for quality engineering excellence.  The Principal QAE role offers a unique opportunity to provide quality and test guidance horizontally across a broad number of teams from large scale multi-surface service development to mobile applications and native in-car experiences. \u003cbr/\u003e\u003cbr/\u003eABOUT YOU\u003cbr/\u003eYou have a strong track record of leading Software Quality and Design Assurance engineering initiatives for highly complex products with large scale consumer-focused offerings. \u003cbr/\u003e\u003cbr/\u003eAs a Principal Quality Assurance Engineer you'll...\u003cbr/\u003e- Be a strong integrator who prioritizes well and communicates effectively\u003cbr/\u003e- Operate as a hands-on technical leader: diving deep into complex engineering challenges, making high-judgment decisions, and driving clarity across ambiguous problem spaces\u003cbr/\u003e- Lead and actively participate in test planning and tools reviews, aligning teams across your organization towards coherent strategies and best practices\u003cbr/\u003e- Define and own the technical strategy for automated testing using diverse technical solutions including Generative AI\u003cbr/\u003e- Define and implement mechanisms to raise the quality bar at scale and solve endemic issues\u003cbr/\u003e- Exert technical influence over multiple teams, increasing their productivity and effectiveness by sharing your deep knowledge and experience\u003cbr/\u003e- Provide mentorship to engineers, raising the bar on design, code quality, and operational excellence\u003cbr/\u003e- Actively participate in employee hiring and development process\u003cbr/\u003e\u003cbr/\u003eABOUT AUDIBLE\u003cbr/\u003eAudible is the leading producer and provider of audio storytelling. We spark listeners’ imaginations, offering immersive, cinematic experiences full of inspiration and insight to enrich our customers daily lives. We are a global company with an entrepreneurial spirit. We are dreamers and inventors who are passionate about the positive impact Audible can make for our customers and our neighbors. This spirit courses throughout Audible, supporting a culture of creativity and inclusion built on our People Principles and our mission to build more equitable communities in the cities we call home.","department_cost_center":null,"description_short":"At Audible, we believe stories have the power to transform lives. It’s why we work with some of the world’s leading creators to produce and share audio storytelling with our millions of global listeners.","display_distance":null,"id":"c99c9ce9-3010-417f-ba84-58cdfad1109f","id_icims":"3134976","is_intern":null,"is_manager":null,"job_category":"Systems, Quality, \u0026 Security Engineering","job_family":"Systems Quality","job_function_id":null,"job_path":"/en/jobs/3134976/principal-quality-assurance-engineer-apps-and-consumption-services","job_schedule_type":"full-time","location":"US, NJ, Newark","locations":["{\"normalizedStateName\":\"New Jersey\",\"normalizedCountryCode\":\"USA\",\"city\":\"Newark\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, NJ, Newark\",\"coordinates\":\"40.73197,-74.17421\",\"normalizedCountyName\":\"Essex\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Newark, New Jersey, USA\",\"location\":\"US, NJ, Newark\",\"region\":\"NJ\",\"buildingCodeList\":[\"EWR1\"],\"normalizedCityName\":\"Newark\"}"],"normalized_location":"Newark, New Jersey, USA","optional_search_labels":[],"posted_date":"December  2, 2025","preferred_qualifications":"- Experience participating in employee hiring and development process\u003cbr/\u003e- Experience diving deep into complex engineering challenges, making high-judgment decisions, and driving clarity across ambiguous problem spaces.\u003cbr/\u003e- Experience providing quality and test guidance horizontally across a broad number of teams from large scale multi-surface service development to mobile applications and native in-car experiences.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, NJ, Newark - 174,500.00 - 236,100.00 USD annually","primary_search_label":"subsidiaries.team-global-audible","source_system":"JobCreator","state":"NJ","title":"Principal Quality Assurance Engineer, Apps and Consumption Services","university_job":null,"updated_time":"17 minutes","url_next_step":"https://account.amazon.com/jobs/3134976/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-global-audible","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Experience in Data Center Engineering Operations, with a deep understanding of electrical and mechanical data center infrastructure\u003cbr/\u003e- Knowledge of mechanical or electrical systems design\u003cbr/\u003e- Experience working with a queue of requests with Service Level Agreements (SLA) and accuracy targets against Standard Operating Procedures (SOP)","business_category":"aws","city":"Dublin","company_name":"Amazon Data Services Ireland Limited","country_code":"IRL","description":"AWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help.\u003cbr/\u003e\u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion.\u003cbr/\u003e\u003cbr/\u003eThe Data Center Global Services organization is looking for an individual with proven and tested leadership skills to help bring to fruition a newly developed Facilities Operations Center. The Facility Operations Center is responsible for 24X7 monitoring of the data center’s physical infrastructure and will serve as a facilitator for all Large Scale Events. This team will ensure that the customer experience will be optimal and gratifying by way of consistency, reliability and attention to detail.\u003cbr/\u003e\u003cbr/\u003eThe ideal candidate will need to have an understanding of data center IT Infrastructure and data center Facilities infrastructure and how the two entities co-exist. The successful candidate will be responsible for providing assistance and support to the onsite team. The position will help ensure overall availability and reliability to meet or exceed defined service levels. Qualified candidates must also have experience functioning in a large-scale data center and have demonstrated and displayed the ability to think outside of the box. This skill is essential, as the candidate will assist with aligning the Facility Operations Center with the larger objectives of other business and peer organizations. You will need to play a role with growing the team to a standard of operational excellence.\u003cbr/\u003e\u003cbr/\u003eIf you are passionate about the Customer Experience; you think and act globally; and you want to contribute to the operational excellence of Amazon Data Centers, then this may be the challenge you’ve been looking for!\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eMonitors the global data center Amazon facilities infrastructure platform\u003cbr/\u003eServes as a Point of Contact for internal and external teams\u003cbr/\u003eAssists with the development of communication and escalation protocols designed to improve the team’s performance\u003cbr/\u003eContributes to outage post mortem analysis\u003cbr/\u003eEnsures records are updated in a timely manner\u003cbr/\u003eAssists with coordination and communication during emergency recovery efforts\u003cbr/\u003eAssists with the development of tools that will enhance the team’s performance\u003cbr/\u003eAbility to support a 24X7 environment (This is shift work which may require that you work weekends and holidays)\u003cbr/\u003eInternal job description\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eDiverse Experiences\u003cbr/\u003eAWS values diverse experiences. Even if you do not meet all of the qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.\u003cbr/\u003eWhy AWS?\u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture\u003cbr/\u003eHere at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. Ongoing events and learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon (diversity) conferences, inspire us to never stop embracing our uniqueness.\u003cbr/\u003e\u003cbr/\u003eMentorship \u0026 Career Growth\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional.\u003cbr/\u003e\u003cbr/\u003eWork/Life Balance\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why flexible work hours and arrangements are part of our culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud.","department_cost_center":null,"description_short":"AWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers","display_distance":null,"id":"1681227a-3de3-43fe-8209-1beefb8ae1f3","id_icims":"3155700","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Tech Ops Engineering","job_function_id":null,"job_path":"/en/jobs/3155700/facility-operations-center-eng-facilities-operation-center","job_schedule_type":"full-time","location":"IE, D, Dublin","locations":["{\"normalizedCountryCode\":\"IRL\",\"city\":\"Dublin\",\"countryIso3a\":\"IRL\",\"countryIso2a\":\"IE\",\"locationNonStemming\":\"Ireland, D, Dublin\",\"coordinates\":\"53.34807,-6.24827\",\"normalizedCountyName\":\"County Dublin\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Ireland\",\"normalizedLocation\":\"Dublin, IRL\",\"location\":\"IE, D, Dublin\",\"region\":\"D\",\"buildingCodeList\":[\"DUB50\"],\"normalizedCityName\":\"Dublin\"}"],"normalized_location":"Dublin, IRL","optional_search_labels":[],"posted_date":"January  9, 2026","preferred_qualifications":"- Preferred qualifications\u003cbr/\u003e- - 3+ years' experience working in a large scale Data center\u003cbr/\u003e- - 3+ years’ experience in a NOC (Network Operations Centre) or similar\u003cbr/\u003e- - 3+ years' experience in Data Center Engineering / Operations environment\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunities employer. We believe passionately that employing a diverse workforce is central to our success. We make recruiting decisions based on your experience and skills. We value your passion to discover, invent, simplify and build. Protecting your privacy and the security of your data is a longstanding top priority for Amazon. Please consult our Privacy Notice (\u003ca href=\"https://www.amazon.jobs/en/privacy_page\"\u003ehttps://www.amazon.jobs/en/privacy_page\u003c/a\u003e) to know more about how we collect, use and transfer the personal data of our candidates.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"aws.team-support-engineer-primary","source_system":"JobCreator","state":"D","title":"Facility Operations Center Eng, Facilities Operation Center","university_job":null,"updated_time":"21 minutes","url_next_step":"https://account.amazon.com/jobs/3155700/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-support-engineer-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- High school or equivalent diploma\u003cbr/\u003e- Work a flexible schedule/shift/work area, including weekends, nights, and/or holidays\u003cbr/\u003e- Experience in English-language communication skills, both written and verbal\u003cbr/\u003e- Experience running metrics reports, analyzing data to identify problems and using data analysis to generate and explain metrics\u003cbr/\u003e- Experience working with the MS Office suite (Word, Excel, Outlook) in a professional environment\u003cbr/\u003e- UAE National with Family Book","business_category":"fulfillment-and-operations","city":"Dubai","company_name":"Q-Express Documents Transport","country_code":"ARE","description":"Operations is the heart and soul of everything Amazon does. It is thanks to effective operations that items are processed and dispatched to our customers on time. Being an Operations Lead/Supervisor gives you the chance to see how all the different parts of operations work and play a role in making sure everything runs smoothly.  \u003cbr/\u003e\u003cbr/\u003eYou’ll be the first point of contact for team members during their shift and help them follow the processes that your managers have put in place. This is a hands-on role, which will give you experience in using the tools and systems that make our operations successful.  \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eMeasure and monitor workflows, track onsite performance, and provide important shift information to frontline management to ensure operational excellence across shifts \u003cbr/\u003eSupport and train employees to deliver great service and supervise them in their daily tasks \u003cbr/\u003eSupport the Shift/Area Manager with projects to improve processes, cultivate a safe working environment, and increase workforce engagement  \u003cbr/\u003eWork with other departments to find solutions to address common issues or support needs in areas of key performance \u003cbr/\u003eUse data analysis to identify ways to optimise safety, quality and productivity  \u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eAs an Operations Lead/Supervisor, you’ll be based in one of our operational sites. You’ll support your Shift/Area Manager to carry out the plan for the shift. That will involve helping with pre-shift meetings with your team and monitoring procedures to make sure everyone is following safety rules, quality processes, and the priority plan for the day.  \u003cbr/\u003e\u003cbr/\u003eYou’ll escalate any issues you spot to your manager, but sometimes you’ll be the most senior person on shift and will give people the direction they need to complete their tasks. At other times, you’ll support your Shift/Area Manager in planning shifts to make sure you have enough team members working during peak times.  ","department_cost_center":null,"description_short":"Operations is the heart and soul of everything Amazon does. It is thanks to effective operations that items are processed and dispatched to our customers on time. Being an Operations Lead/Supervisor gives","display_distance":null,"id":"b152c81e-090e-41b6-b2c4-0bb30bff5011","id_icims":"3177700","is_intern":null,"is_manager":null,"job_category":"Fulfillment \u0026 Operations Management","job_family":"Amazon future builders program","job_function_id":null,"job_path":"/en/jobs/3177700/operation-lead-uae-national-operations","job_schedule_type":"full-time","location":"AE, Dubai","locations":["{\"normalizedCountryCode\":\"ARE\",\"city\":\"Dubai\",\"countryIso3a\":\"ARE\",\"countryIso2a\":\"AE\",\"locationNonStemming\":\"United Arab Emirates, Dubai\",\"coordinates\":\"25.26951,55.30884\",\"normalizedCountyName\":\"Dubai\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United Arab Emirates\",\"normalizedLocation\":\"Dubai, ARE\",\"location\":\"AE, Dubai\",\"region\":\"\",\"buildingCodeList\":[\"DXB8\"],\"normalizedCityName\":\"Dubai\"}"],"normalized_location":"Dubai, ARE","optional_search_labels":[],"posted_date":"February 10, 2026","preferred_qualifications":"- Knowledge of Lean, Six Sigma and Kaizen techniques\u003cbr/\u003e- Experience with data and analysis tools including Microsoft Excel and SQL\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"fulfillment-and-operations.no-team-listed","source_system":"JobCreator","state":null,"title":"Operation Lead - UAE National, Operations","university_job":null,"updated_time":"22 minutes","url_next_step":"https://account.amazon.com/jobs/3177700/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"no-team-listed","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}}],"job_posting_search_request":"{\"jobPostingSearchRequest\":{\"query\":\"\",\"excludeFacets\":[{\"name\":\"businessCategory\",\"values\":[{\"name\":\"a-confidential-job\"}]},{\"name\":\"isPostedExternally\",\"values\":[{\"name\":\"0\"}]},{\"name\":\"isUnsearchable\",\"values\":[{\"name\":\"1\"}]}],\"filterFacets\":[],\"start\":0,\"size\":10,\"sort\":{\"sortOrder\":\"DESCENDING\",\"sortType\":\"SCORE\"},\"location\":null,\"accessLevel\":\"EXTERNAL\",\"includeFacets\":[],\"locationFacets\":[],\"jobTypeFacets\":[],\"contentFilterFacets\":[],\"treatment\":\"OM\"}}"}