{"error":null,"hits":10000,"facets":{},"content":{"sidebar":{},"search_results":{}},"jobs":[{"basic_qualifications":"- An Associate’s Degree or related work experience\u003cbr/\u003e- CEFR C1+ or equivalent fluency in German language\u003cbr/\u003e- Written and spoken knowledge of English is essential (CEFR B2+)\u003cbr/\u003e- Strong business writing skills with ability to create reports, proposals, and professional correspondence\u003cbr/\u003e- Advanced reading comprehension with ability to analyze complex business documents\u003cbr/\u003e- Developed analytical thinking and structured problem-solving capabilities\u003cbr/\u003e- Strong ability to interpret and implement detailed instructions across various projects\u003cbr/\u003e- Proficient research skills with experience gathering and synthesizing information from multiple sources\u003cbr/\u003e- Proven attention to detail in managing complex tasks and documents","business_category":"amazon-artificial-general-intelligence","city":"London","company_name":"Evi Technologies Limited","country_code":"GBR","description":"AI is the most transformational technology of our time, capable of tackling some of humanity’s most challenging problems. Amazon is investing in generative AI and the responsible development and deployment of large language models (LLMs) across all of our businesses. Come build the future of human-technology interaction with us.\u003cbr/\u003e\u003cbr/\u003eWe are looking for those candidates who just don’t think out of the box, but make the box they are in ‘Bigger’. The future is now, do you want to be a part of it? Then read on! \u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Maintain and follow strict confidentiality as customer privacy is our biggest tenet\u003cbr/\u003e- Work with a range of different types of data including but not limited to text, speech, image, and video\u003cbr/\u003e- Deliver high-quality labelled data, using guidelines provided to meet our KPIs and using in-house tools and software\u003cbr/\u003e- Assume the role of a subject matter expert for Machine Learning (ML) data workflows and demonstrate proficiency in researching, creating factually and grammatically correct responses, ranking responses, creating grammatically correct text, speech, image, video annotation.\u003cbr/\u003e- Ability to make logical decisions while performing tasks even when provided information is ambiguous. \u003cbr/\u003e- Eye for detail and ability to pivot from one category of requirement to another instantaneously.\u003cbr/\u003e- Demonstrate support for daily operational deliverables like AHT, quality, TAT for multiple task types assigned to you and the team\u003cbr/\u003e- Demonstrate expertise in handling end to end data execution process related to labelling the tasks and be less dependent on work instructions\u003cbr/\u003e- Contribute to root cause analysis, identify error patterns and identify solutions to improve quality of labelling tasks\u003cbr/\u003e- Responsible for identifying day-to-day process and operational issues in SOP, tools and suggest changes to unblock operations\u003cbr/\u003e- Demonstrate ownership in floor support to clarify internal queries during execution on need basis\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eWe are looking for a ML Data Associate (MLDA) to undertake the task of foundational labeling functions, such as dialogue evaluation on speech, text, audio, video data, to assess and improve Alexa’s performance in everyday situations.\u003cbr/\u003e\u003cbr/\u003eYour ability to concentrate, multi-task and your high attention to detail helps you deliver high-quality work as well as maintaining strict confidentiality and follow all applicable Amazon policies for securing confidential information. You will be a part of a diverse team with the shared vision to make huge strides in the world of technology and the way we use Artificial Intelligence. An inner drive, individuality, and a creative mind are extremely beneficial.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eThe team works strictly in the office Monday through Friday. We are constantly looking for ways to improve our capabilities and deliver the best product possible. Diverse team, regular meetings, trainings, and Amazon events throughout the year await you.\u003cbr/\u003e\u003cbr/\u003e","department_cost_center":null,"description_short":"AI is the most transformational technology of our time, capable of tackling some of humanity’s most challenging problems. Amazon is investing in generative AI and the responsible development and deployment","display_distance":null,"id":"fb48acab-50dd-4bae-b374-6c00d648f231","id_icims":"3163231","is_intern":null,"is_manager":null,"job_category":"Administrative Support","job_family":"Machine Learning Data Operatio","job_function_id":null,"job_path":"/en/jobs/3163231/senior-data-associate-with-german-part-time-artificial-general-intelligence","job_schedule_type":"part-time","location":"GB, London","locations":["{\"normalizedStateName\":\"England\",\"normalizedCountryCode\":\"GBR\",\"city\":\"London\",\"countryIso3a\":\"GBR\",\"countryIso2a\":\"GB\",\"locationNonStemming\":\"United Kingdom, London\",\"coordinates\":\"51.50643,-0.12719\",\"normalizedCountyName\":\"London\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United Kingdom\",\"normalizedLocation\":\"London, England, GBR\",\"location\":\"GB, London\",\"region\":\"\",\"buildingCodeList\":[\"LHR10\"],\"normalizedCityName\":\"London\"}"],"normalized_location":"London, England, GBR","optional_search_labels":[],"posted_date":"January 21, 2026","preferred_qualifications":"- Bachelor’s degree in a relevant field\u003cbr/\u003e- Proven experience with demonstrated task execution ability\u003cbr/\u003e- Proven capacity to leverage open-source resources effectively for comprehensive research purposes\u003cbr/\u003e- Ability to adapt well to fast-paced environments with changing circumstances, direction, and strategy\u003cbr/\u003e- Proven project coordination or management experience (for support functions teams)\u003cbr/\u003e- Experience managing stakeholder relationships across departments\u003cbr/\u003e- Advanced proficiency in Microsoft Office Suite and common business applications.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunities employer. We believe passionately that employing a diverse workforce is central to our success. We make recruiting decisions based on your experience and skills. We value your passion to discover, invent, simplify and build. Protecting your privacy and the security of your data is a longstanding top priority for Amazon. Please consult our Privacy Notice (\u003ca href=\"https://www.amazon.jobs/en/privacy_page\"\u003ehttps://www.amazon.jobs/en/privacy_page\u003c/a\u003e) to know more about how we collect, use and transfer the personal data of our candidates.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"amazon-artificial-general-intelligence.no-team-listed","source_system":"JobCreator","state":null,"title":"Senior Data Associate with German - Part Time, Artificial General Intelligence","university_job":null,"updated_time":"10 minutes","url_next_step":"https://account.amazon.com/jobs/3163231/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"no-team-listed","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Experience in data center engineering\u003cbr/\u003e- Experience in relevant work\u003cbr/\u003e- Can bend or twist the body into unusual positions while working\u003cbr/\u003e- Can use hands to manipulate small wires and objects\u003cbr/\u003e- Can walk on job sites in uneven terrain\u003cbr/\u003e- Can work at heights and from ladders","business_category":"aws","city":"Didcot","company_name":"Amazon Data Services UK Limited","country_code":"GBR","description":"AWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help.\u003cbr/\u003e\u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion.\u003cbr/\u003e\u003cbr/\u003eAmazon is seeking a collaborative maintenance professional for our Amazon Web Services Team. \u003cbr/\u003e\u003cbr/\u003eThis engineering operations technician position serves as the on-site maintenance technician and operator for an AWS data centre. \u003cbr/\u003e\u003cbr/\u003eThe Data Centre Engineering Operations Technician (EOT) is responsible for operating and maintaining all electrical, mechanical, emergency generator, and fire/life safety equipment within the data centre. The EOT serves as a technical resource to support Amazon within its data centres. Data centre equipment that supports mission-critical servers must maintain better than 99.999% uptime. EOT’s are also tasked with driving innovation while reducing operational costs in the facilities.\u003cbr/\u003e\u003cbr/\u003eEOT’s are Amazon’s front line responders for hands-on electrical and mechanical equipment troubleshooting and operation. This equipment includes, but is not limited to, stand-by diesel generators, switchboards/switch-gears, UPS’s, PDU’s, AHU’s, pumps, motors, VFD’s, and building automation systems. \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eResponsibilities:\u003cbr/\u003e - Operate and maintain mechanical and electrical equipment\u003cbr/\u003e - Troubleshooting of facility and rack-level events within internal SLAs\u003cbr/\u003e - Perform limited maintenance tasks to include: filter changes, HVAC PMs, rack power installs, rack PDU, and rack ATS replacements\u003cbr/\u003e - Provide support to Data Centre Operations technicians\u003cbr/\u003e - Perform root cause analysis of equipment failures\u003cbr/\u003e - Ensure all safety procedures are adhered to while performing work\u003cbr/\u003e - Take daily operational readings of all mechanical and electrical equipment through routine rounds/log taking (temperatures, voltages, currents, etc.)\u003cbr/\u003e - Utilise internal CMMS to manage building workflows and spare part inventory\u003cbr/\u003e - Supervise contractors who perform servicing or preventive maintenance\u003cbr/\u003e - Respond to off hour emergency calls per on call rotation for any one of the region’s sites\u003cbr/\u003e - Fully comply with all physical security procedures and policies\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eHere at AWS, we embrace our differences. We are committed to furthering our culture of inclusion. We have ten employee-led affinity groups, reaching 40,000 employees in over 190 chapters globally. We have innovative benefit offerings, and we host annual and ongoing learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon (gender diversity) conferences. Amazon’s culture of inclusion is reinforced within our 16 Leadership Principles, which remind team members to seek diverse perspectives, learn and be curious, and earn trust.\u003cbr/\u003e\u003cbr/\u003eDiverse Experiences\u003cbr/\u003eAWS values diverse experiences. Even if you do not meet all of the preferred qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.\u003cbr/\u003eWhy AWS?\u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003eInclusive Team Culture\u003cbr/\u003eHere at AWS, it’s in our nature to learn and be curious. Our employee-led affinity groups foster a culture of inclusion that empower us to be proud of our differences. Ongoing events and learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon (gender diversity) conferences, inspire us to never stop embracing our uniqueness.\u003cbr/\u003e\u003cbr/\u003eMentorship \u0026 Career Growth\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional.\u003cbr/\u003e\u003cbr/\u003eWork/Life Balance\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eHere at AWS, we embrace our differences. We are committed to furthering our culture of inclusion. We have ten employee-led affinity groups, reaching 40,000 employees in over 190 chapters globally. We have innovative benefit offerings, and we host annual and ongoing learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon (gender diversity) conferences. Amazon’s culture of inclusion is reinforced within our 16 Leadership Principles, which remind team members to seek diverse perspectives, learn and be curious, and earn trust.\u003cbr/\u003e\u003cbr/\u003eYou will need to be a UK national and able to obtain and maintain a UK Government Security Clearance. Further details found here: https://www.gov.uk/government/publications/united-kingdom-security-vetting-clearance-levels","department_cost_center":null,"description_short":"AWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers","display_distance":null,"id":"0a99da0e-1238-4663-addc-fc968d309f9b","id_icims":"3169513","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Tech Ops Engineering","job_function_id":null,"job_path":"/en/jobs/3169513/engineering-operation-technician-infraops-dceo","job_schedule_type":"full-time","location":"GB, Didcot","locations":["{\"normalizedStateName\":\"England\",\"normalizedCountryCode\":\"GBR\",\"city\":\"Didcot\",\"countryIso3a\":\"GBR\",\"countryIso2a\":\"GB\",\"locationNonStemming\":\"United Kingdom, Didcot\",\"coordinates\":\"51.60237,-1.23211\",\"normalizedCountyName\":\"Oxfordshire\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United Kingdom\",\"normalizedLocation\":\"Didcot, England, GBR\",\"location\":\"GB, Didcot\",\"region\":\"\",\"buildingCodeList\":[\"LHR097\"],\"normalizedCityName\":\"Didcot\"}"],"normalized_location":"Didcot, England, GBR","optional_search_labels":["military-emea","aws.team-uk-launches-optional","aws.team-dc","military-operations"],"posted_date":"January 29, 2026","preferred_qualifications":"- Bachelor's degree in Electrical Engineering, Mechanical Engineering, or a related field\u003cbr/\u003e- Knowledge of network design and layout as well as low voltage (copper/ fiber) cabling\u003cbr/\u003e- Can perform physical tasks all day without becoming overly tired\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunities employer. We believe passionately that employing a diverse workforce is central to our success. We make recruiting decisions based on your experience and skills. We value your passion to discover, invent, simplify and build. Protecting your privacy and the security of your data is a longstanding top priority for Amazon. Please consult our Privacy Notice (\u003ca href=\"https://www.amazon.jobs/en/privacy_page\"\u003ehttps://www.amazon.jobs/en/privacy_page\u003c/a\u003e) to know more about how we collect, use and transfer the personal data of our candidates.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"aws.team-support-engineer-primary","source_system":"JobCreator","state":null,"title":"Engineering Operation Technician, InfraOps DCEO","university_job":null,"updated_time":"11 minutes","url_next_step":"https://account.amazon.com/jobs/3169513/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-support-engineer-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 1+ years of Microsoft Office products and applications experience\u003cbr/\u003e- High school or equivalent\u003cbr/\u003e- Work a flexible schedule/shift/work area, including weekends, nights, and/or holidays\u003cbr/\u003e- Can lift up to 49 pounds, stand/walk during shifts lasting up to 12 hours, and be able to frequently push, pull, squat, bend, and reach\u003cbr/\u003e- Work 40 hours/week, and overtime as required\u003cbr/\u003e- Valid and active driver's license\u003cbr/\u003e- Are 21 years of age or older\u003cbr/\u003e- Eligible to drive in accordance with DOT requirements\u003cbr/\u003e- Must be able to obtain and maintain a Driver Qualification File\u003cbr/\u003e- Authorized to work in the United States","business_category":"fulfillment-ops-team","city":"Stewartville","company_name":"Amazon.com Services LLC","country_code":"USA","description":"This full-time position requires in-role training at an operating site which will be 5+ weeks in duration.\u003cbr/\u003e\u003cbr/\u003eThis training will be located 50+ miles away from the home site location. All travel accommodations for training will be booked and paid for by Amazon.\u003cbr/\u003e\u003cbr/\u003eSince opening our 'virtual' doors in 1995, we’ve been pushing the boundaries of ‘possible’ further and further. Our entire business works hard to delight our customers – from the second an order is placed online to the seamless coordination of that order behind the scenes, we strive to stay agile, fluid and intentional. That can be described in one of our core Leadership Principles, which is Bias for Action. This means that our teams band together, roll up their sleeves, and aren’t content with just standing still. We’re aiming to become the most customer-centric company on Earth. \u003cbr/\u003e\u003cbr/\u003eRural Super Rural (RSR) is an exciting organization within Amazon dedicated to ensuring our customers receive their deliveries and are satisfied with their service, even in our most remote area. We are a combination of operations and support teams aligned to continually strive to innovate the last mile delivery process while bringing smiles to our customer’s faces. \u003cbr/\u003e\u003cbr/\u003eAmazon is seeking self-motivated Driver Trainers to join our team and help build a network of customer-centric Delivery Associates in the communities where we operate. As a Driver Trainer, you have a passion for mentoring others; you are comfortable teaching and guiding conversations in large groups; and you believe in hands-on training and conducting drive-alongs with Delivery Associates to instill safe practices.\u003cbr/\u003e\u003cbr/\u003eAs a Driver Trainer, you are responsible for establishing the right driver training culture in your delivery station, setting up the training experience, and independently instructing training sessions. You educate Delivery Associates on the foundational safety, quality, and productivity aspects that are an important part of the Delivery Associate daily routine. You enable the success of Delivery Associates by adapting to different learning styles and taking a hands-on training approach to demonstrate what good looks like. You exhibit Learn and Be Curious by answering all Delivery Associates’ questions and finding the answers if you are not sure of the correct response.\u003cbr/\u003e\u003cbr/\u003eAs a Driver Trainer, you are expected to lead by example and demonstrate the Amazon Leadership Principles at all times. In this position you will play a key role in keeping our commitment to exceed customer expectations by ensuring Delivery Associates are set up for success to deliver customer orders, large or small, on time at the right place.\u003cbr/\u003e\u003cbr/\u003eDue to interstate operating authority commerce regulations, candidates must be at least 21 years or older. Candidate must hold a valid state-appropriate driver’s license, be able to obtain and maintain their Driver Qualification File (DQF), and be eligible to drive in accordance with Department of Transportation (DOT) requirements.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e•Facilitate daily training classes for up to 30 people, including in-station classes and drive-alongs \u003cbr/\u003e• Partner with Delivery Service Partners (DSPs), Operations Managers, Area Managers, and Learning Teams to coordinate, facilitate, and measure training related activities. \u003cbr/\u003e• Have a detailed understanding of processes, expectations, and training requirements for all drivers across the various driver programs in operation. \u003cbr/\u003e• Provide timely and accurate reporting on the completion of trainings, compliance, safety, and maintenance duties. \u003cbr/\u003e• Execute to the standard, always working to ensure that the content and experience complement the safety, quality, and legal procedures as defined. \u003cbr/\u003e• Educate and audit driver safety and compliance standards such as: driver vehicle inspection reports, hours of service, trip planning and safe road driving practices. \u003cbr/\u003e• Track and monitor performance including on road ride behinds to measure on-road quality, adherence to standards, and identify re-training and process improvement opportunities. \u003cbr/\u003e• Drive, maneuver, and load/unload a truck as scheduled using approved equipment (dolly, etc.), with or without reasonable accommodation. \u003cbr/\u003e• Lift up to 49 pounds, stand and walk during shifts lasting up to 12 hours, and frequently push, pull, squat, bend, and reach, with or without reasonable accommodation. \u003cbr/\u003e• Work outside and drive different motor vehicles over the road. \u003cbr/\u003e• Drive in accordance with DOT requirements. \u003cbr/\u003e• Stay connected to the operation by participating in on-road processes on a regular basis \u003cbr/\u003e• Be a resource to the delivery station for driver training-related questions \u003cbr/\u003e• Work as a peer trainer on an as needed basis to support the business. \u003cbr/\u003e• Motivate, coach, and provide feedback to Delivery Associates during Training \u003cbr/\u003e• Travel to multiple sites within 50 miles of the home station and have reliable transportation \u003cbr/\u003e• Operate and navigate a 26,000 pounds or less vehicle \u003cbr/\u003e• Track performance and provide identified retraining and process improvement opportunities to further develop non-CDL driver, DOT regulated training. \u003cbr/\u003e• Effectively operate a GPS \u003cbr/\u003e• Associate may be required to gain DOT Regulation Qualification as a condition of the role \u003cbr/\u003e• Work 40 hours/week, and overtime as required\u003cbr/\u003e","department_cost_center":null,"description_short":"This full-time position requires in-role training at an operating site which will be 5+ weeks in duration.This training will be located 50+ miles away from the home site location. All travel accommodations","display_distance":null,"id":"34d2441d-fdaf-4841-9757-7c3dd0381086","id_icims":"3171749","is_intern":null,"is_manager":null,"job_category":"Fulfillment Associate","job_family":"Fulfillment Center","job_function_id":null,"job_path":"/en/jobs/3171749/delivery-trainer-rsr","job_schedule_type":"full-time","location":"US, MN, Stewartville","locations":["{\"normalizedStateName\":\"Minnesota\",\"normalizedCountryCode\":\"USA\",\"city\":\"Stewartville\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, MN, Stewartville\",\"coordinates\":\"43.85556,-92.48836\",\"normalizedCountyName\":\"Olmsted\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Stewartville, Minnesota, USA\",\"location\":\"US, MN, Stewartville\",\"region\":\"MN\",\"buildingCodeList\":[\"WMN6\"],\"normalizedCityName\":\"Stewartville\"}"],"normalized_location":"Stewartville, Minnesota, USA","optional_search_labels":[],"posted_date":"February  2, 2026","preferred_qualifications":"- Associate’s or Bachelor’s Degree, and/or prior Amazon experience\u003cbr/\u003e- Demonstrates problem solving and analytical skills\u003cbr/\u003e- Ability to communicate effectively (written and verbal) across various levels of an organization\u003cbr/\u003e- History of meeting/exceeding departmental goals\u003cbr/\u003e- Experience leading teams\u003cbr/\u003e- Capable of providing direction to team members using independent judgment\u003cbr/\u003e- Organization and time management skills\u003cbr/\u003e- Experience delivering training both to individuals and groups\u003cbr/\u003e- 2+ years of professional driving experience\u003cbr/\u003e- Bachelor’s Degree or 2+ years Amazon experience\u003cbr/\u003e- Knowledge of instructional theories: adult learning, on the job learning, knowledge management theories, virtual and classroom instruction\u003cbr/\u003e- Strong organizational, interpersonal, and communication skills\u003cbr/\u003e- Proven ability to deal with ambiguity and competing priorities Amazon is committed to a diverse and inclusive workplace.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003eThe starting pay for this position is listed below including the base pay rate plus the highest available shift differential which applies depending on the shift you select. As a total compensation company, you are eligible for additional earnings including overtime pay and performance bonuses. Final pay will be based on factors including shift selection and location. Starting Day 1 of employment, Amazon offers EAP, Mental Health Support, Medical Advice Line, 401(k) matching. Learn more about our benefits at \u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://hiring.amazon.com/why-amazon/benefits\"\u003ehttps://hiring.amazon.com/why-amazon/benefits\u003c/a\u003e.\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, MN, Stewartville - 22.00 - 22.00 USD hourly","primary_search_label":"fulfillment-ops-team.fulfillment-associates","source_system":"JobCreator","state":"MN","title":"Delivery Trainer, RSR","university_job":null,"updated_time":"12 minutes","url_next_step":"https://account.amazon.com/jobs/3171749/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"fulfillment-associates","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- High school or equivalent\u003cbr/\u003e- Work a flexible schedule/shift/work area, including weekends, nights, and/or holidays\u003cbr/\u003e- Can lift up to 49 pounds, stand/walk during shifts lasting up to 12 hours, and be able to frequently push, pull, squat, bend, and reach\u003cbr/\u003e- Work 40 hours/week, and overtime as required\u003cbr/\u003e- Valid and active driver's license\u003cbr/\u003e- 1+ years of Microsoft Office products and applications experience\u003cbr/\u003e- Are 21 years of age or older\u003cbr/\u003e- Must be able to obtain and maintain a Driver Qualification File\u003cbr/\u003e- Must have experience delivering training to both individuals and groups","business_category":"transportation-shipping-logistics","city":"Gypsum","company_name":"Amazon.com Services LLC","country_code":"USA","description":"Application deadline: Applications will be accepted on an ongoing basis\u003cbr/\u003e\u003cbr/\u003eThis position requires in-role training at an operating site which will be 5+ weeks in duration.\u003cbr/\u003e\u003cbr/\u003eThis training will be located 50+ miles away from the home site location. All travel accommodations for training will be booked and paid for by Amazon.\u003cbr/\u003e\u003cbr/\u003eSince opening our 'virtual' doors in 1995, we’ve been pushing the boundaries of ‘possible’ further and further. Our entire business works hard to delight our customers – from the second an order is placed online to the seamless coordination of that order behind the scenes, we strive to stay agile, fluid and intentional. That can be described in one of our core Leadership Principles, which is Bias for Action. This means that our teams band together, roll up their sleeves, and aren’t content with just standing still. We’re aiming to become the most customer-centric company on Earth. \u003cbr/\u003e\u003cbr/\u003eRural Super Rural (RSR) is an exciting organization within Amazon dedicated to ensuring our customers receive their deliveries and are satisfied with their service, even in our most remote area. We are a combination of operations and support teams aligned to continually strive to innovate the last mile delivery process while bringing smiles to our customer’s faces. \u003cbr/\u003e\u003cbr/\u003eAmazon is seeking self-motivated Driver Trainers to join our team and help build a network of customer-centric Delivery Associates in the communities where we operate. As a Driver Trainer, you have a passion for mentoring others; you are comfortable teaching and guiding conversations in large groups; and you believe in hands-on training and conducting drive-alongs with Delivery Associates to instill safe practices.\u003cbr/\u003e\u003cbr/\u003eAs a Driver Trainer, you are responsible for establishing the right driver training culture in your delivery station, setting up the training experience, and independently instructing training sessions. You educate Delivery Associates on the foundational safety, quality, and productivity aspects that are an important part of the Delivery Associate daily routine. You enable the success of Delivery Associates by adapting to different learning styles and taking a hands-on training approach to demonstrate what good looks like. You exhibit Learn and Be Curious by answering all Delivery Associates’ questions and finding the answers if you are not sure of the correct response.\u003cbr/\u003e\u003cbr/\u003eAs a Driver Trainer, you are expected to lead by example and demonstrate the Amazon Leadership Principles at all times. In this position you will play a key role in keeping our commitment to exceed customer expectations by ensuring Delivery Associates are set up for success to deliver customer orders, large or small, on time at the right place.\u003cbr/\u003e\u003cbr/\u003eDue to interstate operating authority commerce regulations, candidates must be at least 21 years or older. Candidate must hold a valid state-appropriate driver’s license, be able to obtain and maintain their Driver Qualification File (DQF), and be eligible to drive in accordance with Department of Transportation (DOT) requirements.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Facilitate daily training classes for up to 30 people, including in-station classes and drive-alongs \u003cbr/\u003e- Partner with Delivery Service Partners (DSPs), Operations Managers, Area Managers, and Learning Teams to coordinate, facilitate, and measure training related activities. \u003cbr/\u003e- Have a detailed understanding of processes, expectations, and training requirements for all drivers across the various driver programs in operation. \u003cbr/\u003e- Provide timely and accurate reporting on the completion of trainings, compliance, safety, and maintenance duties. \u003cbr/\u003e- Execute to the standard, always working to ensure that the content and experience complement the safety, quality, and legal procedures as defined. \u003cbr/\u003e- Educate and audit driver safety and compliance standards such as: driver vehicle inspection reports, hours of service, trip planning and safe road driving practices. \u003cbr/\u003e- Track and monitor performance including on road ride behinds to measure on-road quality, adherence to standards, and identify re-training and process improvement opportunities. \u003cbr/\u003e- Drive, maneuver, and load/unload a truck as scheduled using approved equipment (dolly, etc.), with or without reasonable accommodation. \u003cbr/\u003e- Lift up to 49 pounds, stand and walk during shifts lasting up to 12 hours, and frequently push, pull, squat, bend, and reach, with or without reasonable accommodation. \u003cbr/\u003e- Work outside and drive different motor vehicles over the road. \u003cbr/\u003e- Drive in accordance with DOT requirements. \u003cbr/\u003e- Stay connected to the operation by participating in on-road processes on a regular basis \u003cbr/\u003e- Be a resource to the delivery station for driver training-related questions \u003cbr/\u003e- Work as a peer trainer on an as needed basis to support the business. \u003cbr/\u003e- Motivate, coach, and provide feedback to Delivery Associates during Training \u003cbr/\u003e- Travel to multiple sites within 50 miles of the home station and have reliable transportation \u003cbr/\u003e- Operate and navigate a 26,000 pounds or less vehicle \u003cbr/\u003e- Track performance and provide identified retraining and process improvement opportunities to further develop non-CDL driver, DOT regulated training. \u003cbr/\u003e- Effectively operate a GPS \u003cbr/\u003e- Associate may be required to gain DOT Regulation Qualification as a condition of the role \u003cbr/\u003e- Work 40 hours/week, and overtime as required\u003cbr/\u003e","department_cost_center":null,"description_short":"This position requires in-role training at an operating site which will be 5+ weeks in duration.This training will be located 50+ miles away from the home site location. All travel accommodations for training","display_distance":null,"id":"35a40909-e089-461d-a0a3-efa6389a04c1","id_icims":"3145858","is_intern":null,"is_manager":null,"job_category":"Fulfillment \u0026 Operations Management","job_family":"Fulfillment Center","job_function_id":null,"job_path":"/en/jobs/3145858/delivery-trainer-rsr","job_schedule_type":"full-time","location":"US, CO, Gypsum","locations":["{\"normalizedStateName\":\"Colorado\",\"normalizedCountryCode\":\"USA\",\"city\":\"Gypsum\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, CO, Gypsum\",\"coordinates\":\"39.64479,-106.94957\",\"normalizedCountyName\":\"Eagle\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Gypsum, Colorado, USA\",\"location\":\"US, CO, Gypsum\",\"region\":\"CO\",\"buildingCodeList\":[\"WOL1\"],\"normalizedCityName\":\"Gypsum\"}"],"normalized_location":"Gypsum, Colorado, USA","optional_search_labels":["hourly"],"posted_date":"December 18, 2025","preferred_qualifications":"- Associate’s or Bachelor’s Degree, and/or prior Amazon experience\u003cbr/\u003e- Demonstrates problem solving and analytical skills\u003cbr/\u003e- Ability to communicate effectively (written and verbal) across various levels of an organization\u003cbr/\u003e- History of meeting/exceeding departmental goals\u003cbr/\u003e- Experience leading teams\u003cbr/\u003e- Capable of providing direction to team members using independent judgment\u003cbr/\u003e- Organization and time management skills\u003cbr/\u003e- Experience delivering training both to individuals and groups\u003cbr/\u003e- 2+ years of professional driving experience\u003cbr/\u003e- Bachelor’s Degree or 2+ years Amazon experience\u003cbr/\u003e- Knowledge of instructional theories: adult learning, on the job learning, knowledge management theories, virtual and classroom instruction\u003cbr/\u003e- Strong organizational, interpersonal, and communication skills\u003cbr/\u003e- Proven ability to deal with ambiguity and competing priorities Amazon is committed to a diverse and inclusive workplace.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003eThe starting pay for this position is listed below including the base pay rate plus the highest available shift differential which applies depending on the shift you select. As a total compensation company, you are eligible for additional earnings including overtime pay and performance bonuses. Final pay will be based on factors including shift selection and location. Starting Day 1 of employment, Amazon offers EAP, Mental Health Support, Medical Advice Line, 401(k) matching. Learn more about our benefits at \u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://hiring.amazon.com/why-amazon/benefits\"\u003ehttps://hiring.amazon.com/why-amazon/benefits\u003c/a\u003e.\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, CO, Gypsum - 25.00 - 25.00 USD hourly","primary_search_label":"transportation-shipping-logistics.rural-super-rural","source_system":"JobCreator","state":"CO","title":"Delivery Trainer, RSR","university_job":null,"updated_time":"12 minutes","url_next_step":"https://account.amazon.com/jobs/3145858/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"rural-super-rural","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 3+ years of program or project management experience\u003cbr/\u003e- 3+ years of working cross functionally with tech and non-tech teams experience\u003cbr/\u003e- 3+ years of defining and implementing process improvement initiatives using data and metrics experience\u003cbr/\u003e- 2+ years of supply chain experience\u003cbr/\u003e- Bachelor's degree\u003cbr/\u003e- Knowledge of Excel (Pivot Tables, VLookUps) at an advanced level and SQL\u003cbr/\u003e- Experience defining program requirements and using data and metrics to determine improvements","business_category":"fulfillment-ops","city":"Arlington","company_name":"Amazon.com Services LLC","country_code":"USA","description":"The Supply Chain Program Manager, Launch Expansion is responsible for management and coordination of procurement tasks to support the on-time delivery of goods and services for new Amazon Fulfillment Centers. The Supply Chain Specialist will also be responsible for monitoring and executing project progress and performance, proactively identifying risks and managing mitigation plans. The person in this role will have excellent communication skills to build and maintain effective stakeholder relationships and have the ability to focus simultaneously on short term deliverables and continuous improvement initiatives to deliver long term value to internal customers.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Demonstrate ownership, management and coordination of procurement tasks and dependencies to ensure goods and services critical to the launch of new sites are planned for, ordered and delivered on time \u003cbr/\u003e- Track and report project progress and performance, proactively identify risks, issues and manage mitigation plans when necessary \u003cbr/\u003e- Track Purchase Order status and work with suppliers to ensure on-time delivery of all equipment \u003cbr/\u003e- Partner with Category Managers with the objective of standardizing category order and escalation processes, driving effective two-way communication and mitigating risks related to all NA launches \u003cbr/\u003e- Provide guidance, coaching and technical support to internal customers to embed use of best practice processes \u003cbr/\u003e- Build and maintain effective stakeholder relationships with internal customers in the Start Up and Launch teams, ensuring regular communication channels are in place \u003cbr/\u003e- Lead set up of all standard procurement procedures for new sites and identify ways to streamline existing processes to remove waste across multiple businesses groups and categories\u003cbr/\u003e- Manage Supplier Relationship, including inventory management, risks and long term supply chain strategies\u003cbr/\u003e- Define key performance indicators – develop metrics and service level agreements for core programs \u003cbr/\u003e- Partner with internal customers to positively influence spending decisions\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eAmazon offers a full range of benefits that support you and eligible family members, including domestic partners and their children. Benefits can vary by location, the number of regularly scheduled hours you work, length of employment, and job status such as seasonal or temporary employment. The benefits that generally apply to regular, full-time employees include:\u003cbr/\u003e1. Medical, Dental, and Vision Coverage\u003cbr/\u003e2. Maternity and Parental Leave Options\u003cbr/\u003e3. Paid Time Off (PTO)\u003cbr/\u003e4. 401(k) Plan\u003cbr/\u003e\u003cbr/\u003eIf you are not sure that every qualification on the list above describes you exactly, we'd still love to hear from you! At Amazon, we value people with unique backgrounds, experiences, and skillsets. If you’re passionate about this role and want to make an impact on a global scale, please apply!     \u003cbr/\u003e","department_cost_center":null,"description_short":"The Supply Chain Program Manager, Launch Expansion is responsible for management and coordination of procurement tasks to support the on-time delivery of goods and services for new Amazon Fulfillment Centers.","display_distance":null,"id":"67e8db19-5d8a-45e5-85ca-13375fc05c16","id_icims":"3170854","is_intern":null,"is_manager":null,"job_category":"Project/Program/Product Management--Non-Tech","job_family":"Supply Chain Management","job_function_id":null,"job_path":"/en/jobs/3170854/supply-chain-program-manager-launch-expansion-supply-chain-program-manager-site-procurement-ops-spo-fixe-1440","job_schedule_type":"full-time","location":"US, VA, Arlington","locations":["{\"normalizedStateName\":\"Tennessee\",\"normalizedCountryCode\":\"USA\",\"city\":\"Nashville\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, TN, Nashville\",\"coordinates\":\"36.16792,-86.77798\",\"normalizedCountyName\":\"Davidson\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Nashville, Tennessee, USA\",\"location\":\"US, TN, Nashville\",\"region\":\"TN\",\"buildingCodeList\":[\"BNA12\"],\"normalizedCityName\":\"Nashville\"}","{\"normalizedStateName\":\"Washington\",\"normalizedCountryCode\":\"USA\",\"city\":\"Bellevue\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, WA, Bellevue\",\"coordinates\":\"47.61001,-122.1872\",\"normalizedCountyName\":\"King\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Bellevue, Washington, USA\",\"location\":\"US, WA, Bellevue\",\"region\":\"WA\",\"buildingCodeList\":[\"SEA104\"],\"normalizedCityName\":\"Bellevue\"}","{\"normalizedStateName\":\"Virginia\",\"normalizedCountryCode\":\"USA\",\"city\":\"Arlington\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, VA, Arlington\",\"coordinates\":\"38.8905,-77.08629\",\"normalizedCountyName\":\"Arlington\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Arlington, Virginia, USA\",\"location\":\"US, VA, Arlington\",\"region\":\"VA\",\"buildingCodeList\":[\"WAS19\"],\"normalizedCityName\":\"Arlington\"}","{\"normalizedStateName\":\"New Jersey\",\"normalizedCountryCode\":\"USA\",\"city\":\"West Deptford\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, NJ, West Deptford\",\"coordinates\":\"39.84164,-75.19889\",\"normalizedCountyName\":\"Gloucester\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"West Deptford Twp, New Jersey, USA\",\"location\":\"US, NJ, West Deptford\",\"region\":\"NJ\",\"buildingCodeList\":[\"ACY1\"],\"normalizedCityName\":\"West Deptford Twp\"}","{\"normalizedStateName\":\"Texas\",\"normalizedCountryCode\":\"USA\",\"city\":\"Houston\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, TX, Houston\",\"coordinates\":\"29.76078,-95.36952\",\"normalizedCountyName\":\"Harris\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Houston, Texas, USA\",\"location\":\"US, TX, Houston\",\"region\":\"TX\",\"buildingCodeList\":[\"HOU18\"],\"normalizedCityName\":\"Houston\"}"],"normalized_location":"Arlington, Virginia, USA","optional_search_labels":[],"posted_date":"January 30, 2026","preferred_qualifications":"- 3+ years of driving end to end delivery, and communicating results to senior leadership experience\u003cbr/\u003e- 3+ years of driving process improvements experience\u003cbr/\u003e- Experience in stakeholder management, dealing with multiple stakeholders at varied levels of the organization\u003cbr/\u003e- Experience building processes, project management, and schedules\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003eThe base salary range for this position is listed below. Your Amazon package will include sign-on payments and restricted stock units (RSUs). Final compensation will be determined based on factors including experience, qualifications, and location. Amazon also offers comprehensive benefits including health insurance (medical, dental, vision, prescription, Basic Life \u0026amp; AD\u0026amp;D insurance and option for Supplemental life plans, EAP, Mental Health Support, Medical Advice Line, Flexible Spending Accounts, Adoption and Surrogacy Reimbursement coverage), 401(k) matching, paid time off, and parental leave. Learn more about our benefits at \u003c/span\u003e\u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://amazon.jobs/en/benefits\"\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003ehttps://amazon.jobs/en/benefits\u003c/span\u003e\u003c/a\u003e\u003cspan style=\"color: rgb(35, 47, 62)\" class=\"ProseMirror-FontColor\"\u003e.\u003c/span\u003e\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, NJ, West Deptford - 85,800.00 - 128,600.00 USD annually\u003cbr/\u003eUSA, TN, Nashville - 77,200.00 - 115,800.00 USD annually\u003cbr/\u003eUSA, TX, Houston - 85,800.00 - 128,600.00 USD annually\u003cbr/\u003eUSA, VA, Arlington - 85,800.00 - 128,600.00 USD annually\u003cbr/\u003eUSA, WA, Bellevue - 85,800.00 - 128,600.00 USD annually","primary_search_label":"fulfillment-ops.team-procurement","source_system":"JobCreator","state":"VA","title":"Supply Chain Program Manager, Launch \u0026 Expansion, Supply Chain Program Manager , Site Procurement OPs(SPO)-FIXE (1440)","university_job":null,"updated_time":"15 minutes","url_next_step":"https://account.amazon.com/jobs/3170854/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-procurement","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Advanced proficiency in local language in both written and verbal communication\u003cbr/\u003e- Previous experience in a customer service environment\u003cbr/\u003e- Relevant experience working with data analytics and using these metrics to identify problems\u003cbr/\u003e- Excellent listening skills; able to demonstrate empathy and willingness to help\u003cbr/\u003e- Able to troubleshoot, research and effectively translate technical and procedural instructions to customers in a way they can understand\u003cbr/\u003e- Relevant experience working with the MS Office suite (Word, Excel, Outlook) in a professional environment","business_category":"amazon-customer-service","city":"Swansea","company_name":"Project Kite - UK Parent","country_code":"GBR","description":"Veeqo is a multi-channel shipping software built to simplify fast-growth e-commerce. Acquired by Amazon in 2021, Veeqo helps sellers cut shipping costs while increasing the speed of fulfilling customer orders. Selected candidate(s) as Seller Support Associates will serve as the first-line support partners to act as the primary interface for our Veeqo customers, providing phone, email and live chat support.\u003cbr/\u003e\u003cbr/\u003eOur team in Swansea will be responsible for providing timely and accurate operational support to customers on our internal platform, offering a first class customer experience in all interactions. A First Line Support Agent will also identify chronic system issues, provide process improvements and recommendations, develop internal documentation, and contribute to a team environment.\u003cbr/\u003e\u003cbr/\u003eThe Sr. First Line Support Agent demonstrates end-to-end ownership of every seller interaction and handles proactive problem solving to provide exceptional support to our customers. Able to deal with pressure and satisfy customer concerns or frustration even in the most challenging of environments, our first line support can diffuse complex situations, ensuring customer satisfaction.\u003cbr/\u003e\u003cbr/\u003eThe successful candidate will work a five-day shift pattern running from Monday through Friday, with Saturday and Sunday as rest days. \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eAs part of your role, you will have the opportunity to:\u003cbr/\u003e\u003cbr/\u003eSupport Veeqo's Selling Partner’s to solve any incoming issues via 3 channels of communication (Phone, Email \u0026 Chat).\u003cbr/\u003eManage high volumes of inbound and outbound calls, emails and chats in a timely manner.\u003cbr/\u003eIdentify customers’ needs, clarify information, research every issue and providing solutions.\u003cbr/\u003eExemplify Amazons Leadership Principle for Customer Obsession by consistently displaying a genuine empathy and passion for our customers, delivering an exceptional customer care experience with every contact.\u003cbr/\u003eBuild sustainable relationships and engaging customers by going the extra mile.\u003cbr/\u003eOversee and achieve various productivity and quality targets and metrics.\u003cbr/\u003eCollaborate with various internal stakeholders and teams.\u003cbr/\u003eTroubleshoot and provide product guidance and support to all Veeqo Sellers and Vendors.\u003cbr/\u003eAttend and conduct regular training sessions, learn product details and key selling points of products and technologies.\u003cbr/\u003eAny other duties and special projects as directed by management in keeping with the employee’s skills and experience\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eEach day begins with a team huddle 30 minutes into the shift, creating a collaborative space where team members share updates, seek peer support on complex cases, and receive important announcements from management. The workday is strategically structured to balance dedicated ticket-handling time with project work, allowing team members to contribute to key initiatives such as trend analysis, process documentation, and training development – ensuring both immediate customer support and long-term service improvements.","department_cost_center":null,"description_short":"Veeqo is a multi-channel shipping software built to simplify fast-growth e-commerce. Acquired by Amazon in 2021, Veeqo helps sellers cut shipping costs while increasing the speed of fulfilling customer","display_distance":null,"id":"dad71891-1931-49ee-9e67-c3db78a28ae9","id_icims":"3055253","is_intern":null,"is_manager":null,"job_category":"Customer Service","job_family":"Seller Support Operations","job_function_id":null,"job_path":"/en/jobs/3055253/customer-support-sr-veeqo","job_schedule_type":"full-time","location":"GB, Swansea","locations":["{\"normalizedStateName\":\"Wales\",\"normalizedCountryCode\":\"GBR\",\"city\":\"Swansea\",\"countryIso3a\":\"GBR\",\"countryIso2a\":\"GB\",\"locationNonStemming\":\"United Kingdom, Swansea\",\"coordinates\":\"51.62315,-3.94083\",\"normalizedCountyName\":\"West Glamorgan\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United Kingdom\",\"normalizedLocation\":\"Swansea, Wales, GBR\",\"location\":\"GB, Swansea\",\"region\":\"\",\"buildingCodeList\":[\"SWS11\"],\"normalizedCityName\":\"Swansea\"}"],"normalized_location":"Swansea, Wales, GBR","optional_search_labels":[],"posted_date":"August  9, 2025","preferred_qualifications":"- Business acumen in areas of e-commerce and retail is advantageous\u003cbr/\u003e-  2 or more years experience within a customer service/contact centre environment would be an advantage\u003cbr/\u003e- Ability to work against and deliver performance in metric driven environment with high productivity and quality standards\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunities employer. We believe passionately that employing a diverse workforce is central to our success. We make recruiting decisions based on your experience and skills. We value your passion to discover, invent, simplify and build. Protecting your privacy and the security of your data is a longstanding top priority for Amazon. Please consult our Privacy Notice (\u003ca href=\"https://www.amazon.jobs/en/privacy_page\"\u003ehttps://www.amazon.jobs/en/privacy_page\u003c/a\u003e) to know more about how we collect, use and transfer the personal data of our candidates.\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"amazon-customer-service.team-associates","source_system":"JobCreator","state":null,"title":"Customer Support Sr., Veeqo","university_job":null,"updated_time":"19 minutes","url_next_step":"https://account.amazon.com/jobs/3055253/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-associates","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Bachelor's degree or equivalent\u003cbr/\u003e- 1+ years of Excel or Tableau (data manipulation, macros, charts and pivot tables) experience\u003cbr/\u003e- Experience creating complex SQL queries joining multiple datasets, ETL DW concepts","business_category":"selling-partner-services","city":"Bengaluru","company_name":"ADCI - Karnataka","country_code":"IND","description":"Amazon’s Account Integrity Team (AIT) within the Selling Partner Support organization is looking for a passionate, results-oriented Capacity Planning and Workforce Management (WFM) Analyst (similar to Business Analyst) to develop and execute annual and quarterly capacity planning cycles, manage the workforce schedules and lead the operations analytics and reporting. The incumbent will act as single point of contact for entire AIT and their key partners including Finance. The AIT team owns designing and building high performance software systems using machine learning that identify and prevent fraudulent activity and maintain high trust levels with our customers. Fraud and abuse prevention is a real-money game where our software and analytics teams strive to outsmart those who attempt to defraud Amazon and our customers.\u003cbr/\u003e\u003cbr/\u003eCapacity Planning and WFM Analyst is an Individual Contributor for AIT, where you will i) collaborate with Program Managers, ML Managers, Operation Managers, and Risk Managers to understand the short-term and long-term business requirement to develop 5 capacity plans in a year and other process improvement related documents, ii) do workforce management, iii) build data pipelines and dashboards for Risk Mining and AIIS team, iv) build prediction models, Gen AI tools and drive automation initiatives. \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Develop and Maintain data sets and pipelines and lead reporting to track and manage important KPIs and goals across Risk Mining and Investigation Operations.\u003cbr/\u003e- Collaborate with stakeholders and develop capacity plans to present to leadership \u003cbr/\u003e- Drive real-time adherence to the expected capacity against the actual performance to achieve service levels and efficiency metric goals \u003cbr/\u003e- Communicate and callout changes to incoming contact patterns to operations and program team\u003cbr/\u003e- Publish Weekly Business Reviews (WBRs) and focus on optimizing and automating the data pipeline\u003cbr/\u003e- Support the the design, development, and maintenance of ongoing metrics, reports, analyses, dashboards, etc. within SQL and other BI tools\u003cbr/\u003e- Identify the process gaps and build mechanisms to improve the processes\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003e1. Build and run data pipelines to publish high quality WBR deck on time\u003cbr/\u003e2. Perform data analysis to provide insights to Operations, Risk Mining and Product teams\u003cbr/\u003e3. Lead the workforce management to ensure the Ops metrics are meeting the targets\u003cbr/\u003e4. Collaborate with stakeholders to understand their short-term and long-term requirement to build annual and quarterly capacity plans\u003cbr/\u003e5. Work with finance partners and contribute to Monthly and Quarterly Finance Reviews\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eThis role will support existing teams that are based out of Costa Rica, India and the US.","department_cost_center":null,"description_short":"Amazon’s Account Integrity Team (AIT) within the Selling Partner Support organization is looking for a passionate, results-oriented Capacity Planning and Workforce Management (WFM) Analyst (similar to","display_distance":null,"id":"4e0bd48b-5b6d-4751-83ef-04c0b41af438","id_icims":"3172672","is_intern":null,"is_manager":null,"job_category":"Business Intelligence","job_family":"Planning/Development","job_function_id":null,"job_path":"/en/jobs/3172672/cap-planning-wfm-analyst-account-integrity","job_schedule_type":"full-time","location":"IN, KA, Bengaluru","locations":["{\"normalizedStateName\":\"Karnataka\",\"normalizedCountryCode\":\"IND\",\"city\":\"Bengaluru\",\"countryIso3a\":\"IND\",\"countryIso2a\":\"IN\",\"locationNonStemming\":\"India, KA, Bengaluru\",\"coordinates\":\"12.96617,77.58692\",\"normalizedCountyName\":\"Bengaluru\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"India\",\"normalizedLocation\":\"Bengaluru, Karnataka, IND\",\"location\":\"IN, KA, Bengaluru\",\"region\":\"KA\",\"buildingCodeList\":[\"BLR27\"],\"normalizedCityName\":\"Bengaluru\"}"],"normalized_location":"Bengaluru, Karnataka, IND","optional_search_labels":[],"posted_date":"February  3, 2026","preferred_qualifications":"- Master's degree in business, engineering, statistics, computer science, mathematics or related field\u003cbr/\u003e- Ability to leverage Gen AI tools\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"selling-partner-services.no-team-listed","source_system":"JobCreator","state":"KA","title":"Cap Planning \u0026 WFM Analyst, Account Integrity","university_job":null,"updated_time":"23 minutes","url_next_step":"https://account.amazon.com/jobs/3172672/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"no-team-listed","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 1+ years of electrical or mechanical experience\u003cbr/\u003e- 1+ years’ experience with Microsoft Office products\u003cbr/\u003e- Ability to work on a flexible schedule including days, nights, and/or weekends.","business_category":"aws","city":"Lithia Springs","company_name":"Amazon Data Services, Inc.","country_code":"USA","description":"How would you like to be a part of Earth’s most customer-centric company? You would work with teams of front-line responders who support the operations of some of the world’s most Customer Centric data centers. Our Data Center Engineering Operations team maintain and operate our critical infrastructure systems so that they are prepared to stand up against any situation.\u003cbr/\u003e\u003cbr/\u003eAWS has the world’s largest cloud computing portfolio. As an Amazonian you will work in some of the most sophisticated, safe, and secure data centers in the world. Our Engineering Operations Technicians (EOT’s) help keep them that way by working with the brightest minds from around the globe to help test and implement the newest technology and work practices to meet the demands of a changing market.\u003cbr/\u003e\u003cbr/\u003eWe have a passion for learning and evolving, it’s how we have helped define ourselves as leaders in the industry. Let’s work hard, have fun, and make history!\u003cbr/\u003e\u003cbr/\u003eAWS Infrastructure Services owns the design, planning, delivery, and operation of all AWS global infrastructure. In other words, we’re the people who keep the cloud running. We support all AWS data centers and all of the servers, storage, networking, power, and cooling equipment that ensure our customers have continual access to the innovation they rely on. We work on the most challenging problems, with thousands of variables impacting the supply chain — and we’re looking for talented people who want to help. \u003cbr/\u003e\u003cbr/\u003eYou’ll join a diverse team of software, hardware, and network engineers, supply chain specialists, security experts, operations managers, and other vital roles. You’ll collaborate with people across AWS to help us deliver the highest standards for safety and security while providing seemingly infinite capacity at the lowest possible cost for our customers. And you’ll experience an inclusive culture that welcomes bold ideas and empowers you to own them to completion.\u003cbr/\u003e\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Daily building rounds to monitor and record information from electrical, mechanical, and fire/life safety equipment to ensure 24/7 reliability and availability\u003cbr/\u003e- Monitor Building Management Systems (BMS) and Electrical Power Management System (EPMS)\u003cbr/\u003e- Assist in troubleshooting of facility and rack-level events within internal Service Level Agreements (SLA)\u003cbr/\u003e- Perform rack installs and rack decommissioning within internal SLA\u003cbr/\u003e- Perform PM, troubleshooting, root cause analysis, and repair of electrical and mechanical equipment\u003cbr/\u003e- Technical writing to support change management program\u003cbr/\u003e- Monitor daily work requests and manage to resolution, and execute projects from conception to completion\u003cbr/\u003e- On-site support of contractors, sub-contractors and vendors, ensuring that all work performed is in accordance with established practices, procedures \u0026 local legislation\u003cbr/\u003e- Work schedule changes depending on specific site needs. Shifts can be up to 12-hours and may rotate on a predefined schedule including night shift. Some locations have on-call rotations.\u003cbr/\u003e- Role may support more than one location/site.\u003cbr/\u003e\u003cbr/\u003ePhysical Requirements:\u003cbr/\u003eWillingness and demonstrated ability to work in the following physical conditions with reasonable accommodations:\u003cbr/\u003e- Regularly lift and/or move up to 39 pounds independently\u003cbr/\u003e- Participate in group lifts for 40+ pounds\u003cbr/\u003e- Maintain balance and perform construction tasks while on a ladder\u003cbr/\u003e- Regularly walk, use hands and fingers, handle or feel, reach with hands and arms, stoop, kneel, crouch or crawl, climb stairs, twist, bend, work above shoulders, grasp, carry, push and pull objects into position\u003cbr/\u003e- Work in an environment requiring provided ear protection\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eThis role acts as Amazon’s front line when it comes to hands-on electrical and mechanical equipment preventative maintenance (PM) and troubleshooting, reporting to a site’s Data Center Facility Manager (FM). They will maintain, operate, and troubleshoot mission-critical data center facility equipment including stand-by diesel generators and related fuel systems, 3 phase electrical systems such as switchgear, UPS units, PDUs, and wet cell batteries and associated systems. Mechanical equipment includes CRAHU units, centrifugal chillers, cooling towers, water systems, air handlers and associated systems, pumps, and motors. Additional support equipment is included in the scope of the role which includes fire/life safety equipment, building automation systems, and general facilities equipment.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eWhy AWS?\u003cbr/\u003eAmazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. We pioneered cloud computing and never stopped innovating — that’s why customers from the most successful startups to Global 500 companies trust our robust suite of products and services to power their businesses.\u003cbr/\u003e\u003cbr/\u003eDiverse Experiences\u003cbr/\u003eAWS values diverse experiences. Even if you do not meet all of the qualifications and skills listed in the job description, we encourage candidates to apply. If your career is just starting, hasn’t followed a traditional path, or includes alternative experiences, don’t let it stop you from applying.\u003cbr/\u003e\u003cbr/\u003eMentorship \u0026 Career Growth\u003cbr/\u003eWe’re continuously raising our performance bar as we strive to become Earth’s Best Employer. That’s why you’ll find endless knowledge-sharing, mentorship and other career-advancing resources here to help you develop into a better-rounded professional.\u003cbr/\u003e\u003cbr/\u003eWork/Life Balance\u003cbr/\u003eWe value work-life harmony. Achieving success at work should never come at the expense of sacrifices at home, which is why we strive for flexibility as part of our working culture. When we feel supported in the workplace and at home, there’s nothing we can’t achieve in the cloud.","department_cost_center":null,"description_short":"How would you like to be a part of Earth’s most customer-centric company? You would work with teams of front-line responders who support the operations of some of the world’s most Customer Centric data","display_distance":null,"id":"e7aee6c5-12f8-4b64-880e-f04d44204290","id_icims":"3172682","is_intern":null,"is_manager":null,"job_category":"Operations, IT, \u0026 Support Engineering","job_family":"Tech Ops Engineering","job_function_id":null,"job_path":"/en/jobs/3172682/engineering-operations-technician-dceo","job_schedule_type":"full-time","location":"US, GA, Lithia Springs","locations":["{\"normalizedStateName\":\"Georgia\",\"normalizedCountryCode\":\"USA\",\"city\":\"Lithia Springs\",\"countryIso3a\":\"USA\",\"countryIso2a\":\"US\",\"locationNonStemming\":\"United States, GA, Lithia Springs\",\"coordinates\":\"33.79382,-84.66073\",\"normalizedCountyName\":\"Douglas\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"United States\",\"normalizedLocation\":\"Lithia Springs, Georgia, USA\",\"location\":\"US, GA, Lithia Springs\",\"region\":\"GA\",\"buildingCodeList\":[\"ATL88\",\"ATL73\",\"ATL8\",\"ATL250\",\"ATL82\",\"ATL72\",\"ATL81\",\"VUGO\",\"ATL701\",\"SGA2\",\"ATL68\"],\"normalizedCityName\":\"Lithia Springs\"}"],"normalized_location":"Lithia Springs, Georgia, USA","optional_search_labels":["aws.team-ais","aws.team-dc","hourly","military"],"posted_date":"February  3, 2026","preferred_qualifications":"- 2+ years of data center engineering experience\u003cbr/\u003e- Technical (Military/Trade School) training\u003cbr/\u003e- Associate or higher education in related field\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunity employer and does not discriminate on the basis of protected veteran status, disability, or other legally protected status.\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.\u003cbr/\u003e\u003cbr/\u003e\u003cp\u003eThe starting pay for this position is listed below. Final starting pay will be based on factors including experience, qualifications, and location. Starting Day 1 of employment, Amazon offers EAP, Mental Health Support, Medical Advice Line, 401(k) matching. Learn more about our benefits at \u003ca target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://hiring.amazon.com/why-amazon/benefits\"\u003ehttps://hiring.amazon.com/why-amazon/benefits\u003c/a\u003e.\u003c/p\u003e\u003cbr/\u003e\u003cbr/\u003eUSA, GA, LITHIA SPRINGS - 31.00 - 55.00 USD hourly\u003cbr/\u003eUSA, GA, Lithia Springs - 31.00 - 55.00 USD hourly","primary_search_label":"aws.team-support-engineer-primary","source_system":"JobCreator","state":"GA","title":"Engineering Operations Technician , DCEO","university_job":null,"updated_time":"24 minutes","url_next_step":"https://account.amazon.com/jobs/3172682/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-support-engineer-primary","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- 4+ years of quality assurance engineering experience\u003cbr/\u003e- Experience in automation testing\u003cbr/\u003e- Experience in manual testing\u003cbr/\u003e- Experience as QA lead on medium to large sized projects","business_category":"alexa-and-amazon-devices","city":"Pune","company_name":"Amazon Dev Center India - Hyderabad","country_code":"IND","description":"The Quality Assurance Engineer (QAE) role in Alexa Endpoints team focuses on testing next-generation AI-powered features across multiple device platforms, with a deep emphasis on core Alexa SDK implementation for iOS and Android. The role involves comprehensive testing of Alexa+ capabilities, which include advanced conversational interactions and generative AI-powered assistive technologies.\u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003eKey testing responsibilities will span critical endpoints including Android, iOS, and other device platforms. The QAE will be responsible for developing and maintaining test suites that cover voice interactions, text interactions, mobile-specific flows, and cross-platform testing requirements.","department_cost_center":null,"description_short":"The Quality Assurance Engineer (QAE) role in Alexa Endpoints team focuses on testing next-generation AI-powered features across multiple device platforms, with a deep emphasis on core Alexa SDK implementation","display_distance":null,"id":"a857222c-bd4e-4d37-a400-e18b7a26f5ed","id_icims":"3150493","is_intern":null,"is_manager":null,"job_category":"Systems, Quality, \u0026 Security Engineering","job_family":"Systems Quality","job_function_id":null,"job_path":"/en/jobs/3150493/quality-assurance-engineer-ii-alexa-endpoints","job_schedule_type":"full-time","location":"IN, MH, Pune","locations":["{\"normalizedStateName\":\"Maharashtra\",\"normalizedCountryCode\":\"IND\",\"city\":\"Pune\",\"countryIso3a\":\"IND\",\"countryIso2a\":\"IN\",\"locationNonStemming\":\"India, MH, Pune\",\"coordinates\":\"18.50419,73.85286\",\"normalizedCountyName\":\"Pune\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"India\",\"normalizedLocation\":\"Pune, Maharashtra, IND\",\"location\":\"IN, MH, Pune\",\"region\":\"MH\",\"buildingCodeList\":[\"PNQ13\"],\"normalizedCityName\":\"Pune\"}","{\"normalizedStateName\":\"Telangana\",\"normalizedCountryCode\":\"IND\",\"city\":\"Hyderabad\",\"countryIso3a\":\"IND\",\"countryIso2a\":\"IN\",\"locationNonStemming\":\"India, TS, Hyderabad\",\"coordinates\":\"17.3949,78.47081\",\"normalizedCountyName\":\"Hyderabad\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"India\",\"normalizedLocation\":\"Hyderabad, Telangana, IND\",\"location\":\"IN, TS, Hyderabad\",\"region\":\"TS\",\"buildingCodeList\":[\"HYD13\"],\"normalizedCityName\":\"Hyderabad\"}"],"normalized_location":"Pune, Maharashtra, IND","optional_search_labels":[],"posted_date":"December 31, 2025","preferred_qualifications":"- Experience with at least one automated test framework like Selenium or Appium\u003cbr/\u003e- Experience in gathering test requirements to create detailed test plans and defining quality metrics to measure product quality\u003cbr/\u003e- Experience with Android, iOS or other mobile application development or testing\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"alexa-and-amazon-devices.devices-and-services-teams","source_system":"JobCreator","state":"MH","title":"Quality Assurance Engineer II, Alexa Endpoints","university_job":null,"updated_time":"25 minutes","url_next_step":"https://account.amazon.com/jobs/3150493/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"devices-and-services-teams","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}},{"basic_qualifications":"- Ein Bachelorabschluss oder eine gleichwertige Qualifikation entsprechend dem Europäischen Qualifikationsrahmen (EQF)\u003cbr/\u003e- Zertifizierung als „Fachkraft für Arbeitssicherheit“\u003cbr/\u003e- Verständnis der deutschen Umwelt- und Arbeitsschutz-Gesetzgebung\u003cbr/\u003e- Fortgeschrittene Deutsch- und Englischkenntnisse","business_category":"fulfillment-ops","city":"Witten","company_name":"Amazon SZ NRW GmbH - I47","country_code":"DEU","description":"Arbeitsschutz und Wohlergehen unserer Mitarbeiter:innen haben für Amazon höchste Priorität. Unsere Safety Specialists spielen dabei eine entscheidende Rolle. In dieser Funktion sorgst Du proaktiv für die Sicherheit und Gesundheit aller Mitarbeiter:innen an Deinem Standort, gibst ihnen Zuversicht und motivierst sie zu Höchstleistungen. Du kannst jeden Tag etwas für sie bewirken. \u003cbr/\u003e\u003cbr/\u003eKey job responsibilities\u003cbr/\u003e- Überwachung der Standortleistung anhand festgelegter KPIs und Erstellung von Plänen zur Verbesserung von Prozessen\u003cbr/\u003e- Entwicklung von Programmen für den Arbeitsschutz und Planung von Schulungen\u003cbr/\u003e- Auswertung von Sicherheitskennzahlen und Trends bei Vorfällen; Unterstützung der Mitarbeiter:innen bei der Ressourcenplanung für Risikobereiche\u003cbr/\u003e- Durchführung von Prüfungen zur Einhaltung der Arbeitsschutzvorschriften und Umsetzung von Lösungen, wenn Risiken erkannt werden\u003cbr/\u003e\u003cbr/\u003eA day in the life\u003cbr/\u003eDu arbeitest vor Ort an einem unserer Logistikstandorte. Dort nimmst Du die Prozesse genau unter die Lupe. Du überwachst die Einhaltung der Arbeitsschutzvorschriften und erkennst mögliche Probleme und Chancen für Verbesserungen. Du arbeitest mit Mitarbeiter:innen im gesamten Geschäftsbereich zusammen und lernst ihre Risiken kennen. Du sammelst Daten, um smartere und sicherere Arbeitsweisen umzusetzen. Außerdem entwickelst Du Schulungen und andere Programme, in denen Mitarbeiter:innen neue Sicherheitsprozesse erlernen.\u003cbr/\u003e\u003cbr/\u003eAbout the team\u003cbr/\u003eDer Arbeitsschutz ist wesentlich, um das mentale und körperliche Wohlbefinden unserer Mitarbeitenden am Arbeitsplatz zu gewährleisten. Unser WHS Team sorgt gemeinsam mit Manager:innen, Partnerfirmen und Lokalregierungen an allen unseren Standorten dafür, dass wir alle Richtlinien und rechtlichen Vorschriften für Amazon einhalten und dass unsere Arbeitsplätze sicher sind.\u003cbr/\u003eDas Team umfasst eine Reihe verschiedener Funktionen, von Arbeitsschutzingenieur:innen bis hin zu Programmmanager:innen. Egal in welcher Rolle, Du wirst zur Entwicklung, Umsetzung und Wahrung unserer hohen Arbeitsschutzstandards beitragen. Dabei arbeitest Du potenziell gemeinsam mit Kolleg:innen aus dem ganzen Unternehmen an verschiedenartigen Projekten, von Geräte- und Prozessinspektionen bis hin zur Bewertung von Prozess-, Gebäude- und Gerätedesigns.","department_cost_center":null,"description_short":"Arbeitsschutz und Wohlergehen unserer Mitarbeiter:innen haben für Amazon höchste Priorität. Unsere Safety Specialists spielen dabei eine entscheidende Rolle. In dieser Funktion sorgst Du proaktiv für die","display_distance":null,"id":"54e5defb-6c7b-4f4c-a490-3694d0808209","id_icims":"3138743","is_intern":null,"is_manager":null,"job_category":"Medical, Health, \u0026 Safety","job_family":"Fulfillment Center","job_function_id":null,"job_path":"/en/jobs/3138743/ehs-specialist-fachkraft-fur-arbeitssicherheit","job_schedule_type":"full-time","location":"DE, NW, Witten","locations":["{\"normalizedStateName\":\"North-Rhine-Westphalia\",\"normalizedCountryCode\":\"DEU\",\"city\":\"Witten\",\"countryIso3a\":\"DEU\",\"countryIso2a\":\"DE\",\"locationNonStemming\":\"Germany, NW, Witten\",\"coordinates\":\"51.44033,7.33617\",\"normalizedCountyName\":\"Ennepe-Ruhr-Kreis\",\"type\":\"ONSITE\",\"normalizedCountryName\":\"Germany\",\"normalizedLocation\":\"Witten, North-Rhine-Westphalia, DEU\",\"location\":\"DE, NW, Witten\",\"region\":\"NW\",\"buildingCodeList\":[\"DTM9\"],\"normalizedCityName\":\"Witten\"}"],"normalized_location":"Witten, North-Rhine-Westphalia, DEU","optional_search_labels":[],"posted_date":"December  8, 2025","preferred_qualifications":"- Erfahrung mit Lean-, 5S- oder Kaizen-Methoden\u003cbr/\u003e- Fähigkeit, Umweltinitiativen zu planen oder zu leiten\u003cbr/\u003e\u003cbr/\u003eAmazon is an equal opportunities employer. We believe passionately that employing a diverse workforce is central to our success. We make recruiting decisions based on your experience and skills. We value your passion to discover, invent, simplify and build. Protecting your privacy and the security of your data is a longstanding top priority for Amazon. Please consult our Privacy Notice (\u003ca href=\"https://www.amazon.jobs/en/privacy_page\"\u003ehttps://www.amazon.jobs/en/privacy_page\u003c/a\u003e) to know more about how we collect, use and transfer the personal data of our candidates.\u003cbr/\u003e\u003cbr/\u003em/w/d\u003cbr/\u003e\u003cbr/\u003eOur inclusive culture empowers Amazonians to deliver the best results for our customers. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please visit \u003ca href=\"https://amazon.jobs/content/en/how-we-hire/accommodations\"\u003ehttps://amazon.jobs/content/en/how-we-hire/accommodations\u003c/a\u003e for more information. If the country/region you’re applying in isn’t listed, please contact your Recruiting Partner.","primary_search_label":"fulfillment-ops.team-global-specialty-fulfillment","source_system":"JobCreator","state":"NW","title":"EHS Specialist / Fachkraft für Arbeitssicherheit","university_job":null,"updated_time":"27 minutes","url_next_step":"https://account.amazon.com/jobs/3138743/apply","team":{"id":null,"business_category_id":null,"identifier":null,"label":"team-global-specialty-fulfillment","created_at":null,"updated_at":null,"image_file_name":null,"image_content_type":null,"image_file_size":null,"image_updated_at":null,"thumbnail_file_name":null,"thumbnail_content_type":null,"thumbnail_file_size":null,"thumbnail_updated_at":null,"hide_jobs":null,"title":null,"headline":null,"description":null}}],"job_posting_search_request":"{\"jobPostingSearchRequest\":{\"query\":\"\",\"excludeFacets\":[{\"name\":\"businessCategory\",\"values\":[{\"name\":\"a-confidential-job\"}]},{\"name\":\"isPostedExternally\",\"values\":[{\"name\":\"0\"}]},{\"name\":\"isUnsearchable\",\"values\":[{\"name\":\"1\"}]}],\"filterFacets\":[],\"start\":0,\"size\":10,\"sort\":{\"sortOrder\":\"DESCENDING\",\"sortType\":\"SCORE\"},\"location\":null,\"accessLevel\":\"EXTERNAL\",\"includeFacets\":[],\"locationFacets\":[],\"jobTypeFacets\":[],\"contentFilterFacets\":[],\"treatment\":\"OM\"}}"}